((LANGUAGE . "ar")
 (CALENDARS (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "جمهورية الصي")))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "اسفندار") (11 . "بهمن") (10 . "دي") (9 . "آذر")
       (8 . "آيان") (7 . "مهر") (6 . "شهرفار") (5 . "مرداد") (4 . "تار")
       (3 . "خرداد") (2 . "أذربيهشت") (1 . "فرفردن")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ه‍.ش")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "ريوا") (235 . "هيسي") (234 . "شووا") (233 . "تيشو")
      (232 . "ميجي") (231 . "كيو") (230 . "جنجي") (229 . "بنكيو")
      (228 . "من-ان") (227 . "أنسي") (226 . "كاي") (225 . "كوكا")
      (224 . "تنبو") (223 . "بنسي") (222 . "بنكا") (221 . "كيووا")
      (220 . "كنسي") (219 . "تنمي") (218 . "ان-اي") (217 . "مييوا")
      (216 . "هورياكو") (215 . "كان-ان") (214 . "انكيو (١٧٤٤–١٧٤٨)‏")
      (213 . "كنبو (١٧٤١–١٧٤٤)‏") (212 . "جنبن") (211 . "كيوهو")
      (210 . "شوتكو") (209 . "هويي") (208 . "جنركو") (207 . "جوكيو")
      (206 . "تنوا") (205 . "انبو") (204 . "كنبن") (203 . "منجي")
      (202 . "ميرياكو") (201 . "شوو (١٦٥٢–١٦٥٥)‏") (200 . "كيان")
      (199 . "شوهو (١٦٤٤–١٦٤٨)‏") (198 . "كان-اي") (197 . "جنوا")
      (196 . "كيتشو") (195 . "بنركو") (194 . "تنشو (١٥٧٣–١٥٩٢)‏")
      (193 . "جنكي") (192 . "ايركو") (191 . "كوجي (١٥٥٥–١٥٥٨)‏") (190 . "تنمن")
      (189 . "كيوركو") (188 . "تييي") (187 . "ايشو (١٥٠٤–١٥٢١)‏")
      (186 . "بنكي") (185 . "ميو") (184 . "انتكو")
      (183 . "تشوكيو (١٤٨٧–١٤٨٩)‏") (182 . "بنمي") (181 . "أونين")
      (180 . "بنشو") (179 . "كنشو") (178 . "تشوركو") (177 . "كوشو")
      (176 . "كيوتكو") (175 . "هوتكو") (174 . "بن-أن") (173 . "ككيتسو")
      (172 . "ايكيو (١٤٢٩–١٤٤١)‏") (171 . "شوتشو (١٤٢٨–١٤٢٩)‏") (170 . "أويي")
      (169 . "مييتكو (١٣٩٠–١٣٩٤)‏") (168 . "كو") (167 . "كاكي")
      (166 . "مييتكو (١٣٨٤–١٣٨٧)‏") (165 . "جنتشو") (164 . "كووا (١٣٨١–١٣٨٤)‏")
      (163 . "كورياكو") (162 . "تنجو") (161 . "بنتشو") (160 . "كنتكو")
      (159 . "شوهي") (158 . "كوككو") (157 . "إنجن") (156 . "كمو")
      (155 . "جنكو") (154 . "جنتكو") (153 . "كريكي")
      (152 . "شوتشو (١٣٢٤–١٣٢٦)‏") (151 . "جنكيو (١٣٢١–١٣٢٤)‏") (150 . "جنو")
      (149 . "بنبو") (148 . "شووا (١٣١٢–١٣١٧)‏") (147 . "أوتشو") (146 . "انكي")
      (145 . "توكجي") (144 . "كجن") (143 . "كنجن") (142 . "شوان")
      (141 . "اينين") (140 . "شوو (١٢٨٨–١٢٩٣)‏") (139 . "كوان") (138 . "كنجي")
      (137 . "بن-اي") (136 . "كوتشو") (135 . "بن-أو")
      (134 . "شوجن (١٢٥٩–١٢٦٠)‏") (133 . "شوكا") (132 . "كوجن") (131 . "كنتشو")
      (130 . "هوجي") (129 . "كنجين") (128 . "نينجي") (127 . "ان-أو")
      (126 . "رياكنين") (125 . "كاتيي") (124 . "بنرياكو") (123 . "تمبكو")
      (122 . "جويي") (121 . "كنكي") (120 . "أنتيي") (119 . "كروكو")
      (118 . "جيننين") (117 . "جو") (116 . "شوكيو") (115 . "كنبو (١٢١٣–١٢١٩)‏")
      (114 . "كنرياكو") (113 . "شوجن (١٢٠٧–١٢١١)‏") (112 . "كن-اي")
      (111 . "جنكيو (١٢٠٤–١٢٠٦)‏") (110 . "كنين") (109 . "شوجي")
      (108 . "كنكيو") (107 . "بنجي") (106 . "جنريوكو") (105 . "جيي")
      (104 . "يووا") (103 . "جيشو") (102 . "أنجين") (101 . "شون") (100 . "كاو")
      (99 . "نين-ان") (98 . "ايمان") (97 . "تشوكان") (96 . "أوهو")
      (95 . "ايرياكو") (94 . "هيجي") (93 . "هجين") (92 . "كيوجو")
      (91 . "نينبيي") (90 . "كيوان") (89 . "تنيو") (88 . "كوجي (١١٤٢–١١٤٤)‏")
      (87 . "ايجي") (86 . "هوين") (85 . "تشوشو") (84 . "تنشو (١١٣١–١١٣٢)‏")
      (83 . "ديجي") (82 . "تنجي") (81 . "هوان") (80 . "جن-اي")
      (79 . "ايكيو (١١١٣–١١١٨)‏") (78 . "تن-اي") (77 . "تنين") (76 . "كاشو")
      (75 . "تشوجي") (74 . "كووا (١٠٩٩–١١٠٤)‏") (73 . "شوتوكو") (72 . "ايتشو")
      (71 . "كاهو") (70 . "كانجي") (69 . "أوتوكو") (68 . "ايهو")
      (67 . "شورياكو (١٠٧٧–١٠٨١)‏") (66 . "شوهو (١٠٧٤–١٠٧٧)‏")
      (65 . "انكيو (١٠٦٩–١٠٧٤)‏") (64 . "جيرياكو") (63 . "كوهيي")
      (62 . "تينجي") (61 . "ايشو (١٠٤٦–١٠٥٣)‏") (60 . "كانتوكو")
      (59 . "تشوكيو (١٠٤٠–١٠٤٤)‏") (58 . "تشورياكو") (57 . "تشوجين")
      (56 . "مانجو") (55 . "جاين") (54 . "كانين") (53 . "تشووا") (52 . "كانكو")
      (51 . "تشوهو") (50 . "تشوتوكو") (49 . "شورياكو (٩٩٠–٩٩٥)‏") (48 . "ايسو")
      (47 . "اي-ان") (46 . "كانا") (45 . "إيكان") (44 . "تنجن") (43 . "جوجن")
      (42 . "تن-نن") (41 . "تينروكو") (40 . "آنا") (39 . "كوهو") (38 . "أووا")
      (37 . "تنتوكو") (36 . "تنرياكو") (35 . "تنجيو") (34 . "شوهيي")
      (33 . "انتشو") (32 . "انجي") (31 . "شوتاي") (30 . "كامبيو") (29 . "نينا")
      (28 . "جينكيي") (27 . "جوجان") (26 . "تنان") (25 . "سيكو") (24 . "نينجو")
      (23 . "كاجو") (22 . "شووا (٨٣٤–٨٤٨)‏") (21 . "تنتشو") (20 . "كونين")
      (19 . "ديدو") (18 . "إنرياكو") (17 . "تن-أو") (16 . "هوكي")
      (15 . "جينجو-كيين") (14 . "تمفو-جينجو") (13 . "تمبيو-هوجي")
      (12 . "تمبيو-شوهو") (11 . "تمبيو-كامبو") (10 . "تمبيو") (9 . "جينكي")
      (8 . "يورو") (7 . "رييكي") (6 . "وادو") (5 . "كيين") (4 . "تيهو")
      (3 . "شتشو") (2 . "هاكهو") (1 . "هاكتشي") (0 . "تيكا")))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "١٢") (11 . "١١") (10 . "١٠") (9 . "٩") (8 . "٨")
       (7 . "٧") (6 . "٦") (5 . "٥") (4 . "٤") (3 . "٣") (2 . "٢") (1 . "١"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ذو الحجة") (11 . "ذو القعدة") (10 . "شوال") (9 . "رمضان")
       (8 . "شعبان") (7 . "رجب") (6 . "جمادى الآخرة") (5 . "جمادى الأولى")
       (4 . "ربيع الآخر") (3 . "ربيع الأول") (2 . "صفر") (1 . "محرم")))
     (ABBREVIATED
      (DEFAULT (12 . "ذو الحجة") (11 . "ذو القعدة") (10 . "شوال") (9 . "رمضان")
       (8 . "شعبان") (7 . "رجب") (6 . "جمادى الآخرة") (5 . "جمادى الأولى")
       (4 . "ربيع الآخر") (3 . "ربيع الأول") (2 . "صفر") (1 . "محرم")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "هـ"))))
   (DATE-FORMATS (SHORT (PATTERN . "d‏/M‏/y GGGGG"))
    (MEDIUM (PATTERN . "d MMM y G")) (LONG (PATTERN . "d MMMM y G"))
    (FULL (PATTERN . "EEEE، d MMMM y G"))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "أيلول") (12 . "آب") (11 . "تموز") (10 . "سيفان")
       (9 . "أيار") (8 . "نيسان") (7 . "آذار الثاني") (7 . "آذار")
       (6 . "آذار الأول") (5 . "شباط") (4 . "طيفت") (3 . "كيسلو")
       (2 . "مرحشوان") (1 . "تشري")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ص")))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "د") (11 . "ب") (10 . "ك") (9 . "س") (8 . "غ") (7 . "ل")
       (6 . "ن") (5 . "و") (4 . "أ") (3 . "م") (2 . "ف") (1 . "ي"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ديسمبر") (11 . "نوفمبر") (10 . "أكتوبر") (9 . "سبتمبر")
       (8 . "أغسطس") (7 . "يوليو") (6 . "يونيو") (5 . "مايو") (4 . "أبريل")
       (3 . "مارس") (2 . "فبراير") (1 . "يناير")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "س") (FRI . "ج") (THU . "خ") (WED . "ر") (TUE . "ث")
       (MON . "ن") (SUN . "ح"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "السبت") (FRI . "الجمعة") (THU . "الخميس")
       (WED . "الأربعاء") (TUE . "الثلاثاء") (MON . "الاثنين")
       (SUN . "الأحد")))
     (SHORT
      (DEFAULT (SAT . "سبت") (FRI . "جمعة") (THU . "خميس") (WED . "أربعاء")
       (TUE . "ثلاثاء") (MON . "إثنين") (SUN . "أحد")))))
   (QUARTERS
    (STAND-ALONE (NARROW (DEFAULT (4 . "٤") (3 . "٣") (2 . "٢") (1 . "١"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "الربع الرابع") (3 . "الربع الثالث") (2 . "الربع الثاني")
       (1 . "الربع الأول")))))
   (DAY-PERIODS
    (STAND-ALONE
     (WIDE
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "منتصف الليل") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "صباحًا")
       (MORNING1 . "فجرًا") (PM . "مساءً") (AM . "صباحًا")))
     (NARROW
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "منتصف الليل") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "صباحًا")
       (MORNING1 . "فجرًا")))
     (ABBREVIATED
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "منتصف الليل") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "ص")
       (MORNING1 . "فجرًا"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "في المساء") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "صباحًا")
       (MORNING1 . "في الصباح")))
     (NARROW
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "منتصف الليل") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "صباحًا")
       (MORNING1 . "فجرًا")))
     (ABBREVIATED
      (DEFAULT (NIGHT2 . "ليلاً") (NIGHT1 . "في المساء") (EVENING1 . "مساءً")
       (AFTERNOON2 . "بعد الظهر") (AFTERNOON1 . "ظهرًا") (MORNING2 . "ص")
       (MORNING1 . "فجرًا") (PM . "م") (AM . "ص")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "ب.م") (0 . "ق. م"))
     (DEFAULT (1 . "م") (0 . "ق.م")))
    (WIDE (VARIANT (1 . "بعد الميلاد") (0 . "قبل الحقبة الحالية"))
     (DEFAULT (1 . "ميلادي") (0 . "قبل الميلاد"))))
   (DATE-FORMATS (SHORT (PATTERN . "d‏/M‏/y")) (MEDIUM (PATTERN . "dd‏/MM‏/y"))
    (LONG (PATTERN . "d MMMM y")) (FULL (PATTERN . "EEEE، d MMMM y")))
   (TIME-FORMATS (SHORT (PATTERN . "h:mm a")) (MEDIUM (PATTERN . "h:mm:ss a"))
    (LONG (PATTERN . "h:mm:ss a z")) (FULL (PATTERN . "h:mm:ss a zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}، {0}"))
    (MEDIUM (PATTERN . "{1}، {0}")) (LONG (PATTERN . "{1}، {0}"))
    (FULL (PATTERN . "{1}، {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d‏/M‏/y GGGGG"))
    (MEDIUM (PATTERN . "dd‏/MM‏/y G")) (LONG (PATTERN . "d MMMM y G"))
    (FULL (PATTERN . "EEEE، d MMMM y G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}، {0}")) (LONG (PATTERN . "{1}، {0}"))
    (FULL (PATTERN . "{1}، {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "باجمن") (12 . "نهاس") (11 . "هامل") (10 . "سين")
       (9 . "جنبت") (8 . "ميازيا") (7 . "مجابيت") (6 . "يكتت") (5 . "تر")
       (4 . "تهساس") (3 . "هدار") (2 . "تكمت") (1 . "مسكريم"))))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "١٣") (12 . "١٢") (11 . "١١") (10 . "١٠") (9 . "٩")
       (8 . "٨") (7 . "٧") (6 . "٦") (5 . "٥") (4 . "٤") (3 . "٣") (2 . "٢")
       (1 . "١"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "نسيئ") (12 . "مسرى") (11 . "أبيب") (10 . "بؤونة")
       (9 . "بشنس") (8 . "برمودة") (7 . "برمهات") (6 . "أمشير") (5 . "طوبة")
       (4 . "كيهك") (3 . "هاتور") (2 . "بابه") (1 . "توت"))))))
  (BUDDHIST (ERAS (WIDE (DEFAULT (0 . "التقويم البوذي")))))))
