((LANGUAGE . "ar") (TERRITORY . "JO")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ك") (11 . "ت") (10 . "ت") (9 . "أ") (8 . "آ") (7 . "ت")
       (6 . "ح") (5 . "أ") (4 . "ن") (3 . "آ") (2 . "ش") (1 . "ك"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "كانون الأول") (11 . "تشرين الثاني") (10 . "تشرين الأول")
       (9 . "أيلول") (8 . "آب") (7 . "تموز") (6 . "حزيران") (5 . "أيار")
       (4 . "نيسان") (3 . "آذار") (2 . "شباط") (1 . "كانون الثاني"))))))))
