((LANGUAGE . "bn")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "মিঙ্গুয়া") (0 . "আগে R.O.C.")))))
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯") (8 . "৮")
       (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩") (2 . "২") (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "এসফ্যান্ড") (11 . "বাহমান") (10 . "দে") (9 . "বাজার")
       (8 . "আবান") (7 . "মেহের") (6 . "শাহরিবার") (5 . "মর্যাদ") (4 . "তীর")
       (3 . "খোর্দ্দ") (2 . "অরডিবেহেশ্ত") (1 . "ফ্যাভার্ডিন")))
     (ABBREVIATED
      (DEFAULT (12 . "এসফ্যান্ড") (11 . "বাহমান") (10 . "দে") (9 . "সেপ্ট")
       (8 . "আবান") (7 . "মেহের") (6 . "শাহরিবার") (5 . "মর্যাদ") (4 . "তীর")
       (3 . "খোর্দ্দ") (2 . "অরডিবেহেশ্ত") (1 . "ফ্যাভার্ডিন"))))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯") (8 . "৮")
       (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩") (2 . "২") (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "জ্বিলহজ্জ") (11 . "জ্বিলকদ") (10 . "শাওয়াল")
       (9 . "রমজান") (8 . "শা‘বান") (7 . "রজব") (6 . "জমাদিউস সানি")
       (5 . "জমাদিউল আউয়াল") (4 . "রবিউস সানি") (3 . "রবিউল আউয়াল")
       (2 . "সফর") (1 . "মহররম")))
     (ABBREVIATED
      (DEFAULT (12 . "জ্বিলহজ্জ") (11 . "জ্বিলকদ") (10 . "শাওয়াল")
       (9 . "রমজান") (8 . "শা‘বান") (7 . "রজব") (6 . "জমাদিউস সানি")
       (5 . "জমাদিউল আউয়াল") (4 . "রবিউস সানি") (3 . "রবিউল আউয়াল")
       (2 . "সফর") (1 . "মহররম")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "যুগ")))))
  (INDIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯") (8 . "৮")
       (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩") (2 . "২") (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ফাল্গুন") (11 . "মাঘ") (10 . "পৌষ") (9 . "অগ্রহায়ণ")
       (8 . "কার্তিক") (7 . "আশ্বিন") (6 . "ভাদ্র") (5 . "শ্রাবণ")
       (4 . "আষাঢ়") (3 . "জৈষ্ঠ্য") (2 . "বৈশাখ") (1 . "চৈত্র")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "সাল")))))
  (HEBREW
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "১৩") (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯")
       (8 . "৮") (7 . "৭") (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩")
       (2 . "২") (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "এলুল") (12 . "অভ") (11 . "তামুজ") (10 . "সিভান")
       (9 . "আয়ার") (8 . "নিশান") (7 . "আডার II") (7 . "আডার") (6 . "আডার I")
       (5 . "শেভাত") (4 . "তেভেত") (3 . "কিসলেভ") (2 . "হেশভান")
       (1 . "তিশরি"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ডি") (11 . "ন") (10 . "অ") (9 . "সে") (8 . "আ")
       (7 . "জু") (6 . "জুন") (5 . "মে") (4 . "এ") (3 . "মা") (2 . "ফে")
       (1 . "জা")))
     (ABBREVIATED
      (DEFAULT (12 . "ডিসেম্বর") (11 . "নভেম্বর") (10 . "অক্টোবর")
       (9 . "সেপ্টেম্বর") (8 . "আগস্ট") (7 . "জুলাই") (6 . "জুন") (5 . "মে")
       (4 . "এপ্রিল") (3 . "মার্চ") (2 . "ফেব") (1 . "জানু"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ডিসেম্বর") (11 . "নভেম্বর") (10 . "অক্টোবর")
       (9 . "সেপ্টেম্বর") (8 . "আগস্ট") (7 . "জুলাই") (6 . "জুন") (5 . "মে")
       (4 . "এপ্রিল") (3 . "মার্চ") (2 . "ফেব্রুয়ারী") (1 . "জানুয়ারী")))
     (ABBREVIATED
      (DEFAULT (12 . "ডিসে") (11 . "নভে") (10 . "অক্টো") (9 . "সেপ") (8 . "আগ")
       (7 . "জুল") (6 . "জুন") (5 . "মে") (4 . "এপ্রি") (3 . "মার্চ")
       (2 . "ফেব") (1 . "জানু")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "শ") (FRI . "শু") (THU . "বৃ") (WED . "বু") (TUE . "ম")
       (MON . "সো") (SUN . "র"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "শনিবার") (FRI . "শুক্রবার") (THU . "বৃহস্পতিবার")
       (WED . "বুধবার") (TUE . "মঙ্গলবার") (MON . "সোমবার") (SUN . "রবিবার")))
     (SHORT
      (DEFAULT (SAT . "শনি") (FRI . "শুঃ") (THU . "বৃঃ") (WED . "বুঃ")
       (TUE . "মঃ") (MON . "সোঃ") (SUN . "রঃ")))
     (ABBREVIATED
      (DEFAULT (SAT . "শনি") (FRI . "শুক্র") (THU . "বৃহস্পতি") (WED . "বুধ")
       (TUE . "মঙ্গল") (MON . "সোম") (SUN . "রবি")))))
   (QUARTERS
    (STAND-ALONE (NARROW (DEFAULT (4 . "৪") (3 . "৩") (2 . "২") (1 . "১")))
     (ABBREVIATED (DEFAULT (4 . "Q4") (3 . "Q3") (2 . "Q2") (1 . "Q1"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "চতুর্থ ত্রৈমাসিক") (3 . "তৃতীয় ত্রৈমাসিক")
       (2 . "দ্বিতীয় ত্রৈমাসিক") (1 . "ত্রৈমাসিক")))))
   (DAY-PERIODS
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "রাত্রিবেলায়") (EVENING1 . "সন্ধ্যাবেলায়")
       (AFTERNOON2 . "বিকাল") (AFTERNOON1 . "দুপুরবেলায়")
       (MORNING2 . "সকালবেলায়") (MORNING1 . "ভোরবেলায়")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "রাত্রি") (EVENING1 . "সন্ধ্যা")
       (AFTERNOON2 . "বিকাল") (AFTERNOON1 . "দুপুর") (MORNING2 . "সকাল")
       (MORNING1 . "ভোর")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "খ্রিষ্টাব্দ") (0 . "\"খ্রিঃপূঃ\""))
     (DEFAULT (1 . "খৃষ্টাব্দ") (0 . "খ্রিস্টপূর্ব")))
    (WIDE (DEFAULT (1 . "খ্রীষ্টাব্দ"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "d MMM, y"))
    (LONG (PATTERN . "d MMMM, y")) (FULL (PATTERN . "EEEE, d MMMM, y")))
   (TIME-FORMATS (SHORT (PATTERN . "h:mm a")) (MEDIUM (PATTERN . "h:mm:ss a"))
    (LONG (PATTERN . "h:mm:ss a z")) (FULL (PATTERN . "h:mm:ss a zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y GGGGG"))
    (MEDIUM (PATTERN . "d MMM, y G")) (LONG (PATTERN . "d MMMM, y G"))
    (FULL (PATTERN . "EEEE, d MMMM, y G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "১৩") (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯")
       (8 . "৮") (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩") (2 . "২")
       (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "পাগুমেন") (12 . "নেহাসে") (11 . "হ্যামলি") (10 . "সিনি")
       (9 . "গেনবট") (8 . "মিয়াজিয়া") (7 . "মেগাবিট") (6 . "ইয়েকাটিট")
       (5 . "টের") (4 . "তাহসাস") (3 . "হিডার") (2 . "টেকেমট")
       (1 . "মাস্কেরেম")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "যুগ ১") (0 . "যুগ ০")))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "১৩") (12 . "১২") (11 . "১১") (10 . "১০") (9 . "৯")
       (8 . "৮") (7 . "৭") (6 . "৬") (5 . "৫") (4 . "৪") (3 . "৩") (2 . "২")
       (1 . "১"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ন্যাশি") (12 . "মেশ্রা") (11 . "এপেপ") (10 . "পাওনা")
       (9 . "বাসহান্স") (8 . "বারামৌডা") (7 . "বারামহাট") (6 . "আমশির")
       (5 . "টোবা") (4 . "কিয়াক") (3 . "হাটর") (2 . "বাবা") (1 . "টাউট")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "যুগ ১") (0 . "যুগ ০")))))))
