((LANGUAGE . "ce")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "Д") (11 . "Н") (10 . "О") (9 . "С") (8 . "А") (7 . "И")
       (6 . "И") (5 . "М") (4 . "А") (3 . "М") (2 . "Ф") (1 . "Я"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "декабрь") (11 . "ноябрь") (10 . "октябрь")
       (9 . "сентябрь") (8 . "август") (7 . "июль") (6 . "июнь") (5 . "май")
       (4 . "апрель") (3 . "март") (2 . "февраль") (1 . "январь")))
     (ABBREVIATED
      (DEFAULT (12 . "дек") (11 . "ноя") (10 . "окт") (9 . "сен") (8 . "авг")
       (7 . "июл") (6 . "июн") (5 . "май") (4 . "апр") (3 . "мар") (2 . "фев")
       (1 . "янв")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "ш") (FRI . "пӀ") (THU . "е") (WED . "кх") (TUE . "ш")
       (MON . "о") (SUN . "кӀ"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "шуот") (FRI . "пӀераска") (THU . "еара")
       (WED . "кхаара") (TUE . "шинара") (MON . "оршот") (SUN . "кӀира")))
     (NARROW
      (DEFAULT (SAT . "шуо") (FRI . "пӀе") (THU . "еа") (WED . "кха")
       (TUE . "ши") (MON . "ор") (SUN . "кӀи")))
     (ABBREVIATED
      (DEFAULT (SAT . "шуо") (FRI . "пӀе") (THU . "еа") (WED . "кха")
       (TUE . "ши") (MON . "ор") (SUN . "кӀи")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "4-гӀа квартал") (3 . "3-гӀа квартал")
       (2 . "2-гӀа квартал") (1 . "1-гӀа квартал")))
     (ABBREVIATED
      (DEFAULT (4 . "4-гӀа кв.") (3 . "3-гӀа кв.") (2 . "2-гӀа кв.")
       (1 . "1-гӀа кв.")))))
   (ERAS
    (ABBREVIATED (VARIANT (0 . "МАССО"))
     (DEFAULT (1 . "в. э") (0 . "в. э. тӀ. я")))
    (WIDE (VARIANT (1 . "вайн эрехь") (0 . "вайн эра тӀеяле"))
     (DEFAULT (1 . "Ӏийса пайхамар вина дийнахь дуьйна")
      (0 . "Ӏийса пайхамар вина де кхачале")))))))
