((LANGUAGE . "csw")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ᐸᐘᐢᒐᑲᓂᓹᐱᓯᒼ") (11 . "ᐊᑿᑎᓄᐏᐱᓯᒼ") (10 . "ᐱᒪᐦᐊᒧᐏᐱᓯᒼ")
       (9 . "ᑕᐦᑿᑭᐱᓯᒼ") (8 . "ᐅᐸᐦᐅᐏᐱᓯᒼ") (7 . "ᐸᐢᑯᐏᐱᓯᒼ") (6 . "ᐸᐢᑲᐍᐦᐅᐱᓯᒼ")
       (5 . "ᓴᑭᐸᑲᐏᐱᓯᒼ") (4 . "ᐊᓂᑭᐱᓯᒼ") (3 . "ᓂᐢᑭᐱᓯᒼ") (2 . "ᒥᑭᓯᐏᐱᓯᒼ")
       (1 . "ᑭᓴᐱᓯᒼ")))))
   (DAYS
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "ᒪᑎᓄᐏᑭᓯᑲᐤ") (FRI . "ᓂᔭᓇᓄᑭᓯᑲᐤ") (THU . "ᓀᐓᑭᓯᑲᐤ")
       (WED . "ᐊᐱᐦᑕᐘᐣ") (TUE . "ᓂᓱᑭᓯᑲᐤ") (MON . "ᐯᔭᐠᑭᓯᑲᐤ")
       (SUN . "ᐊᔭᒥᐦᐁᐃ ᑭᓯᑲᐤ"))))))))
