((LANGUAGE . "el") (VARIANT . "POLYTON")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Δεκέμβριος") (11 . "Νοέμβριος") (10 . "Ὀκτώβριος")
       (9 . "Σεπτέμβριος") (8 . "Αὔγουστος") (7 . "Ιούλιος") (6 . "Ιούνιος")
       (5 . "Μάιος") (4 . "Απρίλιος") (3 . "Μάρτιος") (2 . "Φεβρουάριος")
       (1 . "Ιανουάριος"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Δεκεμβρίου") (11 . "Νοεμβρίου") (10 . "Ὀκτωβρίου")
       (9 . "Σεπτεμβρίου") (8 . "Αὐγούστου") (7 . "Ιουλίου") (6 . "Ιουνίου")
       (5 . "Μαΐου") (4 . "Απριλίου") (3 . "Μαρτίου") (2 . "Φεβρουαρίου")
       (1 . "Ιανουαρίου")))
     (ABBREVIATED
      (DEFAULT (12 . "Δεκ") (11 . "Νοε") (10 . "Ὀκτ") (9 . "Σεπ") (8 . "Αὐγ")
       (7 . "Ιουλ") (6 . "Ιουν") (5 . "Μαΐ") (4 . "Απρ") (3 . "Μαρ")
       (2 . "Φεβ") (1 . "Ιαν"))))))))
