((LANGUAGE . "en") (SCRIPT . "Dsrt")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "𐐔") (11 . "𐐤") (10 . "𐐉") (9 . "𐐝") (8 . "𐐂") (7 . "𐐖")
       (6 . "𐐖") (5 . "𐐣") (4 . "𐐁") (3 . "𐐣") (2 . "𐐙") (1 . "𐐖"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "𐐔𐐨𐑅𐐯𐑋𐐺𐐲𐑉") (11 . "𐐤𐐬𐑂𐐯𐑋𐐺𐐲𐑉") (10 . "𐐉𐐿𐐻𐐬𐐺𐐲𐑉")
       (9 . "𐐝𐐯𐐹𐐻𐐯𐑋𐐺𐐲𐑉") (8 . "𐐂𐑀𐐲𐑅𐐻") (7 . "𐐖𐐭𐑊𐐴") (6 . "𐐖𐐭𐑌") (5 . "𐐣𐐩")
       (4 . "𐐁𐐹𐑉𐐮𐑊") (3 . "𐐣𐐪𐑉𐐽") (2 . "𐐙𐐯𐐺𐑉𐐭𐐯𐑉𐐨") (1 . "𐐖𐐰𐑌𐐷𐐭𐐯𐑉𐐨")))
     (ABBREVIATED
      (DEFAULT (12 . "𐐔𐐨𐑅") (11 . "𐐤𐐬𐑂") (10 . "𐐉𐐿𐐻") (9 . "𐐝𐐯𐐹") (8 . "𐐂𐑀")
       (7 . "𐐖𐐭𐑊") (6 . "𐐖𐐭𐑌") (5 . "𐐣𐐩") (4 . "𐐁𐐹𐑉") (3 . "𐐣𐐪𐑉") (2 . "𐐙𐐯𐐺")
       (1 . "𐐖𐐰𐑌")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "𐐝") (FRI . "𐐙") (THU . "𐐛") (WED . "𐐎") (TUE . "𐐓")
       (MON . "𐐣") (SUN . "𐐝"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "𐐝𐐰𐐻𐐲𐑉𐐼𐐩") (FRI . "𐐙𐑉𐐴𐐼𐐩") (THU . "𐐛𐐲𐑉𐑆𐐼𐐩")
       (WED . "𐐎𐐯𐑌𐑆𐐼𐐩") (TUE . "𐐓𐐭𐑆𐐼𐐩") (MON . "𐐣𐐲𐑌𐐼𐐩") (SUN . "𐐝𐐲𐑌𐐼𐐩")))
     (ABBREVIATED
      (DEFAULT (SAT . "𐐝𐐰𐐻") (FRI . "𐐙𐑉𐐴") (THU . "𐐛𐐲𐑉") (WED . "𐐎𐐯𐑌")
       (TUE . "𐐓𐐭𐑆") (MON . "𐐣𐐲𐑌") (SUN . "𐐝𐐲𐑌")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "4𐑉𐑃 𐐿𐐶𐐪𐑉𐐻𐐲𐑉") (3 . "3𐑉𐐼 𐐿𐐶𐐪𐑉𐐻𐐲𐑉") (2 . "2𐑌𐐼 𐐿𐐶𐐪𐑉𐐻𐐲𐑉")
       (1 . "1𐑅𐐻 𐐿𐐶𐐪𐑉𐐻𐐲𐑉")))
     (ABBREVIATED (DEFAULT (4 . "𐐗4") (3 . "𐐗3") (2 . "𐐗2") (1 . "𐐗1")))))
   (DAY-PERIODS
    (FORMAT
     (ABBREVIATED (VARIANT (PM . "𐐹𐑋") (AM . "𐐰𐑋"))
      (DEFAULT (PM . "𐐑𐐣") (AM . "𐐈𐐣")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "𐐈𐐔") (0 . "𐐒𐐗")))
    (NARROW (DEFAULT (1 . "𐐈") (0 . "𐐒")))
    (WIDE (DEFAULT (1 . "𐐈𐑌𐐬 𐐔𐐱𐑋𐐮𐑌𐐨") (0 . "𐐒𐐲𐑁𐐬𐑉 𐐗𐑉𐐴𐑅𐐻")))))))
