((LANGUAGE . "fa") (TERRITORY . "AF")
 (CALENDARS
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ح") (11 . "د") (10 . "ج") (9 . "ق") (8 . "ع") (7 . "م")
       (6 . "س") (5 . "ا") (4 . "س") (3 . "ج") (2 . "ث") (1 . "ح"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "حوت") (11 . "دلو") (10 . "جدی") (9 . "قوس") (8 . "عقرب")
       (7 . "میزان") (6 . "سنبلهٔ") (5 . "اسد") (4 . "سرطان") (3 . "جوزا")
       (2 . "ثور") (1 . "حمل"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "دسمبر") (11 . "نومبر") (10 . "اکتوبر") (9 . "سپتمبر")
       (8 . "اگست") (7 . "جولای") (6 . "جون") (5 . "می") (4 . "اپریل")
       (3 . "مارچ") (2 . "فبروری") (1 . "جنوری")))
     (NARROW
      (DEFAULT (12 . "د") (11 . "ن") (10 . "ا") (9 . "س") (8 . "ا") (7 . "ج")
       (6 . "ج") (5 . "م") (4 . "ا") (3 . "م") (2 . "ف") (1 . "ج")))
     (ABBREVIATED
      (DEFAULT (12 . "دسمبر") (11 . "نومبر") (10 . "اکتوبر") (9 . "سپتمبر")
       (8 . "اگست") (7 . "جولای") (6 . "جون") (5 . "می") (4 . "اپریل")
       (3 . "مارچ") (2 . "فبروری") (1 . "جنوری"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "دسمبر") (11 . "نومبر") (10 . "اکتوبر") (9 . "سپتمبر")
       (8 . "اگست") (7 . "جولای") (6 . "جون") (5 . "می") (4 . "اپریل")
       (3 . "مارچ") (2 . "فبروری") (1 . "جنوری")))
     (ABBREVIATED
      (DEFAULT (12 . "دسم") (11 . "نومبر") (10 . "اکتوبر") (9 . "سپتمبر")
       (8 . "اگست") (7 . "جول") (6 . "جون") (5 . "می") (4 . "اپریل")
       (3 . "مارچ") (2 . "فبروری") (1 . "جنو")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "ربع چهارم") (3 . "ربع سوم") (2 . "ربع دوم")
       (1 . "ربع اول")))
     (ABBREVIATED (DEFAULT (4 . "ر۴") (3 . "ر۳") (2 . "ر۲") (1 . "ر۱")))))
   (DAY-PERIODS
    (STAND-ALONE
     (NARROW
      (DEFAULT (NIGHT1 . "شب") (AFTERNOON1 . "بعد از چاشت")
       (MORNING1 . "بامداد"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT2 . "نیمه‌شب") (NIGHT1 . "شب") (AFTERNOON2 . "بعدازچاشت")
       (AFTERNOON1 . "ظهر") (MORNING2 . "صبح") (MORNING1 . "بامداد")))
     (ABBREVIATED
      (DEFAULT (NIGHT2 . "نیمه‌شب") (NIGHT1 . "شب") (AFTERNOON2 . "بعدازچاشت")
       (AFTERNOON1 . "ظهر") (MORNING2 . "صبح") (MORNING1 . "بامداد"))))))))
