((LANGUAGE . "ha") (SCRIPT . "Arab")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "دِسَمْبَ") (11 . "نُوَمْبَ") (10 . "أُكْتوُبَ")
       (9 . "سَتُمْبَ") (8 . "أَغُسْتَ") (7 . "يُولِ") (6 . "يُونِ")
       (5 . "مَيُ") (4 . "أَڢْرِلُ") (3 . "مَرِسْ") (2 . "ڢَبْرَيْرُ")
       (1 . "جَنَيْرُ")))
     (ABBREVIATED
      (DEFAULT (12 . "دِس") (11 . "نُو") (10 . "أُكْت") (9 . "سَت")
       (8 . "أَغُ") (7 . "يُول") (6 . "يُون") (5 . "مَي") (4 . "أَڢْر")
       (3 . "مَر") (2 . "ڢَب") (1 . "جَن")))))
   (DAYS
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "أَسَبَرْ") (FRI . "جُمَعَ") (THU . "أَلْحَمِسْ")
       (WED . "لَرَبَ") (TUE . "تَلَتَ") (MON . "لِتِنِنْ") (SUN . "لَحَدِ")))
     (ABBREVIATED
      (DEFAULT (SAT . "أَسَ") (FRI . "جُم") (THU . "أَلْح") (WED . "لَر")
       (TUE . "تَل") (MON . "لِت") (SUN . "لَح")))))
   (DAY-PERIODS (FORMAT (ABBREVIATED (DEFAULT (PM . "P.M.") (AM . "A.M.")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "مِلَدِ") (0 . "غَبَنِنْ مِلَدِ")))))))
