((LANGUAGE . "ja")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "民国") (0 . "民国前"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/MM/dd")) (MEDIUM (PATTERN . "Gy/MM/dd"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "エスファンド") (11 . "バフマン") (10 . "デイ") (9 . "アーザル")
       (8 . "アーバーン") (7 . "メフル") (6 . "シャハリーヴァル") (5 . "モルダード") (4 . "ティール")
       (3 . "ホルダード") (2 . "オルディーベヘシュト") (1 . "ファルヴァルディーン"))))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "令和") (235 . "平成") (234 . "昭和") (233 . "大正") (232 . "明治")
      (231 . "慶応") (230 . "元治") (229 . "文久") (228 . "万延") (227 . "安政")
      (226 . "嘉永") (225 . "弘化") (224 . "天保") (223 . "文政") (222 . "文化")
      (221 . "享和") (220 . "寛政") (219 . "天明") (218 . "安永") (217 . "明和")
      (216 . "宝暦") (215 . "寛延") (214 . "延享") (213 . "寛保") (212 . "元文")
      (211 . "享保") (210 . "正徳") (209 . "宝永") (208 . "元禄") (207 . "貞享")
      (206 . "天和") (205 . "延宝") (204 . "寛文") (203 . "万治") (202 . "明暦")
      (201 . "承応") (200 . "慶安") (199 . "正保") (198 . "寛永") (197 . "元和")
      (196 . "慶長") (195 . "文禄") (194 . "天正") (193 . "元亀") (192 . "永禄")
      (191 . "弘治") (190 . "天文") (189 . "享禄") (188 . "大永") (187 . "永正")
      (186 . "文亀") (185 . "明応") (184 . "延徳") (183 . "長享") (182 . "文明")
      (181 . "応仁") (180 . "文正") (179 . "寛正") (178 . "長禄") (177 . "康正")
      (176 . "享徳") (175 . "宝徳") (174 . "文安") (173 . "嘉吉") (172 . "永享")
      (171 . "正長") (170 . "応永") (169 . "明徳") (168 . "康応") (167 . "嘉慶")
      (166 . "至徳") (165 . "元中") (164 . "弘和") (163 . "康暦") (162 . "天授")
      (161 . "文中") (160 . "建徳") (159 . "正平") (158 . "興国") (157 . "延元")
      (156 . "建武") (155 . "元弘") (154 . "元徳") (153 . "嘉暦") (152 . "正中")
      (151 . "元亨") (150 . "元応") (149 . "文保") (148 . "正和") (147 . "応長")
      (146 . "延慶") (145 . "徳治") (144 . "嘉元") (143 . "乾元") (142 . "正安")
      (141 . "永仁") (140 . "正応") (139 . "弘安") (138 . "建治") (137 . "文永")
      (136 . "弘長") (135 . "文応") (134 . "正元") (133 . "正嘉") (132 . "康元")
      (131 . "建長") (130 . "宝治") (129 . "寛元") (128 . "仁治") (127 . "延応")
      (126 . "暦仁") (125 . "嘉禎") (124 . "文暦") (123 . "天福") (122 . "貞永")
      (121 . "寛喜") (120 . "安貞") (119 . "嘉禄") (118 . "元仁") (117 . "貞応")
      (116 . "承久") (115 . "建保") (114 . "建暦") (113 . "承元") (112 . "建永")
      (111 . "元久") (110 . "建仁") (109 . "正治") (108 . "建久") (107 . "文治")
      (106 . "元暦") (105 . "寿永") (104 . "養和") (103 . "治承") (102 . "安元")
      (101 . "承安") (100 . "嘉応") (99 . "仁安") (98 . "永万") (97 . "長寛") (96 . "応保")
      (95 . "永暦") (94 . "平治") (93 . "保元") (92 . "久寿") (91 . "仁平") (90 . "久安")
      (89 . "天養") (88 . "康治") (87 . "永治") (86 . "保延") (85 . "長承") (84 . "天承")
      (83 . "大治") (82 . "天治") (81 . "保安") (80 . "元永") (79 . "永久") (78 . "天永")
      (77 . "天仁") (76 . "嘉承") (75 . "長治") (74 . "康和") (73 . "承徳") (72 . "永長")
      (71 . "嘉保") (70 . "寛治") (69 . "応徳") (68 . "永保") (67 . "承暦") (66 . "承保")
      (65 . "延久") (64 . "治暦") (63 . "康平") (62 . "天喜") (61 . "永承") (60 . "寛徳")
      (59 . "長久") (58 . "長暦") (57 . "長元") (56 . "万寿") (55 . "治安") (54 . "寛仁")
      (53 . "長和") (52 . "寛弘") (51 . "長保") (50 . "長徳") (49 . "正暦") (48 . "永祚")
      (47 . "永延") (46 . "寛和") (45 . "永観") (44 . "天元") (43 . "貞元") (42 . "天延")
      (41 . "天禄") (40 . "安和") (39 . "康保") (38 . "応和") (37 . "天徳") (36 . "天暦")
      (35 . "天慶") (34 . "承平") (33 . "延長") (32 . "延喜") (31 . "昌泰") (30 . "寛平")
      (29 . "仁和") (28 . "元慶") (27 . "貞観") (26 . "天安") (25 . "斉衡") (24 . "仁寿")
      (23 . "嘉祥") (22 . "承和") (21 . "天長") (20 . "弘仁") (19 . "大同") (18 . "延暦")
      (17 . "天応") (16 . "宝亀") (15 . "神護景雲") (14 . "天平神護") (13 . "天平宝字")
      (12 . "天平勝宝") (11 . "天平感宝") (10 . "天平") (9 . "神亀") (8 . "養老") (7 . "霊亀")
      (6 . "和銅") (5 . "慶雲") (4 . "大宝") (3 . "朱鳥") (2 . "白鳳") (1 . "白雉")
      (0 . "大化")))
    (NARROW
     (DEFAULT (231 . "慶応") (230 . "元治") (229 . "文久") (228 . "万延") (227 . "安政")
      (226 . "嘉永") (225 . "弘化") (224 . "天保") (223 . "文政") (222 . "文化")
      (221 . "享和") (220 . "寛政") (219 . "天明") (218 . "安永") (217 . "明和")
      (216 . "宝暦") (215 . "寛延") (214 . "延享") (213 . "寛保") (212 . "元文")
      (211 . "享保") (210 . "正徳") (209 . "宝永") (208 . "元禄") (207 . "貞享")
      (206 . "天和") (205 . "延宝") (204 . "寛文") (203 . "万治") (202 . "明暦")
      (201 . "承応") (200 . "慶安") (199 . "正保") (198 . "寛永") (197 . "元和")
      (196 . "慶長") (195 . "文禄") (194 . "天正") (193 . "元亀") (192 . "永禄")
      (191 . "弘治") (190 . "天文") (189 . "享禄") (188 . "大永") (187 . "永正")
      (186 . "文亀") (185 . "明応") (184 . "延徳") (183 . "長享") (182 . "文明")
      (181 . "応仁") (180 . "文正") (179 . "寛正") (178 . "長禄") (177 . "康正")
      (176 . "享徳") (175 . "宝徳") (174 . "文安") (173 . "嘉吉") (172 . "永享")
      (171 . "正長") (170 . "応永") (169 . "明徳") (168 . "康応") (167 . "嘉慶")
      (166 . "至徳") (165 . "元中") (164 . "弘和") (163 . "康暦") (162 . "天授")
      (161 . "文中") (160 . "建徳") (159 . "正平") (158 . "興国") (157 . "延元")
      (156 . "建武") (155 . "元弘") (154 . "元徳") (153 . "嘉暦") (152 . "正中")
      (151 . "元亨") (150 . "元応") (149 . "文保") (148 . "正和") (147 . "応長")
      (146 . "延慶") (145 . "徳治") (144 . "嘉元") (143 . "乾元") (142 . "正安")
      (141 . "永仁") (140 . "正応") (139 . "弘安") (138 . "建治") (137 . "文永")
      (136 . "弘長") (135 . "文応") (134 . "正元") (133 . "正嘉") (132 . "康元")
      (131 . "建長") (130 . "宝治") (129 . "寛元") (128 . "仁治") (127 . "延応")
      (126 . "暦仁") (125 . "嘉禎") (124 . "文暦") (123 . "天福") (122 . "貞永")
      (121 . "寛喜") (120 . "安貞") (119 . "嘉禄") (118 . "元仁") (117 . "貞応")
      (116 . "承久") (115 . "建保") (114 . "建暦") (113 . "承元") (112 . "建永")
      (111 . "元久") (110 . "建仁") (109 . "正治") (108 . "建久") (107 . "文治")
      (106 . "元暦") (105 . "寿永") (104 . "養和") (103 . "治承") (102 . "安元")
      (101 . "承安") (100 . "嘉応") (99 . "仁安") (98 . "永万") (97 . "長寛") (96 . "応保")
      (95 . "永暦") (94 . "平治") (93 . "保元") (92 . "久寿") (91 . "仁平") (90 . "久安")
      (89 . "天養") (88 . "康治") (87 . "永治") (86 . "保延") (85 . "長承") (84 . "天承")
      (83 . "大治") (82 . "天治") (81 . "保安") (80 . "元永") (79 . "永久") (78 . "天永")
      (77 . "天仁") (76 . "嘉承") (75 . "長治") (74 . "康和") (73 . "承徳") (72 . "永長")
      (71 . "嘉保") (70 . "寛治") (69 . "応徳") (68 . "永保") (67 . "承暦") (66 . "承保")
      (65 . "延久") (64 . "治暦") (63 . "康平") (62 . "天喜") (61 . "永承") (60 . "寛徳")
      (59 . "長久") (58 . "長暦") (57 . "長元") (56 . "万寿") (55 . "治安") (54 . "寛仁")
      (53 . "長和") (52 . "寛弘") (51 . "長保") (50 . "長徳") (49 . "正暦") (48 . "永祚")
      (47 . "永延") (46 . "寛和") (45 . "永観") (44 . "天元") (43 . "貞元") (42 . "天延")
      (41 . "天禄") (40 . "安和") (39 . "康保") (38 . "応和") (37 . "天徳") (36 . "天暦")
      (35 . "天慶") (34 . "承平") (33 . "延長") (32 . "延喜") (31 . "昌泰") (30 . "寛平")
      (29 . "仁和") (28 . "元慶") (27 . "貞観") (26 . "天安") (25 . "斉衡") (24 . "仁寿")
      (23 . "嘉祥") (22 . "承和") (21 . "天長") (20 . "弘仁") (19 . "大同") (18 . "延暦")
      (17 . "天応") (16 . "宝亀") (15 . "神護景雲") (14 . "天平神護") (13 . "天平宝字")
      (12 . "天平勝宝") (11 . "天平感宝") (10 . "天平") (9 . "神亀") (8 . "養老") (7 . "霊亀")
      (6 . "和銅") (5 . "慶雲") (4 . "大宝") (3 . "朱鳥") (2 . "白鳳") (1 . "白雉")
      (0 . "大化"))))
   (DATE-FORMATS (SHORT (PATTERN . "GGGGGy/M/d"))
    (MEDIUM (PATTERN . "Gy年M月d日")) (LONG (PATTERN . "Gy年M月d日"))
    (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ズル・ヒッジャ") (11 . "ズル・カイダ") (10 . "シャウワール") (9 . "ラマダーン")
       (8 . "シャアバーン") (7 . "ラジャブ") (6 . "ジュマーダッサーニー") (5 . "ジュマーダル・アウワル")
       (4 . "ラビー・ウッ・サーニー") (3 . "ラビー・ウル・アウワル") (2 . "サフアル") (1 . "ムハッラム")))
     (ABBREVIATED
      (DEFAULT (12 . "ズル・ヒッジャ") (11 . "ズル・カイダ") (10 . "シャウワール") (9 . "ラマダーン")
       (8 . "シャアバーン") (7 . "ラジャブ") (6 . "ジュマーダッサーニー") (5 . "ジュマーダル・アウワル")
       (4 . "ラビー・ウッ・サーニー") (3 . "ラビー・ウル・アウワル") (2 . "サフアル") (1 . "ムハッラム")))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/MM/dd")) (MEDIUM (PATTERN . "Gy/MM/dd"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "パルグナ") (11 . "マーガ") (10 . "パウサ") (9 . "アヴラハヤナ")
       (8 . "カルディカ") (7 . "アスビナ") (6 . "バードラ") (5 . "スラバナ") (4 . "アーサダ")
       (3 . "ジャイスタ") (2 . "ヴァイサカ") (1 . "カイトラ")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "サカ")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "エルル") (12 . "アヴ") (11 . "タムズ") (10 . "シバン") (9 . "イヤル")
       (8 . "ニサン") (7 . "アダル II") (7 . "アダル") (6 . "アダル I") (5 . "シバット")
       (4 . "テベット") (3 . "キスレブ") (2 . "へシボン") (1 . "ティスレ")))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/MM/dd")) (MEDIUM (PATTERN . "Gy/MM/dd"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月") (8 . "8月")
       (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月") (2 . "2月")
       (1 . "1月")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "土") (FRI . "金") (THU . "木") (WED . "水") (TUE . "火")
       (MON . "月") (SUN . "日"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "土曜日") (FRI . "金曜日") (THU . "木曜日") (WED . "水曜日")
       (TUE . "火曜日") (MON . "月曜日") (SUN . "日曜日")))
     (ABBREVIATED
      (DEFAULT (SAT . "土") (FRI . "金") (THU . "木") (WED . "水") (TUE . "火")
       (MON . "月") (SUN . "日")))))
   (QUARTERS
    (FORMAT
     (WIDE (DEFAULT (4 . "第4四半期") (3 . "第3四半期") (2 . "第2四半期") (1 . "第1四半期")))
     (ABBREVIATED (DEFAULT (4 . "Q4") (3 . "Q3") (2 . "Q2") (1 . "Q1")))))
   (DAY-PERIODS
    (FORMAT
     (ABBREVIATED
      (DEFAULT (NIGHT2 . "夜中") (NIGHT1 . "夜") (EVENING1 . "夕方")
       (AFTERNOON1 . "昼") (MORNING1 . "朝") (PM . "午後") (NOON . "正午")
       (AM . "午前") (MIDNIGHT . "真夜中")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "西暦紀元") (0 . "西暦紀元前"))
     (DEFAULT (1 . "西暦") (0 . "紀元前")))
    (NARROW (DEFAULT (1 . "AD") (0 . "BC"))))
   (DATE-FORMATS (SHORT (PATTERN . "y/MM/dd")) (MEDIUM (PATTERN . "y/MM/dd"))
    (LONG (PATTERN . "y年M月d日")) (FULL (PATTERN . "y年M月d日EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "H:mm")) (MEDIUM (PATTERN . "H:mm:ss"))
    (LONG (PATTERN . "H:mm:ss z")) (FULL (PATTERN . "H時mm分ss秒 zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "GGGGGy/M/d"))
    (MEDIUM (PATTERN . "GGGGGy/MM/dd")) (LONG (PATTERN . "Gy年M月d日"))
    (FULL (PATTERN . "Gy年M月d日(EEEE)")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "パグメン") (12 . "ネハッセ") (11 . "ハムレ") (10 . "セネ")
       (9 . "ゲンボト") (8 . "ミアジア") (7 . "メガビト") (6 . "イェカティト") (5 . "テル")
       (4 . "ターサス") (3 . "ヘダル") (2 . "テケムト") (1 . "メスケレム"))))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ナシエ") (12 . "メスラ") (11 . "エペープ") (10 . "パオーナ")
       (9 . "バシャンス") (8 . "バラモウダ") (7 . "バラムハート") (6 . "アムシール") (5 . "トーバ")
       (4 . "キアック") (3 . "ハトール") (2 . "ババ") (1 . "トウト"))))))
  (CHINESE
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "十二") (11 . "十一") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))))
   (DATE-FORMATS (SHORT (PATTERN . "U-M-d")) (MEDIUM (PATTERN . "U年MMMd日"))
    (LONG (PATTERN . "U年MMMd日")) (FULL (PATTERN . "U年MMMd日EEEE"))))
  (BUDDHIST (ERAS (WIDE (DEFAULT (0 . "仏暦"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/MM/dd")) (MEDIUM (PATTERN . "Gy/MM/dd"))
    (LONG (PATTERN . "GGGGy年M月d日")) (FULL (PATTERN . "GGGGy年M月d日EEEE"))))))
