((LANGUAGE . "kaa")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Декабрь") (11 . "Ноябрь") (10 . "Октябрь")
       (9 . "Сентябрь") (8 . "Август") (7 . "Июль") (6 . "Июнь") (5 . "Май")
       (4 . "Апрель") (3 . "Март") (2 . "Февраль") (1 . "Январь")))
     (NARROW
      (DEFAULT (12 . "Д") (11 . "Н") (10 . "О") (9 . "С") (8 . "А") (7 . "И")
       (6 . "И") (5 . "М") (4 . "А") (3 . "М") (2 . "Ф") (1 . "Я")))
     (ABBREVIATED
      (DEFAULT (12 . "Дек") (11 . "Ноя") (10 . "Окт") (9 . "Сен") (8 . "Авг")
       (7 . "Июл") (6 . "Июн") (5 . "Май") (4 . "Апр") (3 . "Мар") (2 . "Фев")
       (1 . "Янв"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "декабрь") (11 . "ноябрь") (10 . "октябрь")
       (9 . "сентябрь") (8 . "август") (7 . "июль") (6 . "июнь") (5 . "май")
       (4 . "апрель") (3 . "март") (2 . "февраль") (1 . "январь")))
     (NARROW
      (DEFAULT (12 . "Д") (11 . "Н") (10 . "О") (9 . "С") (8 . "А") (7 . "И")
       (6 . "И") (5 . "М") (4 . "А") (3 . "М") (2 . "Ф") (1 . "Я")))
     (ABBREVIATED
      (DEFAULT (12 . "дек") (11 . "ноя") (10 . "окт") (9 . "сен") (8 . "авг")
       (7 . "июл") (6 . "июн") (5 . "май") (4 . "апр") (3 . "мар") (2 . "фев")
       (1 . "янв")))))
   (DAYS
    (STAND-ALONE
     (WIDE
      (DEFAULT (SAT . "шемби") (FRI . "жума") (THU . "пийшемби")
       (WED . "сәршемби") (TUE . "сийшемби") (MON . "дүйшемби")
       (SUN . "екшемби")))
     (SHORT
      (DEFAULT (SAT . "Ше") (FRI . "Жу") (THU . "Пи") (WED . "Сә") (TUE . "Си")
       (MON . "Дү") (SUN . "Ек")))
     (NARROW
      (DEFAULT (SAT . "Ш") (FRI . "Ж") (THU . "П") (WED . "С") (TUE . "С")
       (MON . "Д") (SUN . "Е")))
     (ABBREVIATED
      (DEFAULT (SAT . "Шем") (FRI . "Жум") (THU . "Пий") (WED . "Сәр")
       (TUE . "Сий") (MON . "Дүй") (SUN . "Екш"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "шемби") (FRI . "жума") (THU . "пийшемби")
       (WED . "сәршемби") (TUE . "сийшемби") (MON . "дүйшемби")
       (SUN . "екшемби")))
     (SHORT
      (DEFAULT (SAT . "Ше") (FRI . "Жу") (THU . "Пи") (WED . "Сә") (TUE . "Си")
       (MON . "Дү") (SUN . "Ек")))
     (NARROW
      (DEFAULT (SAT . "Ш") (FRI . "Ж") (THU . "П") (WED . "С") (TUE . "С")
       (MON . "Д") (SUN . "Е")))
     (ABBREVIATED
      (DEFAULT (SAT . "Шем") (FRI . "Жум") (THU . "Пий") (WED . "Сәр")
       (TUE . "Сий") (MON . "Дүй") (SUN . "Екш")))))
   (QUARTERS
    (STAND-ALONE
     (WIDE
      (DEFAULT (4 . "IV шерек") (3 . "III шерек") (2 . "II шерек")
       (1 . "I шерек")))
     (NARROW (DEFAULT (4 . "IV") (3 . "III") (2 . "II") (1 . "I")))
     (ABBREVIATED
      (DEFAULT (4 . "IV ш.") (3 . "III ш.") (2 . "II ш.") (1 . "I ш."))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "IV шерек") (3 . "III шерек") (2 . "II шерек")
       (1 . "I шерек")))
     (NARROW (DEFAULT (4 . "IV") (3 . "III") (2 . "II") (1 . "I")))
     (ABBREVIATED
      (DEFAULT (4 . "IV ш.") (3 . "III ш.") (2 . "II ш.") (1 . "I ш.")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "б. э.") (0 . "б. э. ш.")))
    (WIDE (VARIANT (1 . "бизиӊ эрамыздыӊ") (0 . "бизиӊ эрамызға шекемги"))
     (DEFAULT (1 . "бизиӊ эрамыздыӊ") (0 . "бизиӊ эрамызға шекемги")))))))
