((LANGUAGE . "kk")
 (CALENDARS
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Эсфанд") (11 . "Бахман") (10 . "Дей") (9 . "Азар")
       (8 . "Абан") (7 . "Мехр") (6 . "Шахривар") (5 . "Мордад") (4 . "Тир")
       (3 . "Хордад") (2 . "Ордибехешт") (1 . "Фарвардин"))))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Зұлхижжа") (11 . "Зұлқағда") (10 . "Шәууал")
       (9 . "Рамазан") (8 . "Шағбан") (7 . "Ережеп") (6 . "Жұмадәл ахир")
       (5 . "Жұмадәл аууәл") (4 . "Рабиғул ахир") (3 . "Рабиғул әууәл")
       (2 . "Сафар") (1 . "Мұхаррам")))
     (ABBREVIATED
      (DEFAULT (12 . "Зұлх.") (11 . "Зұлқ.") (10 . "Шәу.") (9 . "Рам.")
       (8 . "Шағ.") (7 . "Ереж.") (6 . "Жұм. II") (5 . "Жұм. I")
       (4 . "Раб. ІІ") (3 . "Раб. І") (2 . "Саф.") (1 . "Мұх."))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Зұлхижжа") (11 . "Зұлқағда") (10 . "Шәууал")
       (9 . "Рамазан") (8 . "Шағбан") (7 . "Ережеп") (6 . "Жұмадәл ахир")
       (5 . "Жұмадәл аууәл") (4 . "Рабиғул ахир") (3 . "Рабиғул әууәл")
       (2 . "Сафар") (1 . "Мұхаррам")))
     (ABBREVIATED
      (DEFAULT (12 . "Зұлх.") (11 . "Зұлқ.") (10 . "Шәу.") (9 . "Рам.")
       (8 . "Шағ.") (7 . "Ереж.") (6 . "Жұм. II") (5 . "Жұм. I")
       (4 . "Раб. II") (3 . "Раб. I") (2 . "Саф.") (1 . "Мұх.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ХЖ"))) (NARROW (DEFAULT (0 . "ХЖ")))
    (WIDE (DEFAULT (0 . "ХЖ")))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Пхальгуна") (11 . "Магха") (10 . "Пауша")
       (9 . "Маргаширша") (8 . "Картика") (7 . "Ашвина") (6 . "Бхадрапада")
       (5 . "Шравана") (4 . "Ашадха") (3 . "Джьештха") (2 . "Вайшакха")
       (1 . "Чайтра"))))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "Элул") (12 . "Ав") (11 . "Тамуз") (10 . "Сиван")
       (9 . "Ияр") (8 . "Нисан") (7 . "Адар II") (7 . "Адар") (6 . "Адар I")
       (5 . "Шват") (4 . "Тевет") (3 . "Кислев") (2 . "Хешван")
       (1 . "Тишрей"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Желтоқсан") (11 . "Қараша") (10 . "Қазан")
       (9 . "Қыркүйек") (8 . "Тамыз") (7 . "Шілде") (6 . "Маусым")
       (5 . "Мамыр") (4 . "Сәуір") (3 . "Наурыз") (2 . "Ақпан")
       (1 . "Қаңтар")))
     (NARROW
      (DEFAULT (12 . "Ж") (11 . "Қ") (10 . "Қ") (9 . "Қ") (8 . "Т") (7 . "Ш")
       (6 . "М") (5 . "М") (4 . "С") (3 . "Н") (2 . "А") (1 . "Қ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "желтоқсан") (11 . "қараша") (10 . "қазан")
       (9 . "қыркүйек") (8 . "тамыз") (7 . "шілде") (6 . "маусым")
       (5 . "мамыр") (4 . "сәуір") (3 . "наурыз") (2 . "ақпан")
       (1 . "қаңтар")))
     (ABBREVIATED
      (DEFAULT (12 . "жел.") (11 . "қар.") (10 . "қаз.") (9 . "қыр.")
       (8 . "там.") (7 . "шіл.") (6 . "мау.") (5 . "мам.") (4 . "сәу.")
       (3 . "нау.") (2 . "ақп.") (1 . "қаң.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "С") (FRI . "Ж") (THU . "Б") (WED . "С") (TUE . "С")
       (MON . "Д") (SUN . "Ж"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "сенбі") (FRI . "жұма") (THU . "бейсенбі")
       (WED . "сәрсенбі") (TUE . "сейсенбі") (MON . "дүйсенбі")
       (SUN . "жексенбі")))
     (ABBREVIATED
      (DEFAULT (SAT . "сб") (FRI . "жм") (THU . "бс") (WED . "ср") (TUE . "сс")
       (MON . "дс") (SUN . "жс")))))
   (QUARTERS
    (STAND-ALONE
     (NARROW (DEFAULT (4 . "IV") (3 . "III") (2 . "II") (1 . "I"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "IV тоқсан") (3 . "ІІІ тоқсан") (2 . "ІІ тоқсан")
       (1 . "І тоқсан")))
     (ABBREVIATED
      (DEFAULT (4 . "IV тқс.") (3 . "ІІІ тқс.") (2 . "ІІ тқс.")
       (1 . "І тқс.")))))
   (DAY-PERIODS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "түн") (EVENING1 . "кеш")
       (AFTERNOON1 . "түстен кейін") (MORNING1 . "таң") (NOON . "талтүс"))))
    (FORMAT
     (NARROW
      (DEFAULT (NIGHT1 . "түнгі") (EVENING1 . "кешкі")
       (AFTERNOON1 . "түстен кейінгі") (MORNING1 . "таңғы") (NOON . "түскі")
       (MIDNIGHT . "түнгі")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "түнгі") (EVENING1 . "кешкі")
       (AFTERNOON1 . "түстен кейінгі") (MORNING1 . "таңғы") (NOON . "түскі")
       (MIDNIGHT . "түн жарымы")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "б.з.") (0 . "б.з.д.")))
    (WIDE (VARIANT (1 . "Біздің заманымыз") (0 . "біздің заманымызға дейін"))
     (DEFAULT (1 . "біздің заманымыз") (0 . "Біздің заманымызға дейін"))))
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.yy"))
    (MEDIUM (PATTERN . "y 'ж'. dd MMM")) (LONG (PATTERN . "y 'ж'. d MMMM"))
    (FULL (PATTERN . "y 'ж'. d MMMM, EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "HH:mm:ss z")) (FULL (PATTERN . "HH:mm:ss zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "GGGGG dd.MM.y"))
    (MEDIUM (PATTERN . "G dd.MM.y")) (LONG (PATTERN . "G y 'ж'. d MMMM"))
    (FULL (PATTERN . "G y 'ж'. d MMMM, EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "Наси’") (12 . "Мисра") (11 . "’абиб") (10 . "Ба’уна")
       (9 . "Башанс") (8 . "Барамуда") (7 . "Барамхат") (6 . "Ашмир")
       (5 . "Туба") (4 . "Кийяк") (3 . "Хатур") (2 . "Баба") (1 . "Тут"))))))
  (CHINESE
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Он екінші ай") (11 . "Он бірінші ай") (10 . "Оныншы ай")
       (9 . "Тоғызыншы ай") (8 . "Сегізінші ай") (7 . "Жетінші ай")
       (6 . "Алтыншы ай") (5 . "Бесінші ай") (4 . "Төртінші ай")
       (3 . "Үшінші ай") (2 . "Екінші ай") (1 . "Бірінші ай")))
     (ABBREVIATED
      (DEFAULT (12 . "12-ай") (11 . "11-ай") (10 . "10-ай") (9 . "9-ай")
       (8 . "8-ай") (7 . "7-ай") (6 . "6-ай") (5 . "5-ай") (4 . "4-ай")
       (3 . "3-ай") (2 . "2-ай") (1 . "1-ай"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Он екінші ай") (11 . "Он бірінші ай") (10 . "Оныншы ай")
       (9 . "Тоғызыншы ай") (8 . "Сегізінші ай") (7 . "Жетінші ай")
       (6 . "Алтыншы ай") (5 . "Бесінші ай") (4 . "Төртінші ай")
       (3 . "Үшінші ай") (2 . "Екінші ай") (1 . "Бірінші ай")))
     (ABBREVIATED
      (DEFAULT (12 . "12-ай") (11 . "11-ай") (10 . "10-ай") (9 . "9-ай")
       (8 . "8-ай") (7 . "7-ай") (6 . "6-ай") (5 . "5-ай") (4 . "4-ай")
       (3 . "3-ай") (2 . "2-ай") (1 . "1-ай")))))
   (DATE-FORMATS (SHORT (PATTERN . "M/d/r")) (MEDIUM (PATTERN . "MMM d, r"))
    (LONG (PATTERN . "MMMM d, r(U)"))
    (FULL (PATTERN . "EEEE, MMMM d, r(U)"))))))
