((LANGUAGE . "ko")
 (CALENDARS (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "중화민국") (0 . "중화민국전")))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "에스판드") (11 . "바흐만") (10 . "다이") (9 . "아자르") (8 . "아반")
       (7 . "메흐르") (6 . "샤흐리바르") (5 . "모르다드") (4 . "티르") (3 . "호르다드")
       (2 . "오르디베헤쉬트") (1 . "화르바딘"))))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "레이와") (235 . "헤이세이") (234 . "쇼와") (233 . "다이쇼")
      (232 . "메이지") (231 . "게이오 (1865 ~ 1868)") (230 . "겐지 (1864 ~ 1865)")
      (229 . "분큐 (1861 ~ 1864)") (228 . "만엔 (1860 ~ 1861)")
      (227 . "안세이 (1854 ~ 1860)") (226 . "가에이 (1848 ~ 1854)")
      (225 . "고카 (1844 ~ 1848)") (224 . "덴포 (1830 ~ 1844)")
      (223 . "분세이 (1818 ~ 1830)") (222 . "분카 (1804 ~ 1818)")
      (221 . "교와 (1801 ~ 1804)") (220 . "간세이 (1789 ~ 1801)")
      (219 . "덴메이 (1781 ~ 1789)") (218 . "안에이 (1772 ~ 1781)")
      (217 . "메이와 (1764 ~ 1772)") (216 . "호레키 (1751 ~ 1764)")
      (215 . "간엔 (1748 ~ 1751)") (214 . "엔쿄 (1744 ~ 1748)")
      (213 . "간포 (1741 ~ 1744)") (212 . "겐분 (1736 ~ 1741)")
      (211 . "교호 (1716 ~ 1736)") (210 . "쇼토쿠 (1711 ~ 1716)")
      (209 . "호에이 (1704 ~ 1711)") (208 . "겐로쿠 (1688 ~ 1704)")
      (207 . "조쿄 (1684 ~ 1688)") (206 . "덴나 (1681 ~ 1684)")
      (205 . "엔포 (1673 ~ 1681)") (204 . "간분 (1661 ~ 1673)")
      (203 . "만지 (1658 ~ 1661)") (202 . "메이레키 (1655 ~ 1658)")
      (201 . "조오 (1652 ~ 1655)") (200 . "게이안 (1648 ~ 1652)")
      (199 . "쇼호 (1644 ~ 1648)") (198 . "간에이 (1624 ~ 1644)")
      (197 . "겐나 (1615 ~ 1624)") (196 . "게이초 (1596 ~ 1615)")
      (195 . "분로쿠 (1592 ~ 1596)") (194 . "덴쇼 (1573 ~ 1592)")
      (193 . "겐키 (1570 ~ 1573)") (192 . "에이로쿠 (1558 ~ 1570)")
      (191 . "고지 (1555 ~ 1558)") (190 . "덴분 (1532 ~ 1555)")
      (189 . "교로쿠 (1528 ~ 1532)") (188 . "다이에이 (1521 ~ 1528)")
      (187 . "에이쇼 (1504 ~ 1521)") (186 . "분키 (1501 ~ 1504)")
      (185 . "메이오 (1492 ~ 1501)") (184 . "엔토쿠 (1489 ~ 1492)")
      (183 . "조쿄 (1487 ~ 1489)") (182 . "분메이 (1469 ~ 1487)")
      (181 . "오닌 (1467 ~ 1469)") (180 . "분쇼 (1466 ~ 1467)")
      (179 . "간쇼 (1460 ~ 1466)") (178 . "조로쿠 (1457 ~ 1460)")
      (177 . "고쇼 (1455 ~ 1457)") (176 . "교토쿠 (1452 ~ 1455)")
      (175 . "호토쿠 (1449 ~ 1452)") (174 . "분안 (1444 ~ 1449)")
      (173 . "가키쓰 (1441 ~ 1444)") (172 . "에이쿄 (1429 ~ 1441)")
      (171 . "쇼초 (1428 ~ 1429)") (170 . "오에이 (1394 ~ 1428)")
      (169 . "메이토쿠 (1390 ~ 1394)") (168 . "고오 (1389 ~ 1390)")
      (167 . "가쿄 (1387 ~ 1389)") (166 . "메이토쿠 (1384 ~ 1387)")
      (165 . "겐추 (1384 ~ 1392)") (164 . "고와 (1381 ~ 1384)")
      (163 . "고랴쿠 (1379 ~ 1381)") (162 . "덴주 (1375 ~ 1379)")
      (161 . "분추 (1372 ~ 1375)") (160 . "겐토쿠 (1370 ~ 1372)")
      (159 . "쇼헤이 (1346 ~ 1370)") (158 . "고코쿠 (1340 ~ 1346)")
      (157 . "엔겐 (1336 ~ 1340)") (156 . "겐무 (1334 ~ 1336)")
      (155 . "겐코 (1331 ~ 1334)") (154 . "겐토쿠 (1329 ~ 1331)")
      (153 . "가랴쿠 (1326 ~ 1329)") (152 . "쇼추 (1324 ~ 1326)")
      (151 . "겐코 (1321 ~ 1324)") (150 . "겐오 (1319 ~ 1321)")
      (149 . "분포 (1317 ~ 1319)") (148 . "쇼와 (1312 ~ 1317)")
      (147 . "오초 (1311 ~ 1312)") (146 . "엔쿄 (1308 ~ 1311)")
      (145 . "도쿠지 (1306 ~ 1308)") (144 . "가겐 (1303 ~ 1306)")
      (143 . "겐겐 (1302 ~ 1303)") (142 . "쇼안 (1299 ~ 1302)")
      (141 . "에이닌 (1293 ~ 1299)") (140 . "쇼오 (1288 ~ 1293)")
      (139 . "고안 (1278 ~ 1288)") (138 . "겐지 (1275 ~ 1278)")
      (137 . "분에이 (1264 ~ 1275)") (136 . "고초 (1261 ~ 1264)")
      (135 . "분오 (1260 ~ 1261)") (134 . "쇼겐 (1259 ~ 1260)")
      (133 . "쇼카 (1257 ~ 1259)") (132 . "고겐 (1256 ~ 1257)")
      (131 . "겐초 (1249 ~ 1256)") (130 . "호지 (1247 ~ 1249)")
      (129 . "간겐 (1243 ~ 1247)") (128 . "닌지 (1240 ~ 1243)")
      (127 . "엔오 (1239 ~ 1240)") (126 . "랴쿠닌 (1238 ~ 1239)")
      (125 . "가테이 (1235 ~ 1238)") (124 . "분랴쿠 (1234 ~ 1235)")
      (123 . "덴푸쿠 (1233 ~ 1234)") (122 . "조에이 (1232 ~ 1233)")
      (121 . "간키 (1229 ~ 1232)") (120 . "안테이 (1227 ~ 1229)")
      (119 . "가로쿠 (1225 ~ 1227)") (118 . "겐닌 (1224 ~ 1225)")
      (117 . "조오 (1222 ~ 1224)") (116 . "조큐 (1219 ~ 1222)")
      (115 . "겐포 (1213 ~ 1219)") (114 . "겐랴쿠 (1211 ~ 1213)")
      (113 . "조겐 (1207 ~ 1211)") (112 . "겐에이 (1206 ~ 1207)")
      (111 . "겐큐 (1204 ~ 1206)") (110 . "겐닌 (1201 ~ 1204)")
      (109 . "쇼지 (1199 ~ 1201)") (108 . "겐큐 (1190 ~ 1199)")
      (107 . "분지 (1185 ~ 1190)") (106 . "겐랴쿠 (1184 ~ 1185)")
      (105 . "주에이 (1182 ~ 1184)") (104 . "요와 (1181 ~ 1182)")
      (103 . "지쇼 (1177 ~ 1181)") (102 . "안겐 (1175 ~ 1177)")
      (101 . "조안 (1171 ~ 1175)") (100 . "가오 (1169 ~ 1171)")
      (99 . "닌난 (1166 ~ 1169)") (98 . "에이만 (1165 ~ 1166)")
      (97 . "조칸 (1163 ~ 1165)") (96 . "오호 (1161 ~ 1163)")
      (95 . "에이랴쿠 (1160 ~ 1161)") (94 . "헤이지 (1159 ~ 1160)")
      (93 . "호겐 (1156 ~ 1159)") (92 . "규주 (1154 ~ 1156)")
      (91 . "닌페이 (1151 ~ 1154)") (90 . "규안 (1145 ~ 1151)")
      (89 . "덴요 (1144 ~ 1145)") (88 . "고지 (1142 ~ 1144)")
      (87 . "에이지 (1141 ~ 1142)") (86 . "호엔 (1135 ~ 1141)")
      (85 . "조쇼 (1132 ~ 1135)") (84 . "덴쇼 (1131 ~ 1132)")
      (83 . "다이지 (1126 ~ 1131)") (82 . "덴지 (1124 ~ 1126)")
      (81 . "호안 (1120 ~ 1124)") (80 . "겐에이 (1118 ~ 1120)")
      (79 . "에이큐 (1113 ~ 1118)") (78 . "덴에이 (1110 ~ 1113)")
      (77 . "덴닌 (1108 ~ 1110)") (76 . "가쇼 (1106 ~ 1108)")
      (75 . "조지 (1104 ~ 1106)") (74 . "고와 (1099 ~ 1104)")
      (73 . "조토쿠 (1097 ~ 1099)") (72 . "에이초 (1096 ~ 1097)")
      (71 . "가호 (1094 ~ 1096)") (70 . "간지 (1087 ~ 1094)")
      (69 . "오토쿠 (1084 ~ 1087)") (68 . "에이호 (1081 ~ 1084)")
      (67 . "쇼랴쿠 (1077 ~ 1081)") (66 . "조호 (1074 ~ 1077)")
      (65 . "엔큐 (1069 ~ 1074)") (64 . "지랴쿠 (1065 ~ 1069)")
      (63 . "고헤이 (1058 ~ 1065)") (62 . "덴기 (1053 ~ 1058)")
      (61 . "에이쇼 (1046 ~ 1053)") (60 . "간토쿠 (1044 ~ 1046)")
      (59 . "조큐 (1040 ~ 1044)") (58 . "조랴쿠 (1037 ~ 1040)")
      (57 . "조겐 (1028 ~ 1037)") (56 . "만주 (1024 ~ 1028)")
      (55 . "지안 (1021 ~ 1024)") (54 . "간닌 (1017 ~ 1021)")
      (53 . "조와 (1012 ~ 1017)") (52 . "간코 (1004 ~ 1012)")
      (51 . "조호 (999 ~ 1004)") (50 . "조토쿠 (995 ~ 999)")
      (49 . "쇼랴쿠 (990 ~ 995)") (48 . "에이소 (989 ~ 990)")
      (47 . "에이엔 (987 ~ 989)") (46 . "간나 (985 ~ 987)") (45 . "에이간 (983 ~ 985)")
      (44 . "덴겐 (978 ~ 983)") (43 . "조겐 (976 ~ 978)") (42 . "덴엔 (973 ~ 976)")
      (41 . "덴로쿠 (970 ~ 973)") (40 . "안나 (968 ~ 970)") (39 . "고호 (964 ~ 968)")
      (38 . "오와 (961 ~ 964)") (37 . "덴토쿠 (957 ~ 961)") (36 . "덴랴쿠 (947 ~ 957)")
      (35 . "덴교 (938 ~ 947)") (34 . "조헤이 (931 ~ 938)") (33 . "엔초 (923 ~ 931)")
      (32 . "엔기 (901 ~ 923)") (31 . "쇼타이 (898 ~ 901)") (30 . "간표 (889 ~ 898)")
      (29 . "닌나 (885 ~ 889)") (28 . "간교 (877 ~ 885)") (27 . "조간 (859 ~ 877)")
      (26 . "덴난 (857 ~ 859)") (25 . "사이코 (854 ~ 857)") (24 . "닌주 (851 ~ 854)")
      (23 . "가쇼 (848 ~ 851)") (22 . "조와 (834 ~ 848)") (21 . "덴초 (824 ~ 834)")
      (20 . "고닌 (810 ~ 824)") (19 . "다이도 (806 ~ 810)") (18 . "엔랴쿠 (782 ~ 806)")
      (17 . "덴오 (781 ~ 782)") (16 . "호키 (770 ~ 780)")
      (15 . "진고케이운 (767 ~ 770)") (14 . "덴표진고 (765 ~ 767)")
      (13 . "덴표호지 (757 ~ 765)") (12 . "덴표쇼호 (749 ~ 757)")
      (11 . "덴표칸포 (749 ~ 749)") (10 . "덴표 (729 ~ 749)") (9 . "진키 (724 ~ 729)")
      (8 . "요로 (717 ~ 724)") (7 . "레이키 (715 ~ 717)") (6 . "와도 (708 ~ 715)")
      (5 . "게이운 (704 ~ 708)") (4 . "다이호 (701 ~ 704)") (3 . "슈초 (686 ~ 701)")
      (2 . "하쿠호 (672 ~ 686)") (1 . "하쿠치 (650 ~ 671)")
      (0 . "다이카 (645 ~ 650)")))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "듀 알 히자") (11 . "듀 알 까다") (10 . "쉐왈") (9 . "라마단")
       (8 . "쉐아반") (7 . "라잡") (6 . "주마다 알 쎄니") (5 . "주마다 알 아왈") (4 . "라비 알 쎄니")
       (3 . "라비 알 아왈") (2 . "사파르") (1 . "무하람")))))
   (ERAS (WIDE (DEFAULT (0 . "히즈라력")))))
  (HEBREW
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (13 . "엘룰월") (12 . "압월") (11 . "담무르월") (10 . "시완월") (9 . "이야르월")
       (8 . "닛산월") (7 . "아달월 2") (7 . "아달월") (6 . "아달월 1") (5 . "스밧월")
       (4 . "데벳월") (3 . "기슬르월") (2 . "말케스월") (1 . "디스리월")))
     (ABBREVIATED
      (DEFAULT (13 . "엘룰월") (12 . "압월") (11 . "담무르월") (10 . "시완월") (9 . "이야르월")
       (8 . "닛산월") (7 . "아달월 2") (7 . "아달월") (6 . "아달월 1") (5 . "스밧월")
       (4 . "데벳월") (3 . "기슬르월") (2 . "말케스월") (1 . "디스리월"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "엘룰") (12 . "압") (11 . "담무르") (10 . "시완") (9 . "이야르")
       (8 . "닛산") (7 . "아달 2") (7 . "아달") (6 . "아달 1") (5 . "스밧") (4 . "데벳")
       (3 . "기슬르") (2 . "말케스") (1 . "디스리")))))
   (ERAS (WIDE (DEFAULT (0 . "유대력")))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "12월") (11 . "11월") (10 . "10월") (9 . "9월") (8 . "8월")
       (7 . "7월") (6 . "6월") (5 . "5월") (4 . "4월") (3 . "3월") (2 . "2월")
       (1 . "1월"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12월") (11 . "11월") (10 . "10월") (9 . "9월") (8 . "8월")
       (7 . "7월") (6 . "6월") (5 . "5월") (4 . "4월") (3 . "3월") (2 . "2월")
       (1 . "1월")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "토") (FRI . "금") (THU . "목") (WED . "수") (TUE . "화")
       (MON . "월") (SUN . "일"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "토요일") (FRI . "금요일") (THU . "목요일") (WED . "수요일")
       (TUE . "화요일") (MON . "월요일") (SUN . "일요일")))
     (ABBREVIATED
      (DEFAULT (SAT . "토") (FRI . "금") (THU . "목") (WED . "수") (TUE . "화")
       (MON . "월") (SUN . "일")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "제 4/4분기") (3 . "제 3/4분기") (2 . "제 2/4분기")
       (1 . "제 1/4분기")))
     (ABBREVIATED (DEFAULT (4 . "4분기") (3 . "3분기") (2 . "2분기") (1 . "1분기")))))
   (DAY-PERIODS
    (STAND-ALONE
     (WIDE
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침") (PM . "오후") (AM . "오전")))
     (NARROW
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침") (PM . "오후") (NOON . "정오")
       (AM . "오전") (MIDNIGHT . "자정")))
     (NARROW
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침") (NOON . "정오") (MIDNIGHT . "자정")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "밤") (EVENING1 . "저녁") (AFTERNOON1 . "오후")
       (MORNING2 . "오전") (MORNING1 . "아침") (NOON . "정오") (MIDNIGHT . "자정")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "CE") (0 . "BCE"))
     (DEFAULT (1 . "AD") (0 . "BC")))
    (WIDE (VARIANT (1 . "서기") (0 . "기원전")) (DEFAULT (1 . "서기") (0 . "기원전"))))
   (DATE-FORMATS (SHORT (PATTERN . "yy. M. d."))
    (MEDIUM (PATTERN . "y. M. d.")) (LONG (PATTERN . "y년 MMMM d일"))
    (FULL (PATTERN . "y년 MMMM d일 EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "a h:mm")) (MEDIUM (PATTERN . "a h:mm:ss"))
    (LONG (PATTERN . "a h시 m분 s초 z")) (FULL (PATTERN . "a h시 m분 s초 zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "G y. M. d."))
    (MEDIUM (PATTERN . "G y. M. d.")) (LONG (PATTERN . "G y년 M월 d일"))
    (FULL (PATTERN . "G y년 M월 d일 EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "파구맨") (12 . "내하세") (11 . "함레") (10 . "새네") (9 . "겐보트")
       (8 . "미야지야") (7 . "매가비트") (6 . "얘카티트") (5 . "테르") (4 . "타흐사스")
       (3 . "헤다르") (2 . "테켐트") (1 . "매스캐램"))))))
  (DANGI
   (DATE-FORMATS (SHORT (PATTERN . "y. M. d.")) (MEDIUM (PATTERN . "y. M. d."))
    (LONG (PATTERN . "U년 MMM d일")) (FULL (PATTERN . "U년 MMM d일 EEEE"))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "나시") (12 . "미스라") (11 . "아비브") (10 . "바우나흐") (9 . "바샨스")
       (8 . "바라문다흐") (7 . "바라마트") (6 . "암쉬르") (5 . "투바흐") (4 . "키야흐크")
       (3 . "하투르") (2 . "바바흐") (1 . "투트"))))))
  (CHINESE
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12월") (11 . "11월") (10 . "10월") (9 . "9월") (8 . "8월")
       (7 . "7월") (6 . "6월") (5 . "5월") (4 . "4월") (3 . "3월") (2 . "2월")
       (1 . "1월")))))
   (DATE-FORMATS (SHORT (PATTERN . "y/M/d")) (MEDIUM (PATTERN . "y. M. d."))
    (LONG (PATTERN . "U년 MMM d일")) (FULL (PATTERN . "U년 MMM d일 EEEE"))))
  (BUDDHIST (ERAS (ABBREVIATED (DEFAULT (0 . "불기")))))))
