((LANGUAGE . "kxv") (SCRIPT . "Deva")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "पान्डे लेञ्जु") (11 . "दिवी लेञ्जु")
       (10 . "दसारा लेञ्जु") (9 . "बोदो लेञ्जु") (8 . "स्राबाँ लेञ्जु")
       (7 . "आसाड़ी लेञ्जु") (6 . "जाटा लेञ्जु") (5 . "बेसे लेञ्जु")
       (4 . "हिरे लेञ्जु") (3 . "पागुणी लेञ्जु") (2 . "माहाका लेञ्जु")
       (1 . "पुसु लेञ्जु")))))
   (DAYS
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "सान्नि वारा") (FRI . "सुकुरु वारा")
       (THU . "लाक्कि वारा") (WED . "पुद्दारा") (TUE . "मंगाड़ा")
       (MON . "साॅम्वारा") (SUN . "आदि वारा")))))
   (DAY-PERIODS (FORMAT (WIDE (DEFAULT (PM . "पी एम") (AM . "ए एम"))))))))
