((LANGUAGE . "kxv") (SCRIPT . "Orya")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ପାଣ୍ଡେ ଲେଞ୍ଜୁ") (11 . "ଦିୱିଡ଼ି ଲେଞ୍ଜୁ")
       (10 . "ଦାସାରା ଲେଞ୍ଜୁ") (9 . "ବଦ ଲେଞ୍ଜୁ") (8 . "ସ୍ରାବାଁ ଲେଞ୍ଜୁ")
       (7 . "ଆସାଡ଼ି ଲେଞ୍ଜୁ") (6 . "ଜାଟା ଲେଞ୍ଜୁ") (5 . "ବେସେ ଲେଞ୍ଜୁ")
       (4 . "ହିରେ ଲେଞ୍ଜୁ") (3 . "ପାଗୁଣି ଲେଞ୍ଜୁ") (2 . "ମାହାକା ଲେଞ୍ଜୁ")
       (1 . "ପୁସୁ ଲେଞ୍ଜୁ")))))
   (DAYS
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "ସାନି ୱାରା") (FRI . "ସୁକ୍ରୁ ୱାରା") (THU . "ଲାକି ୱାରା")
       (WED . "ପୁଦାରା") (TUE . "ମାଙ୍ଗାଡ଼ା") (MON . "ସମ୍ବାରା")
       (SUN . "ଆଦି ୱାରା")))))
   (DAY-PERIODS (FORMAT (WIDE (DEFAULT (PM . "ପି ଏମ") (AM . "ଏ ଏମ"))))))))
