((LANGUAGE . "lo")
 (CALENDARS (ROC (ERAS (ABBREVIATED (DEFAULT (0 . "ກ່ອນ R.O.C.")))))
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "ເອສຟານ") (11 . "ບຣາມານ") (10 . "ດີຣ") (9 . "ອາຊາ")
       (8 . "ອາບານ") (7 . "ເມີ") (6 . "ຊາຣລິວາ") (5 . "ມໍຣເດດ") (4 . "ແຕຣ")
       (3 . "ຄໍຣເດດ") (2 . "ອໍຣດີບີເຫຮດ") (1 . "ຟຣາວາດິນ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ເອສຟານ") (11 . "ບຣາແມນ") (10 . "ດີຣ") (9 . "ອາຊາຣ")
       (8 . "ອາບານ") (7 . "ເມີ") (6 . "ຊາຣຫິວາ") (5 . "ມໍຣເດດ") (4 . "ແຕຣ")
       (3 . "ຄໍຣເດດ") (2 . "ອໍຣດີບີເຫຣດ") (1 . "ຟຣາວາດິນ")))
     (ABBREVIATED
      (DEFAULT (12 . "ເອສຟານ") (11 . "ບຣາມານ") (10 . "ດີຣ") (9 . "ອາຊາ")
       (8 . "ອາບານ") (7 . "ເມີ") (6 . "ຊາຣຫິວາ") (5 . "ມໍຣເດດ") (4 . "ແຕຣ")
       (3 . "ຄໍຣເດດ") (2 . "ອໍຣດີບີເຫຣດ") (1 . "ຟາຣວາດິນ")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ປີເປີເຊຍ")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (235 . "ຮີຊີ") (234 . "ໂຊວາ") (233 . "ໄຕໂຊ") (232 . "ມີຈີ")
      (231 . "ຄີໂອ (1865–1868)") (230 . "ເຈນຈີ (1864–1865)")
      (229 . "ບຸນກຸ (1861–1864)") (228 . "ແມັນ-ເອັນ (1860–1861)")
      (227 . "ແອັນຊິ (1854–1860)") (226 . "ກາອິ (1848–1854)")
      (225 . "ກຸກາ (1844–1848)") (224 . "ເທັນໂປ (1830–1844)")
      (223 . "ບຸນຊິ (1818–1830)") (222 . "ບຸນກາ (1804–1818)")
      (221 . "ກຽວວາ (1801–1804)") (220 . "ຄານຊິ (1789–1801)")
      (219 . "ເທັນມິ (1781–1789)") (218 . "ເອັນ-ອິ (1772–1781)")
      (217 . "ເມຍວາ (1764–1772)") (216 . "ໂຫຢາກຸ (1751–1764)")
      (215 . "ຄານ-ອິນ (1748–1751)") (214 . "ເອັນກຽວ (1744–1748)")
      (213 . "ຄານໂປ (1741–1744)") (212 . "ເຈັນບຸນ (1736–1741)")
      (211 . "ກຽວຫຸ (1716–1736)") (210 . "ຊຸຕຸກຸ (1711–1716)")
      (209 . "ໂຫອິ (1704–1711)") (208 . "ເຈັນໂຣກຸ (1688–1704)")
      (207 . "ໂຈກຽວ (1684–1688)") (206 . "ເທັນວາ (1681–1684)")
      (205 . "ເອັນໂປ (1673–1681)") (204 . "ການບຸນ (1661–1673)")
      (203 . "ແມນຈິ (1658–1661)") (202 . "ເມຍຢາກຸ (1655–1658)")
      (201 . "ຊຸ (1652–1655)") (200 . "ຄຽນ (1648–1652)")
      (199 . "ໂຊໂຊ (1644–1648)") (198 . "ຄານ-ອິ (1624–1644)")
      (197 . "ເກັນວາ (1615–1624)") (196 . "ຄິໂຊ (1596–1615)")
      (195 . "ບຸນໂຣກຸ (1592–1596)") (194 . "ເທັນໂຊ (1573–1592)")
      (193 . "ເຈັນກິ (1570–1573)") (192 . "ອິໂຣກຸ (1558–1570)")
      (191 . "ໂກຈິ (1555–1558)") (190 . "ເທັນມອນ (1532–1555)")
      (189 . "ກຽວໂຣກຸ (1528–1532)") (188 . "ໄຕອິ (1521–1528)")
      (187 . "ອິໂຊ (1504–1521)") (186 . "ບຸນກິ (1501–1504)")
      (185 . "ມິໂອ (1492–1501)") (184 . "ເອັນໂຕກຸ (1489–1492)")
      (183 . "ໂຊກຽວ (1487–1489)") (182 . "ບຸນມິ (1469–1487)")
      (181 . "ໂອນິນ (1467–1469)") (180 . "ບຸນໂຊ (1466–1467)")
      (179 . "ຄານໂຊ (1460–1466)") (178 . "ໂຊໂຣກຸ (1457–1460)")
      (177 . "ເກໂຊ (1455–1457)") (176 . "ກຽວໂຕກຸ (1452–1455)")
      (175 . "ໂຫໂຕກຸ (1449–1452)") (174 . "ບຸນ-ອານ (1444–1449)")
      (173 . "ກາກິຊຸ (1441–1444)") (172 . "ອິກຽວ (1429–1441)")
      (171 . "ໂຊໂຊ (1428–1429)") (170 . "ໂອອິ (1394–1428)")
      (169 . "ມິໂຕກຸ (1390–1394)") (168 . "ຄູ (1389–1390)")
      (167 . "ກາກິ (1387–1389)") (166 . "ມີໂຕກຸ (1384–1387)")
      (165 . "ເຈັນຊຸ (1384–1392)") (164 . "ໂກວາ (1381–1384)")
      (163 . "ຄໍຢາກຸ (1379–1381)") (162 . "ເທັນຈຸ (1375–1379)")
      (161 . "ບຸນຊຸ (1372–1375)") (160 . "ເຄນໂຕກຸ (1370–1372)")
      (159 . "ໂຊຊິ (1346–1370)") (158 . "ໂກໂກກຸ (1340–1346)")
      (157 . "ເອັນເຈັນ (1336–1340)") (156 . "ເກັມມຸ (1334–1336)")
      (155 . "ເຈນໂກ (1331–1334)") (154 . "ເຈນໂຕກູ (1329–1331)")
      (153 . "ຄາຣາກິ (1326–1329)") (152 . "ໂຊຊິ (1324–1326)")
      (151 . "ເຈນກຽວ (1321–1324)") (150 . "ຈີໂນ (1319–1321)")
      (149 . "ບຸນໂປ (1317–1319)") (148 . "ໂຊວາ (1312–1317)")
      (147 . "ໂອໂຊ (1300–1312)") (146 . "ອິນກິ (1308–1311)")
      (145 . "ໂຕກູຈິ (1306–1308)") (144 . "ຄາເຈນ (1303–1306)")
      (143 . "ເຄນເຈນ (1302–1303)") (142 . "ເຊີນ (1299–1302)")
      (141 . "ອິນນິນ (1293–1299)") (140 . "ໂຊ (1288–1293)")
      (139 . "ເຄິນ (1278–1288)") (138 . "ເຄນຈີ (1275–1278)")
      (137 . "ບຸນ-ອີ (1264–1275)") (136 . "ໂຄໂຊ (1261–1264)")
      (135 . "ບຸນ-ໂອ (1260–1261)") (134 . "ໂຊເກນ (1259–1260)")
      (133 . "ໂຊກາ (1257–1259)") (132 . "ໂຄເຈນ (1256–1257)")
      (131 . "ເຄນໂຊ (1249–1256)") (130 . "ໂຫຈີ (1247–1249)")
      (129 . "ຄານເຈນ (1243–1247)") (128 . "ນິນຈີ (1240–1243)")
      (127 . "ເອັນ-ໂອ (1239–1240)") (126 . "ເຣຢະກຸນິນ (1238–1239)")
      (125 . "ກາເຕະ (1235–1238)") (124 . "ບັນເຣຢະກຸ (1234–1235)")
      (123 . "ເທັມປຸກຸ (1233–1234)") (122 . "ໂຈະເອະ (1232–1233)")
      (121 . "ການກິ (1229–1232)") (120 . "ອານເຕະ (1227–1229)")
      (119 . "ກາໂຮກຸ (1225–1227)") (118 . "ເຄັນນິນ (1224–1225)")
      (117 . "ໂຈະໂອະ (1222–1224)") (116 . "ໂຊະກິວ (1219–1222)")
      (115 . "ເກັນໂປະ (1213–1219)") (114 . "ເກັນເຣຢະກຸ (1211–1213)")
      (113 . "ໂຊະເຄັນ (1207–1211)") (112 . "ເກັນ-ເອະ (1206–1207)")
      (111 . "ເຄັນກິວ (1204–1206)") (110 . "ເກັນນິນ (1201–1204)")
      (109 . "ໂຊຈິ (1199–1201)") (108 . "ເກັນຄິວ (1190–1199)")
      (107 . "ບັນຈິ (1185–1190)") (106 . "ເຄັນເຣຢຸກິ (1184–1185)")
      (105 . "ຈຸເອະ (1182–1184)") (104 . "ໂຢະວະ (1181–1182)")
      (103 . "ຈິໂຊະ (1177–1181)") (102 . "ອານເຄັນ (1175–1177)")
      (101 . "ໂຊະອານ (1171–1175)") (100 . "ກະໂອ (1169–1171)")
      (99 . "ນິນ-ອານ (1166–1169)") (98 . "ເອມານ (1165–1166)")
      (97 . "ໂຊະການ (1163–1165)") (96 . "ໂອໂຊ (1161–1163)")
      (95 . "ເອເຣຢະກຸ (1160–1161)") (94 . "ເຮຈິ (1159–1160)")
      (93 . "ໂຮເຄັນ (1156–1159)") (92 . "ຄິວຈຸ (1154–1156)")
      (91 . "ນິນເປ (1151–1154)") (90 . "ຄິວອານ (1145–1151)")
      (89 . "ເທັນໂຢະ (1144–1145)") (88 . "ໂກະຈິ (1142–1144)")
      (87 . "ເອຈິ (1141–1142)") (86 . "ໂຮເອັນ (1135–1141)")
      (85 . "ໂຊະໂຊະ (1132–1135)") (84 . "ເທັນໂຊະ (1131–1132)")
      (83 . "ດາອິຈິ (1126–1131)") (82 . "ເທັນຈິ (1124–1126)")
      (81 . "ໂຮະອານ (1120–1124)") (80 . "ເຄັນ-ເອ (1118–1120)")
      (79 . "ເອກິວ (1113–1118)") (78 . "ເທັນ-ອິ (1110–1113)")
      (77 . "ເທັນນິນ (1108–1110)") (76 . "ກາໂຊະ (1106–1108)")
      (75 . "ໂຊະຈິ (1104–1106)") (74 . "ໂກະວະ (1099–1104)")
      (73 . "ໂຊະໂຕະກຸ (1097–1099)") (72 . "ເອະໂຊະ (1096–1097)")
      (71 . "ກາໂຊ (1094–1096)") (70 . "ການຈິ (1087–1094)")
      (69 . "ໂອໂຕະກຸ (1084–1087)") (68 . "ເອໂຊະ (1081–1084)")
      (67 . "ໂຊະເຣຢະກຸ (1077–1081)") (66 . "ໂຊະໂຮ (1074–1077)")
      (65 . "ເອັນຄິວ (1069–1074)") (64 . "ຈິເຣຢະກຸ (1065–1069)")
      (63 . "ໂກເຮ (1058–1065)") (62 . "ເທັນງິ (1053–1058)")
      (61 . "ເອະໂຊ (1046–1053)") (60 . "ການໂຕະກຸ (1044–1046)")
      (59 . "ໂຊຄິວ (1040–1044)") (58 . "ໂຊເຣຢະກຸ (1037–1040)")
      (57 . "ໂຊເງັນ (1028–1037)") (56 . "ມານຈຸ (1024–1028)")
      (55 . "ຈິອານ (1021–1024)") (54 . "ການນິງ (1017–1021)")
      (53 . "ໂຊຫວະ (1012–1017)") (52 . "ການໂກ (1004–1012)")
      (51 . "ໂຊໂຮ (999–1004)") (50 . "ໂຊໂຕະກຸ (995–999)")
      (49 . "ໂຊຣຢະກຸ (990–995)") (48 . "ເອໂຊ (989–990)")
      (47 . "ເອ-ເອັນ (987–989)") (46 . "ການນະ (985–987)")
      (45 . "ເອການ (983–985)") (44 . "ເທັນເງັນ (978–983)")
      (43 . "ໂຈເງັນ (976–978)") (42 . "ເທັນ-ເອັນ (973–976)")
      (41 . "ເທັນໂຣະກຸ (970–973)") (40 . "ອານະ (968–970)")
      (39 . "ໂກໂຮ (964–968)") (38 . "ໂອວະ (961–964)")
      (37 . "ເທັນໂຕະກຸ (957–961)") (36 . "ເທັນຣຢາກູ (947–957)")
      (35 . "ເທັນງຽວ (938–947)") (34 . "ໂຊເຮ (931–938)")
      (33 . "ເອັນໂຊ (923–931)") (32 . "ເອັນງິ (901–923)")
      (31 . "ໂຊຕາອິ (898–901)") (30 . "ກໍາປຽວ (889–898)")
      (29 . "ນິນນາ (885–889)") (28 . "ເກັນເກ (877–885)")
      (27 . "ໂຈງານ (859–877)") (26 . "ເທັນນານ (857–859)")
      (25 . "ສະອິໂກະ (854–857)") (24 . "ນິນຈູ (851–854)")
      (23 . "ກະໂຈ (848–851)") (22 . "ໂຊວະ (834–848)") (21 . "ເທັນໂຊ (824–834)")
      (20 . "ໂກນິນ (810–824)") (19 . "ດາອິໂດ (806–810)")
      (18 . "ເອັນຣຢາກຸ (782–806)") (17 . "ເທັນ-ໂອ (781–782)")
      (16 . "ໂຮກິ (770–780)") (15 . "ຈິງໂງະ-ເຄອຸງ (767–770)")
      (14 . "ເທັມປຽວ-ຈິງໂງະ (765–767)") (13 . "ເທັມປຽວ-ໂຮຈິ (757–765)")
      (12 . "ເທັມປຽວ-ໂຊໂຮ (749–757)") (11 . "ເທັມປຽວ-ຄໍາໂປ (749–749)")
      (10 . "ເທັມປຽວ (729–749)") (9 . "ຈິງກິ (724–729)") (8 . "ໂຢໂຣ (717–724)")
      (7 . "ເຣອິກິ (715–717)") (6 . "ວະໂດ (708–715)") (5 . "ເຄອຸງ (704–708)")
      (4 . "ທາອິໂຮ (701–704)") (3 . "ຊູໂຊ (686–701)") (2 . "ຮາກູໂຮ (672–686)")
      (1 . "ຮາກູຊິ (650–671)") (0 . "ທະອິກະ (645–650)")))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "ຊຸລຫິຈ") (11 . "ຊຸລກິອຸ") (10 . "ເຊົາ") (9 . "ເຮາະມະ")
       (8 . "ຊາ") (7 . "ເຮາະ") (6 . "ນຸມາ 2") (5 . "ນຸມາ 1") (4 . "ຮອກບີ 2")
       (3 . "ຮອກບີ 1") (2 . "ເຄາະ") (1 . "ມຸຮັດ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ດຸອັດກິຈະ") (11 . "ດຸອັດກິດະ") (10 . "ເຊົາວັດ")
       (9 . "ຮາມາດອນ") (8 . "ຊະບານ") (7 . "ຮາຈັບ") (6 . "ຈຸມາດາ 2")
       (5 . "ຈຸມາດາ 1") (4 . "ຮອດບີ 2") (3 . "ຮອດບີ 1") (2 . "ຊາຟາຣ")
       (1 . "ມຸຣະຮອມ")))
     (ABBREVIATED
      (DEFAULT (12 . "ຊຸລຫິຈ") (11 . "ຊຸລກິອຸ") (10 . "ເຊົາ") (9 . "ເຮາະມະ")
       (8 . "ຊະອ໌") (7 . "ເຮາະ") (6 . "ນຸມາ 2") (5 . "ນຸມາ 1") (4 . "ຮອກບີ 2")
       (3 . "ຮອດບີ 1") (2 . "ເຄາະ") (1 . "ມຸຮັດ")))))
   (DATE-FORMATS (SHORT (PATTERN . "y-MM-dd")) (MEDIUM (PATTERN . "y MMM d"))
    (LONG (PATTERN . "y MMMM d")) (FULL (PATTERN . "EEEE, y MMMM dd"))))
  (INDIAN
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "ຜາລກຸນີ") (11 . "ມາຄະ") (10 . "ປຸສະຍາ")
       (9 . "ອັກຣາຮາຢານາ") (8 . "ການຕິກາ") (7 . "ອັສວິຊາ") (6 . "ພະຕຣາ")
       (5 . "ສາຣາວານາ") (4 . "ອັດສາ") (3 . "ເຊດຖາ") (2 . "ວິສາຂະ")
       (1 . "ຈິຕຣາ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ຜາລກຸນີ") (11 . "ມາຄະ") (10 . "ປຸສະຍາ")
       (9 . "ອັກຣາຮາຢານາ") (8 . "ການຕິກາ") (7 . "ອັສວິຊາ") (6 . "ພະຕຣາ")
       (5 . "ສາຣາວານາ") (4 . "ອັດສາ") (3 . "ເຊດຖາ") (2 . "ວິສາຂະ")
       (1 . "ຈິຕຣາ")))
     (ABBREVIATED
      (DEFAULT (12 . "ຜາລກຸນີ") (11 . "ມາຄະ") (10 . "ປຸສາ") (9 . "ອັກຣາຮາຢານາ")
       (8 . "ການຕິກາ") (7 . "ອັສວິຊາ") (6 . "ພະຕຣາ") (5 . "ສາຣາວານາ")
       (4 . "ອັດສາ") (3 . "ເຊດຖາ") (2 . "ວິສາຂະ") (1 . "ຈິຕຣາ")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ມ.ສ.")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ອີລູ") (12 . "ເອບ") (11 . "ຕາມູ") (10 . "ສີວານ")
       (9 . "ອີຍາຣ") (8 . "ນິດຊານ") (7 . "ອາດາ II") (7 . "ອາດາ") (6 . "ອາດາ I")
       (5 . "ຊີວັດ") (4 . "ເຕເວດ") (3 . "ກິດເລບ") (2 . "ເຮວານ")
       (1 . "ທຣິດຣີ"))))))
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ທັນວາ") (11 . "ພະຈິກ") (10 . "ຕຸລາ") (9 . "ກັນຍາ")
       (8 . "ສິງຫາ") (7 . "ກໍລະກົດ") (6 . "ມິຖຸນາ") (5 . "ພຶດສະພາ")
       (4 . "ເມສາ") (3 . "ມີນາ") (2 . "ກຸມພາ") (1 . "ມັງກອນ")))
     (ABBREVIATED
      (DEFAULT (12 . "ທ.ວ.") (11 . "ພ.ຈ.") (10 . "ຕ.ລ.") (9 . "ກ.ຍ.")
       (8 . "ສ.ຫ.") (7 . "ກ.ລ.") (6 . "ມິ.ຖ.") (5 . "ພ.ພ.") (4 . "ມ.ສ.")
       (3 . "ມ.ນ.") (2 . "ກ.ພ.") (1 . "ມ.ກ.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "ສ") (FRI . "ສຸ") (THU . "ພຫ") (WED . "ພ") (TUE . "ອ")
       (MON . "ຈ") (SUN . "ອາ"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "ວັນເສົາ") (FRI . "ວັນສຸກ") (THU . "ວັນພະຫັດ")
       (WED . "ວັນພຸດ") (TUE . "ວັນອັງຄານ") (MON . "ວັນຈັນ")
       (SUN . "ວັນອາທິດ")))
     (SHORT
      (DEFAULT (SAT . "ສ.") (FRI . "ສຸ.") (THU . "ພຫ.") (WED . "ພ.")
       (TUE . "ອ.") (MON . "ຈ.") (SUN . "ອາ.")))
     (ABBREVIATED
      (DEFAULT (SAT . "ເສົາ") (FRI . "ສຸກ") (THU . "ພະຫັດ") (WED . "ພຸດ")
       (TUE . "ອັງຄານ") (MON . "ຈັນ") (SUN . "ອາທິດ")))))
   (QUARTERS
    (STAND-ALONE
     (ABBREVIATED (DEFAULT (4 . "ຕ4") (3 . "ຕ3") (2 . "ຕ2") (1 . "ຕ1"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "ໄຕຣມາດ 4") (3 . "ໄຕຣມາດ 3") (2 . "ໄຕຣມາດ 2")
       (1 . "ໄຕຣມາດ 1")))
     (ABBREVIATED (DEFAULT (4 . "ຕມ4") (3 . "ຕມ3") (2 . "ຕມ2") (1 . "ຕມ1")))))
   (DAY-PERIODS
    (STAND-ALONE (WIDE (DEFAULT (NOON . "ຕອນທ່ຽງ") (MIDNIGHT . "ທ່ຽງຄືນ")))
     (NARROW
      (DEFAULT (NIGHT1 . "​ກາງ​ຄືນ") (EVENING1 . "ແລງ") (AFTERNOON1 . "ສ")
       (MORNING1 . "​ເຊົ້າ")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "​ກາງ​ຄືນ") (EVENING1 . "ແລງ") (AFTERNOON1 . "ສວາຍ")
       (MORNING1 . "​ເຊົ້າ") (NOON . "ທ່ຽງ") (MIDNIGHT . "ທ່ຽງ​ຄືນ"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "ຕອນກາງຄືນ") (EVENING1 . "ຕອນແລງ")
       (AFTERNOON1 . "ຕອນບ່າຍ") (MORNING1 . "ຕອນເຊົ້າ") (NOON . "ຕອນທ່ຽງ")
       (MIDNIGHT . "ທ່ຽງຄືນ")))
     (NARROW
      (DEFAULT (NIGHT1 . "ກາງຄືນ") (EVENING1 . "ຕອນແລງ")
       (AFTERNOON1 . "ຕອນທ່ຽງ") (MORNING1 . "ຕອນເຊົ້າ") (NOON . "ຕອນທ່ຽງ")
       (MIDNIGHT . "ທ່ຽງຄືນ")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ກາງຄືນ") (EVENING1 . "ຕອນແລງ")
       (AFTERNOON1 . "ຕອນບ່າຍ") (MORNING1 . "ຕອນເຊົ້າ") (PM . "ຫຼັງທ່ຽງ")
       (NOON . "ຕອນທ່ຽງ") (AM . "ກ່ອນທ່ຽງ") (MIDNIGHT . "ທ່ຽງຄືນ")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "ຍຸກ ຄ.ສ"))
     (DEFAULT (1 . "ຄ.ສ.") (0 . "ກ່ອນ ຄ.ສ.")))
    (WIDE (VARIANT (1 . "ສາກົນສັກກະລາດ") (0 . "ກ່ອນສາກົນສັກກະລາດ"))
     (DEFAULT (1 . "ຄຣິດສັກກະລາດ") (0 . "ກ່ອນຄຣິດສັກກະລາດ"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y")) (MEDIUM (PATTERN . "d MMM y"))
    (LONG (PATTERN . "d MMMM y")) (FULL (PATTERN . "EEEE, d MMMM y")))
   (TIME-FORMATS (SHORT (PATTERN . "H:mm")) (MEDIUM (PATTERN . "H:mm:ss"))
    (LONG (PATTERN . "H ໂມງ m ນາທີ ss ວິນາທີ z"))
    (FULL (PATTERN . "H ໂມງ m ນາທີ ss ວິນາທີ zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y GGGGG"))
    (MEDIUM (PATTERN . "d MMM y G")) (LONG (PATTERN . "d MMMM y G"))
    (FULL (PATTERN . "EEEEທີ d MMMM y G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ພາກູເມນ") (12 . "ເນແຮສ໌") (11 . "ຮຳເລ") (10 . "ເຊເນ")
       (9 . "ເຈນບອດ") (8 . "ເມຍເຊຍ") (7 . "ເມກາບິດ") (6 . "ເຍຄາທິດ")
       (5 . "ເທີ") (4 . "ທາຊັສ") (3 . "ເຮດາ") (2 . "ເຕເກມ")
       (1 . "ແມສເຄີແຣມ"))))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (13 . "ນາຊີວ") (12 . "ມາສລາ") (11 . "ອີແປບ") (10 . "ເປົານາ")
       (9 . "ບາສຮານ") (8 . "ບາລາມູດາ") (7 . "ບາລຳຮາດ") (6 . "ອຳເຊີ")
       (5 . "ໂທບາ") (4 . "ເຄຍ") (3 . "ຮາໂຕ") (2 . "ບາບາ") (1 . "ເທົາ")))
     (ABBREVIATED
      (DEFAULT (13 . "ນາຊີວ") (12 . "ມາສລາ") (11 . "ອີແປບ") (10 . "ເປົານາ")
       (9 . "ບາສຮານ") (8 . "ບາລາມູດາ") (7 . "ບາລຳຮາດ") (6 . "ອຳເຊີ")
       (5 . "ໂທບາ") (4 . "ເຄຍ") (3 . "ຮາໂຕ") (2 . "ບາບາ") (1 . "ເທົາ"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ນາຊີວ") (12 . "ມາສລາ") (11 . "ອີແປບ") (10 . "ເປົານາ")
       (9 . "ບາສຮານ") (8 . "ບາລາມູດາ") (7 . "ບາລຳຮາດ") (6 . "ອາເຊີ")
       (5 . "ໂທບາ") (4 . "ເຄຍ") (3 . "ຮາໂຕ") (2 . "ບາບາ") (1 . "ເທົາ")))
     (ABBREVIATED
      (DEFAULT (13 . "ນາຊິວ") (12 . "ມາສລາ") (11 . "ອີແປບ") (10 . "ເປົານາ")
       (9 . "ບາສຮານ") (8 . "ບາລາມູດາ") (7 . "ບາລຳຮາດ") (6 . "ອຳເຊີ")
       (5 . "ໂທບາ") (4 . "ເຄຍ") (3 . "ຮາໂຕ") (2 . "ບາບາ") (1 . "ເທົາ"))))))
  (CHINESE
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12") (11 . "11") (10 . "10") (9 . "9") (8 . "8")
       (7 . "7") (6 . "6") (5 . "5") (4 . "4") (3 . "3") (2 . "2")
       (1 . "1")))))
   (DATE-FORMATS (SHORT (PATTERN . "y-M-d")) (MEDIUM (PATTERN . "U MMM d"))
    (LONG (PATTERN . "U MMMM d")) (FULL (PATTERN . "EEEE, U MMMM dd"))))
  (BUDDHIST (ERAS (ABBREVIATED (DEFAULT (0 . "ພ.ສ.")))))))
