((LANGUAGE . "lrc")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "دئسامر") (11 . "نوڤامر") (10 . "ئوکتوڤر") (9 . "سئپتامر")
       (8 . "آگوست") (7 . "جوٙلا") (6 . "جوٙأن") (5 . "مئی") (4 . "آڤریل")
       (3 . "مارس") (2 . "فئڤریە") (1 . "جانڤیە")))))
   (QUARTERS
    (STAND-ALONE
     (WIDE
      (DEFAULT (4 . "چارأک چاروم") (3 . "چارأک سئیوم") (2 . "چارأک دویوم")
       (1 . "چارأک أڤأل")))
     (ABBREVIATED
      (DEFAULT (4 . "Q4") (3 . "Q3") (2 . "Q2") (1 . "چارأک أڤأل"))))))
  (GENERIC)))
