((LANGUAGE . "ml")
 (CALENDARS
  (ROC
   (ERAS (ABBREVIATED (DEFAULT (1 . "മിംഗ്വോ") (0 . "R.O.C-യ്‌ക്ക് മു.")))
    (WIDE (DEFAULT (0 . "R.O.C-യ്‌ക്ക് മുമ്പ്")))))
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "എ.") (11 . "ബ.") (10 . "ഡെ.") (9 . "അ.") (8 . "അ.")
       (7 . "മെ.") (6 . "ഷ.") (5 . "മോ.") (4 . "ടി.") (3 . "ഖോ") (2 . "ഓ.")
       (1 . "ഫ."))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "എസ്‌ഫാൻഡ്") (11 . "ബഹ്‌മാൻ") (10 . "ഡെയ്") (9 . "അസർ")
       (8 . "അബാൻ") (7 . "മെഹർ") (6 . "ഷഹ്‌രിവാർ") (5 . "മോർദാദ്") (4 . "ടിർ")
       (3 . "ഖോർദാദ്") (2 . "ഓർഡിബെഹെഷ്‌റ്റ്") (1 . "ഫർവാർദിൻ"))))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "ദുൽ ഹിജ്ജ") (11 . "ദുൽ ഖഹദ്") (10 . "ശവ്വാൽ")
       (9 . "റമദാൻ") (8 . "ശഹബാൻ") (7 . "റജബ്") (6 . "ജമാദുൽ ആഖിർ")
       (5 . "ജമാദുൽ അവ്വൽ") (4 . "റബീഹുൽ ആഖിർ") (3 . "റബീഹുൽ അവ്വൽ")
       (2 . "സഫർ") (1 . "മുഹറം")))
     (NARROW
      (DEFAULT (12 . "ദു") (11 . "ദു") (10 . "ശ") (9 . "റ") (8 . "ശ") (7 . "റ")
       (6 . "ജ") (5 . "ജ") (4 . "റ") (3 . "റ") (2 . "സ") (1 . "മു"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ദുൽ ഹിജ്ജ") (11 . "ദുൽ ഖഹദ്") (10 . "ശവ്വാൽ")
       (9 . "റമളാൻ") (8 . "ശഹബാൻ") (7 . "റജബ്") (6 . "ജമാദുൽ ആഖിർ")
       (5 . "ജമാദുൽ അവ്വൽ") (4 . "റബീഹുൽ ആഖിർ") (3 . "റബീഹുൽ അവ്വൽ")
       (2 . "സഫർ") (1 . "മുഹറം")))
     (ABBREVIATED
      (DEFAULT (12 . "ദുൽ ഹി.") (11 . "ദുൽ ഖഹ.") (10 . "ശവ്വാ.") (9 . "റമദാ.")
       (8 . "ശഹബാ.") (7 . "റജ.") (6 . "ജമാദുൽ ആഖി.") (5 . "ജമാദുൽ അവ്വ.")
       (4 . "റബീഹുൽ ആഖി.") (3 . "റബീഹുൽ അവ്വ.") (2 . "സഫ.") (1 . "മുഹ.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ഹിജറ")))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ഫാൽഗുനം") (11 . "മാഘം") (10 . "പൗഷം") (9 . "മാർഗശീർഷം")
       (8 . "കാർത്തികം") (7 . "ആശ്വിനം") (6 . "ഭാദ്രം") (5 . "ശ്രാവണം")
       (4 . "ആഷാഢം") (3 . "ജ്യേഷ്ഠം") (2 . "വൈശാഖം") (1 . "ചൈത്രം")))
     (NARROW
      (DEFAULT (12 . "12") (11 . "11") (10 . "10") (9 . "9") (8 . "8")
       (7 . "7") (6 . "6") (5 . "5") (4 . "4") (3 . "3") (2 . "2") (1 . "1")))
     (ABBREVIATED
      (DEFAULT (12 . "ഫൽഗുനം") (11 . "മാഘം") (10 . "പൗഷം") (9 . "മാർഗശീർഷം")
       (8 . "കാർത്തികം") (7 . "ആശ്വിനം") (6 . "ഭാദ്രം") (5 . "ശ്രാവണം")
       (4 . "ആഷാഢം") (3 . "ജ്യേഷ്ഠം") (2 . "വൈശാഖം") (1 . "ചൈത്രം")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ശക")))))
  (HEBREW
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "ഏ.") (12 . "അ.") (11 . "താ.") (10 . "സി.") (9 . "ഇ.")
       (8 . "നി.") (7 . "അ II") (7 . "അ.") (6 . "അ I") (5 . "സീ.") (4 . "ടി.")
       (3 . "കി.") (2 . "ഹെ.") (1 . "തി."))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "ഏലുൾ") (12 . "അബ്") (11 . "താമൂസ്") (10 . "സിവാൻ")
       (9 . "ഇയാർ") (8 . "നിസാൻ") (7 . "അദാർ II") (7 . "അദാർ") (6 . "അദാർ I")
       (5 . "സീബാറ്റ്") (4 . "ടിവെറ്റ്") (3 . "കിസ്‌ലെവ്") (2 . "ഹെഷ്‌വൻ")
       (1 . "തിഷ്റി"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ഡി") (11 . "ന") (10 . "ഒ") (9 . "സെ") (8 . "ഓ")
       (7 . "ജൂ") (6 . "ജൂൺ") (5 . "മെ") (4 . "ഏ") (3 . "മാ") (2 . "ഫെ")
       (1 . "ജ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ഡിസംബർ") (11 . "നവംബർ") (10 . "ഒക്‌ടോബർ")
       (9 . "സെപ്റ്റംബർ") (8 . "ഓഗസ്റ്റ്") (7 . "ജൂലൈ") (6 . "ജൂൺ")
       (5 . "മേയ്") (4 . "ഏപ്രിൽ") (3 . "മാർച്ച്") (2 . "ഫെബ്രുവരി")
       (1 . "ജനുവരി")))
     (ABBREVIATED
      (DEFAULT (12 . "ഡിസം") (11 . "നവം") (10 . "ഒക്ടോ") (9 . "സെപ്റ്റം")
       (8 . "ഓഗ") (7 . "ജൂലൈ") (6 . "ജൂൺ") (5 . "മേയ്") (4 . "ഏപ്രി")
       (3 . "മാർ") (2 . "ഫെബ്രു") (1 . "ജനു")))))
   (DAYS
    (STAND-ALONE
     (WIDE
      (DEFAULT (SAT . "ശനിയാഴ്‌ച") (FRI . "വെള്ളിയാഴ്‌ച") (THU . "വ്യാഴാഴ്‌ച")
       (WED . "ബുധനാഴ്‌ച") (TUE . "ചൊവ്വാഴ്‌ച") (MON . "തിങ്കളാഴ്‌ച")
       (SUN . "ഞായറാഴ്‌ച")))
     (NARROW
      (DEFAULT (SAT . "ശ") (FRI . "വെ") (THU . "വ്യാ") (WED . "ബു")
       (TUE . "ചൊ") (MON . "തി") (SUN . "ഞാ"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "ശനിയാഴ്‌ച") (FRI . "വെള്ളിയാഴ്‌ച") (THU . "വ്യാഴാഴ്‌ച")
       (WED . "ബുധനാഴ്‌ച") (TUE . "ചൊവ്വാഴ്ച") (MON . "തിങ്കളാഴ്‌ച")
       (SUN . "ഞായറാഴ്‌ച")))
     (SHORT
      (DEFAULT (SAT . "ശ") (FRI . "വെ") (THU . "വ്യാ") (WED . "ബു")
       (TUE . "ചൊ") (MON . "തി") (SUN . "ഞാ")))
     (NARROW
      (DEFAULT (SAT . "ശ") (FRI . "വെ") (THU . "വ്യാ") (WED . "ബു")
       (TUE . "ചൊ") (MON . "തി") (SUN . "ഞ")))
     (ABBREVIATED
      (DEFAULT (SAT . "ശനി") (FRI . "വെള്ളി") (THU . "വ്യാഴം") (WED . "ബുധൻ")
       (TUE . "ചൊവ്വ") (MON . "തിങ്കൾ") (SUN . "ഞായർ")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "നാലാം പാദം") (3 . "മൂന്നാം പാദം") (2 . "രണ്ടാം പാദം")
       (1 . "ഒന്നാം പാദം")))))
   (DAY-PERIODS
    (FORMAT
     (NARROW
      (DEFAULT (NIGHT1 . "രാത്രി") (EVENING2 . "സന്ധ്യ")
       (EVENING1 . "വൈകുന്നേരം") (AFTERNOON2 . "ഉച്ചതിരിഞ്ഞ്")
       (AFTERNOON1 . "ഉച്ചയ്ക്ക്") (MORNING2 . "രാവിലെ")
       (MORNING1 . "പുലർച്ചെ") (NOON . "ഉച്ച") (MIDNIGHT . "അ")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "രാത്രി") (EVENING2 . "സന്ധ്യ")
       (EVENING1 . "വൈകുന്നേരം") (AFTERNOON2 . "ഉച്ചതിരിഞ്ഞ്")
       (AFTERNOON1 . "ഉച്ചയ്ക്ക്") (MORNING2 . "രാവിലെ")
       (MORNING1 . "പുലർച്ചെ") (NOON . "ഉച്ച") (MIDNIGHT . "അർദ്ധരാത്രി")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "സിഇ") (0 . "ബിസിഇ"))
     (DEFAULT (1 . "എഡി") (0 . "ബി.സി.")))
    (WIDE (VARIANT (1 . "സി.ഇ.") (0 . "ബി.സി.ഇ."))
     (DEFAULT (1 . "ആന്നോ ഡൊമിനി") (0 . "ക്രിസ്‌തുവിന് മുമ്പ്"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "y, MMM d"))
    (LONG (PATTERN . "y, MMMM d")) (FULL (PATTERN . "y, MMMM d, EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "h:mm a")) (MEDIUM (PATTERN . "h:mm:ss a"))
    (LONG (PATTERN . "h:mm:ss a z")) (FULL (PATTERN . "h:mm:ss a zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "GGGGG y-MM-dd"))
    (MEDIUM (PATTERN . "G y, MMM d")) (LONG (PATTERN . "G y, MMMM d"))
    (FULL (PATTERN . "G y, MMMM d, EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "പാ.") (12 . "നെ.") (11 . "ഹാം") (10 . "സെ.") (9 . "ഗെ.")
       (8 . "മി.") (7 . "മെ.") (6 . "യെ.") (5 . "ടെ.") (4 . "ത.") (3 . "ഹേ.")
       (2 . "ടെ.") (1 . "മെ."))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "പാഗുമെൻ") (12 . "നെഹാസെ") (11 . "ഹാംലെ") (10 . "സെനെ")
       (9 . "ഗെൻബോട്ട്") (8 . "മിയാസിയ") (7 . "മെഗാബിറ്റ്")
       (6 . "യെക്കാറ്റിറ്റ്") (5 . "ടെർ") (4 . "തഹ്‌സാസ്") (3 . "ഹേദർ")
       (2 . "ടെക്കെംറ്റ്") (1 . "മെസ്‌കെരെം")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "കാലഘട്ടം1") (0 . "കാലഘട്ടം0")))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "ന.") (12 . "മെ.") (11 . "ഈ.") (10 . "പ.") (9 . "ബാ.")
       (8 . "ബാ.") (7 . "ബാ.") (6 . "ആം.") (5 . "ടോ.") (4 . "കി.") (3 . "ഹാ.")
       (2 . "ബാ.") (1 . "ടൗ."))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "നസീ") (12 . "മെസ്ര") (11 . "ഈപെപ്") (10 . "പവോണ")
       (9 . "ബാഷൻസ്") (8 . "ബാരമൗഡ") (7 . "ബാരംഹാത്ത്") (6 . "ആംഷിർ")
       (5 . "ടോബ") (4 . "കിയാക്ക്") (3 . "ഹാറ്റർ") (2 . "ബാബ")
       (1 . "ടൗട്ട്")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "കാലഘട്ടം1") (0 . "കാലഘട്ടം0")))))))
