((LANGUAGE . "mr")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "मिंगू") (0 . "आर.ओ.सी. आधी")))))
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "१२") (11 . "११") (10 . "१०") (9 . "९") (8 . "८")
       (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३") (2 . "२") (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "एसफांद") (11 . "बाहमान") (10 . "दे") (9 . "अझार")
       (8 . "अबान") (7 . "मेहेर") (6 . "शाहरीवार") (5 . "मोरदाद") (4 . "तिर")
       (3 . "खोरदाद") (2 . "ओर्दिबेहेश्त") (1 . "फरवरदिन"))))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "१२") (11 . "११") (10 . "१०") (9 . "९") (8 . "८")
       (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३") (2 . "२") (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "धुल-हिजाह") (11 . "धुल-कीदाह") (10 . "शव्वाल")
       (9 . "रमजान") (8 . "शाबान") (7 . "रझाब") (6 . "जुमादा II")
       (5 . "जुमादा I") (4 . "राबी II") (3 . "राबी I") (2 . "सफर")
       (1 . "मोहरम")))
     (ABBREVIATED
      (DEFAULT (12 . "धुल-हि.") (11 . "धुल-की.") (10 . "शव्वा.") (9 . "रम.")
       (8 . "शाबा.") (7 . "रझा.") (6 . "जुमा. II") (5 . "जुमा. I")
       (4 . "राबी II") (3 . "राबी I") (2 . "सफ.") (1 . "मोह.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "हि.व.")))
    (WIDE (DEFAULT (0 . "हिजरी वर्ष")))))
  (INDIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "फाल्गुन") (11 . "माघ") (10 . "पौष") (9 . "मार्गशीर्ष")
       (8 . "कार्तिक") (7 . "आश्विन") (6 . "भाद्रपद") (5 . "श्रावण")
       (4 . "आषाढ") (3 . "ज्येष्ठ") (2 . "वैशाख") (1 . "चैत्र")))
     (NARROW
      (DEFAULT (12 . "१२") (11 . "११") (10 . "१०") (9 . "९") (8 . "८")
       (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३") (2 . "२") (1 . "१")))
     (ABBREVIATED
      (DEFAULT (12 . "फाल्गुन") (11 . "माघ") (10 . "पौष") (9 . "मार्गशीर्ष")
       (8 . "कार्तिक") (7 . "अश्विन") (6 . "भाद्रपद") (5 . "श्रावण")
       (4 . "आषाढ") (3 . "ज्येष्ठ") (2 . "वैशाख") (1 . "चैत्र"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "फाल्गुन") (11 . "माघ") (10 . "पौष") (9 . "मार्गशीर्ष")
       (8 . "कार्तिक") (7 . "आश्विन") (6 . "भाद्रपद") (5 . "श्रावण")
       (4 . "आषाढ") (3 . "ज्येष्ठ") (2 . "वैशाख") (1 . "चैत्र")))
     (ABBREVIATED
      (DEFAULT (12 . "फाल्गुन") (11 . "माघ") (10 . "पौष") (9 . "मार्गशीर्ष")
       (8 . "कार्तिक") (7 . "अश्विन") (6 . "भाद्रपद") (5 . "श्रावण")
       (4 . "आषाढ") (3 . "ज्येष्ठ") (2 . "वैशाख") (1 . "चैत्र")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "शक")))))
  (HEBREW
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "१३") (12 . "१२") (11 . "११") (10 . "१०") (9 . "९")
       (8 . "८") (7 . "७") (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३")
       (2 . "२") (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "इलुल") (12 . "अव") (11 . "तामुझ") (10 . "सिवान")
       (9 . "इयार") (8 . "निसान") (7 . "अदार II") (7 . "अदार") (6 . "अदार I")
       (5 . "शेवात") (4 . "तेवेत") (3 . "किस्लेव") (2 . "हेशवान")
       (1 . "तिशरी")))))
   (ERAS (WIDE (DEFAULT (0 . "ऍन्नो मुंडी")))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "डि") (11 . "नो") (10 . "ऑ") (9 . "स") (8 . "ऑ")
       (7 . "जु") (6 . "जू") (5 . "मे") (4 . "ए") (3 . "मा") (2 . "फे")
       (1 . "जा"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "डिसेंबर") (11 . "नोव्हेंबर") (10 . "ऑक्टोबर")
       (9 . "सप्टेंबर") (8 . "ऑगस्ट") (7 . "जुलै") (6 . "जून") (5 . "मे")
       (4 . "एप्रिल") (3 . "मार्च") (2 . "फेब्रुवारी") (1 . "जानेवारी")))
     (ABBREVIATED
      (DEFAULT (12 . "डिसें") (11 . "नोव्हें") (10 . "ऑक्टो") (9 . "सप्टें")
       (8 . "ऑग") (7 . "जुलै") (6 . "जून") (5 . "मे") (4 . "एप्रि")
       (3 . "मार्च") (2 . "फेब्रु") (1 . "जाने")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "श") (FRI . "शु") (THU . "गु") (WED . "बु") (TUE . "मं")
       (MON . "सो") (SUN . "र"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "शनिवार") (FRI . "शुक्रवार") (THU . "गुरुवार")
       (WED . "बुधवार") (TUE . "मंगळवार") (MON . "सोमवार") (SUN . "रविवार")))
     (SHORT
      (DEFAULT (SAT . "श") (FRI . "शु") (THU . "गु") (WED . "बु") (TUE . "मं")
       (MON . "सो") (SUN . "र")))
     (ABBREVIATED
      (DEFAULT (SAT . "शनि") (FRI . "शुक्र") (THU . "गुरु") (WED . "बुध")
       (TUE . "मंगळ") (MON . "सोम") (SUN . "रवि")))))
   (QUARTERS
    (STAND-ALONE (NARROW (DEFAULT (4 . "४") (3 . "३") (2 . "२") (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "चतुर्थ तिमाही") (3 . "तृतीय तिमाही")
       (2 . "द्वितीय तिमाही") (1 . "प्रथम तिमाही")))
     (ABBREVIATED (DEFAULT (4 . "ति४") (3 . "ति३") (2 . "ति२") (1 . "ति१")))))
   (DAY-PERIODS
    (STAND-ALONE
     (NARROW
      (DEFAULT (NIGHT1 . "रात्र") (EVENING1 . "सं") (AFTERNOON1 . "दु")
       (MORNING2 . "स") (MORNING1 . "प") (NOON . "म") (MIDNIGHT . "म.रा."))))
    (FORMAT
     (NARROW
      (DEFAULT (NIGHT1 . "रा") (EVENING1 . "सं") (AFTERNOON1 . "दु")
       (MORNING2 . "स") (MORNING1 . "प") (PM . "p") (NOON . "दु") (AM . "a")
       (MIDNIGHT . "म.रा.")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "रात्र") (EVENING1 . "संध्याकाळ")
       (AFTERNOON1 . "दुपार") (MORNING2 . "सकाळ") (MORNING1 . "पहाट")
       (NOON . "मध्यान्ह") (MIDNIGHT . "मध्यरात्र")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "ख्रि. यु.") (0 . "ई. पू. युग"))
     (DEFAULT (1 . "इ. स.") (0 . "ई. स. पू.")))
    (WIDE (VARIANT (1 . "ख्रिस्तयुग") (0 . "ईसापूर्व युग"))
     (DEFAULT (1 . "ईसवीसन") (0 . "ईसवीसनपूर्व"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "d MMM, y"))
    (LONG (PATTERN . "d MMMM, y")) (FULL (PATTERN . "EEEE, d MMMM, y")))
   (TIME-FORMATS (SHORT (PATTERN . "h:mm a")) (MEDIUM (PATTERN . "h:mm:ss a"))
    (LONG (PATTERN . "h:mm:ss a z")) (FULL (PATTERN . "h:mm:ss a zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y GGGGG"))
    (MEDIUM (PATTERN . "d MMM, y G")) (LONG (PATTERN . "d MMMM, y G"))
    (FULL (PATTERN . "EEEE, d MMMM, y G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (ETHIOPIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "१३") (12 . "१२") (11 . "११") (10 . "१०") (9 . "९")
       (8 . "८") (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३") (2 . "२")
       (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "पागुमेन") (12 . "नेहास्से") (11 . "हाम्ले") (10 . "सेने")
       (9 . "गेनबोत") (8 . "मियाझिया") (7 . "मेगाबित") (6 . "येकातित")
       (5 . "तेर") (4 . "ताहसास") (3 . "हेदार") (2 . "तेकेम्त")
       (1 . "मेसकेरेम")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "युग1") (0 . "युग0")))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (13 . "१३") (12 . "१२") (11 . "११") (10 . "१०") (9 . "९")
       (8 . "८") (7 . "७") (6 . "६") (5 . "५") (4 . "४") (3 . "३") (2 . "२")
       (1 . "१"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "नासी") (12 . "मेस्रा") (11 . "इपिप") (10 . "पाओना")
       (9 . "बशान्स") (8 . "बरामउदा") (7 . "बरामहाट") (6 . "ऍमशिर")
       (5 . "तोबा") (4 . "कियाहक") (3 . "हातोर") (2 . "बाबा") (1 . "तौत")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "युग1") (0 . "युग0")))))
  (BUDDHIST
   (ERAS (ABBREVIATED (DEFAULT (0 . "इसपू.")))
    (WIDE (DEFAULT (0 . "इसवीसन पूर्व")))))))
