((LANGUAGE . "myv")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "аца") (11 . "сун") (10 . "ожо") (9 . "таш") (8 . "ума")
       (7 . "мед") (6 . "ашт") (5 . "пан") (4 . "чад") (3 . "эйз") (2 . "дав")
       (1 . "якш"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ацамков") (11 . "сундерьков") (10 . "ожоков")
       (9 . "таштамков") (8 . "умарьков") (7 . "медьков") (6 . "аштемков")
       (5 . "панжиков") (4 . "чадыков") (3 . "эйзюрков") (2 . "даволков")
       (1 . "якшамков")))))
   (DAYS
    (STAND-ALONE
     (WIDE
      (DEFAULT (SAT . "шлямочи") (FRI . "сюконьчи") (THU . "калоньчи")
       (WED . "куншкачи") (TUE . "вастаньчи") (MON . "атяньчи")
       (SUN . "таргочи"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "шлямочистэ") (FRI . "сюконьчистэ") (THU . "калоньчистэ")
       (WED . "куншкачистэ") (TUE . "вастаньчистэ") (MON . "атяньчистэ")
       (SUN . "таргочистэ")))
     (ABBREVIATED
      (DEFAULT (SAT . "шля") (FRI . "сюк") (THU . "кал") (WED . "кун")
       (TUE . "вас") (MON . "атя") (SUN . "тар")))))
   (DAY-PERIODS
    (STAND-ALONE (WIDE (DEFAULT (PM . "обедтэ мейле") (AM . "обедтэ икеле"))))
    (FORMAT (WIDE (DEFAULT (PM . "обедтэ мейле") (AM . "обедтэ икеле")))))
   (ERAS
    (WIDE (VARIANT (1 . "Минек эрасто") (0 . "Минек эрадо икеле"))
     (DEFAULT (1 . "Христосонь чачомадо мейле")
      (0 . "Христосонь чачомадо икеле")))))))
