((LANGUAGE . "nqo")
 (CALENDARS
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ߞ") (11 . "ߣ") (10 . "ߞ") (9 . "ߕ") (8 . "ߘ") (7 . "ߞ")
       (6 . "ߥ") (5 . "ߘ") (4 . "ߞ") (3 . "ߕ") (2 . "ߞ") (1 . "ߓ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ߞߏߟߌ߲ߞߏߟߌ߲") (11 . "ߣߍߣߍߓߊ") (10 . "ߞߏ߲ߓߌߕߌ߮")
       (9 . "ߕߎߟߊߝߌ߲") (8 . "ߘߓߊ߬ߓߌߟߊ") (7 . "ߞߊ߬ߙߌߝߐ߭") (6 . "ߥߊ߬ߛߌ߬ߥߙߊ")
       (5 . "ߘߓߊ߬ߕߊ") (4 . "ߞߏ߲ߞߏߘߌ߬ߓߌ") (3 . "ߕߙߊߓߊ") (2 . "ߞߏ߲ߞߏߜߍ")
       (1 . "ߓߌ߲ߠߊߥߎߟߋ߲")))
     (ABBREVIATED
      (DEFAULT (12 . "ߞߏߟ") (11 . "ߣߍߣ") (10 . "ߞߏ߲ߓ") (9 . "ߕߎߟߊߝߌ߲")
       (8 . "ߘߓߊ߬ߓ") (7 . "ߞߊ߬ߙ") (6 . "ߥߊ߬ߛ") (5 . "ߘߓߊ߬ߕ") (4 . "ߞߏ߲ߘ")
       (3 . "ߕߙߊ") (2 . "ߞߏ߲ߞ") (1 . "ߓߌ߲ߠ")))))
   (DAYS
    (STAND-ALONE
     (SHORT
      (DEFAULT (SAT . "ߞߍ߲") (FRI . "ߛߌ߬") (THU . "ߓߌ") (WED . "ߞߎ")
       (TUE . "ߞߐ߬ߟ") (MON . "ߞߐ߬ߓ") (SUN . "ߞߊ߯")))
     (NARROW
      (DEFAULT (SAT . "ߞ") (FRI . "ߛ") (THU . "ߓ") (WED . "ߞ") (TUE . "ߞ")
       (MON . "ߞ") (SUN . "ߞ")))
     (ABBREVIATED
      (DEFAULT (SAT . "ߞߍ߲ߘ") (FRI . "ߛߌ߬ߣ") (THU . "ߓߌߟ") (WED . "ߞߎߣ")
       (TUE . "ߞߐ߬ߟ") (MON . "ߞߐ߬ߓ") (SUN . "ߞߊ߯ߙ"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "ߞߍ߲ߘߍߟߏ߲") (FRI . "ߛߌ߬ߣߌ߲߬ߟߏ߲") (THU . "ߓߌߟߏ߲")
       (WED . "ߞߎߣߎ߲ߟߏ߲") (TUE . "ߞߐ߬ߟߏ߲") (MON . "ߞߐ߬ߓߊ߬ߟߏ߲")
       (SUN . "ߞߊ߯ߙߌߟߏ߲")))
     (SHORT
      (DEFAULT (SAT . "ߞߍ߲") (FRI . "ߛߌ߬") (THU . "ߓߌ") (WED . "ߞߎ")
       (TUE . "ߞߐ߬ߟߏ߲") (MON . "ߞߐ߬") (SUN . "ߞߊ߯")))
     (ABBREVIATED
      (DEFAULT (SAT . "ߞߍ߲ߘ") (FRI . "ߛߌ߬ߣ") (THU . "ߓߌߟ") (WED . "ߞߎߣ")
       (TUE . "ߞߐ߬ߟߏ߲") (MON . "ߞߐ߬ߓ") (SUN . "ߞߊ߯ߙ")))))
   (QUARTERS
    (STAND-ALONE (NARROW (DEFAULT (4 . "߄") (3 . "߃") (2 . "߂") (1 . "߁"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "ߞߊߙߏߛߓߊ߫ ߄߲") (3 . "ߞߊߙߏߛߓߊ߫ ߃߲") (2 . "ߞߊߙߏߛߓߊ߫ ߂߲")
       (1 . "ߞߊߙߏߛߓߊ߫ ߁߭")))
     (ABBREVIATED (DEFAULT (4 . "ߞߛ߄") (3 . "ߞߛ߃") (2 . "ߞߛ߂") (1 . "ߞߛ߁")))))
   (DAY-PERIODS (FORMAT (ABBREVIATED (DEFAULT (PM . "ߥ") (AM . "ߛ")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "ߌߛ. ߡ. ߞߐ߫") (0 . "ߌߛ. ߡ. ߢߍ߫")))
    (NARROW (DEFAULT (1 . "ߌߛ. ߞߐ߫") (0 . "ߌߛ. ߢߍ߫")))
    (WIDE (VARIANT (1 . "ߞߊ߬ߝߏ߬ߙߋ߲ ߠߊ߫ ߥߎ߬ߛߎ") (0 . "ߞߊ߬ߝߏ߬ߙߋ߲ ߥߎ߬ߛߎ ߢߍ߫"))
     (DEFAULT (1 . "ߌߛߊ߫ ߡߏߦߌ ߞߐ߫") (0 . "ߌߛߊ߫ ߡߏߦߌ ߢߍ߫")))))))
