((LANGUAGE . "ru")
 (CALENDARS
  (ROC
   (ERAS (ABBREVIATED (DEFAULT (1 . "Minguo")))
    (NARROW (DEFAULT (1 . "Миньго") (0 . "до респ.")))
    (WIDE (DEFAULT (1 . "Миньго") (0 . "до основания Китайской республики")))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "эсфанд") (11 . "бахман") (10 . "дей") (9 . "азер")
       (8 . "абан") (7 . "мехр") (6 . "шахривер") (5 . "мордад") (4 . "тир")
       (3 . "хордад") (2 . "ордибехешт") (1 . "фарвардин")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "перс. год")))
    (WIDE (DEFAULT (0 . "персидский год")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "Рэйва") (235 . "Эпоха Хэйсэй") (234 . "Сьова")
      (233 . "Эпоха Тайсьо") (232 . "Эпоха Мэйдзи")
      (231 . "Эпоха Кейо (1865–1868)") (230 . "Эпоха Гендзи (1864–1865)")
      (229 . "Эпоха Бункю (1861–1864)") (228 . "Эпоха Манъэн (1860–1861)")
      (227 . "Эпоха Ансэй (1854–1860)") (226 . "Эпоха Каэй (1848–1854)")
      (225 . "Эпоха Кока (1844–1848)") (224 . "Эпоха Тэмпо (1830–1844)")
      (223 . "Эпоха Бунсэй (1818–1830)") (222 . "Эпоха Бунка (1804–1818)")
      (221 . "Эпоха Кёва (1801–1804)") (220 . "Эпоха Кансэй (1789–1801)")
      (219 . "Эпоха Тэммэй (1781–1789)") (218 . "Эпоха Анъэй (1772–1781)")
      (217 . "Эпоха Мэйва (1764–1772)") (216 . "Эпоха Хоряку (1751–1764)")
      (215 . "Эпоха Канъэн (1748–1751)") (214 . "Эпоха Энкё (1744–1748)")
      (213 . "Эпоха Кампо (1741–1744)") (212 . "Эпоха Гэмбун (1736–1741)")
      (211 . "Эпоха Кёхо (1716–1736)") (210 . "Эпоха Сётоку (1711–1716)")
      (209 . "Эпоха Хоэй (1704–1711)") (208 . "Эпоха Гэнроку (1688–1704)")
      (207 . "Эпоха Дзёкё (1684–1688)") (206 . "Эпоха Тэнва (1681–1684)")
      (205 . "Эпоха Эмпо (1673–1681)") (204 . "Эпоха Камбун (1661–1673)")
      (203 . "Эпоха Мандзи (1658–1661)") (202 . "Эпоха Мэйряку (1655–1658)")
      (201 . "Эпоха Сё (1652–1655)") (200 . "Эпоха Кэйан (1648–1652)")
      (199 . "Эпоха Сёхо (1644–1648)") (198 . "Эпоха Канъэй (1624–1644)")
      (197 . "Эпоха Гэнва (1615–1624)") (196 . "Эпоха Кэйтё (1596–1615)")
      (195 . "Эпоха Бунроку (1592–1596)") (194 . "Эпоха Тэнсё (1573–1592)")
      (193 . "Эпоха Гэнки (1570–1573)") (192 . "Эпоха Эйроку (1558–1570)")
      (191 . "Эпоха Кодзи (1555–1558)") (190 . "Эпоха Тэммон (1532–1555)")
      (189 . "Эпоха Кёроку (1528–1532)") (188 . "Эпоха Тайэй (1521–1528)")
      (187 . "Эпоха Эйсё (1504–1521)") (186 . "Эпоха Бунки (1501–1504)")
      (185 . "Эпоха Мэйо (1492–1501)") (184 . "Эпоха Энтоку (1489–1492)")
      (183 . "Эпоха Тёкё (1487–1489)") (182 . "Эпоха Буммэй (1469–1487)")
      (181 . "Эпоха Онин (1467–1469)") (180 . "Эпоха Бунсё (1466–1467)")
      (179 . "Эпоха Кансё (1460–1466)") (178 . "Эпоха Тёроку (1457–1460)")
      (177 . "Эпоха Косё (1455–1457)") (176 . "Эпоха Кётоку (1452–1455)")
      (175 . "Эпоха Хотоку (1449–1452)") (174 . "Эпоха Банъан (1444–1449)")
      (173 . "Эпоха Какицу (1441–1444)") (172 . "Эпоха Эйкё (1429–1441)")
      (171 . "Эпоха Сётё (1428–1429)") (170 . "Эпоха Оэй (1394–1428)")
      (169 . "Эпоха Мэйтоку (1390–1394)") (168 . "Эпоха Коо (1389–1390)")
      (167 . "Эпоха Какэй (1387–1389)") (166 . "Эпоха Мэйтоку (1384–1387)")
      (165 . "Эпоха Гэнтю (1384–1392)") (164 . "Эпоха Кова (1381–1384)")
      (163 . "Эпоха Коряку (1379–1381)") (162 . "Эпоха Иэндзю (1375–1379)")
      (161 . "Эпоха Бунтю (1372–1375)") (160 . "Эпоха Кэнтоку (1370–1372)")
      (159 . "Эпоха Сёхэй (1346–1370)") (158 . "Эпоха Кококу (1340–1346)")
      (157 . "Эпоха Энгэн (1336–1340)") (156 . "Эпоха Кэмму (1334–1336)")
      (155 . "Эпоха Гэнко (1331–1334)") (154 . "Эпоха Гэнтоку (1329–1331)")
      (153 . "Эпоха Карэки (1326–1329)") (152 . "Эпоха Сётю (1324–1326)")
      (151 . "Эпоха Гэнкё (1321–1324)") (150 . "Эпоха Гэно (1319–1321)")
      (149 . "Эпоха Бумпо (1317–1319)") (148 . "Эпоха Сёва (1312–1317)")
      (147 . "Эпоха Отё (1311–1312)") (146 . "Эпоха Энкэй (1308–1311)")
      (145 . "Эпоха Токудзи (1306–1308)") (144 . "Эпоха Кагэн (1303–1306)")
      (143 . "Эпоха Кэнгэн (1302–1303)") (142 . "Эпоха Сёан (1299–1302)")
      (141 . "Эпоха Эйнин (1293–1299)") (140 . "Эпоха Сёо (1288–1293)")
      (139 . "Эпоха Коан (1278–1288)") (138 . "Эпоха Кэндзи (1275–1278)")
      (137 . "Эпоха Бунъэй (1264–1275)") (136 . "Эпоха Котё (1261–1264)")
      (135 . "Эпоха Бунъо (1260–1261)") (134 . "Эпоха Сёгэн (1259–1260)")
      (133 . "Эпоха Сёка (1257–1259)") (132 . "Эпоха Когэн (1256–1257)")
      (131 . "Эпоха Кэнтё (1249–1256)") (130 . "Эпоха Ходзи (1247–1249)")
      (129 . "Эпоха Кангэн (1243–1247)") (128 . "Эпоха Ниндзи (1240–1243)")
      (127 . "Эпоха Энъо (1239–1240)") (126 . "Эпоха Рякунин (1238–1239)")
      (125 . "Эпоха Катэй (1235–1238)") (124 . "Эпоха Бунряку (1234–1235)")
      (123 . "Эпоха Тэмпуку (1233–1234)") (122 . "Эпоха Дзёэй (1232–1233)")
      (121 . "Эпоха Канки (1229–1232)") (120 . "Эпоха Антэй (1227–1229)")
      (119 . "Эпоха Кароку (1225–1227)") (118 . "Эпоха Гэннин (1224–1225)")
      (117 . "Эпоха Дзёо (1222–1224)") (116 . "Эпоха Сёкю (1219–1222)")
      (115 . "Эпоха Кэмпо (1213–1219)") (114 . "Эпоха Кэнряку (1211–1213)")
      (113 . "Эпоха Сёгэн (1207–1211)") (112 . "Эпоха Кэнъэй (1206–1207)")
      (111 . "Эпоха Гэнкю (1204–1206)") (110 . "Эпоха Кэннин (1201–1204)")
      (109 . "Эпоха Сёдзи (1199–1201)") (108 . "Эпоха Кэнкю (1190–1199)")
      (107 . "Эпоха Бундзи (1185–1190)") (106 . "Эпоха Гэнрюку (1184–1185)")
      (105 . "Эпоха Дзюэй (1182–1184)") (104 . "Эпоха Ёва (1181–1182)")
      (103 . "Эпоха Дзисё (1177–1181)") (102 . "Эпоха Ангэн (1175–1177)")
      (101 . "Эпоха Сёан (1171–1175)") (100 . "Эпоха Као (1169–1171)")
      (99 . "Эпоха Нинъан (1166–1169)") (98 . "Эпоха Эйман (1165–1166)")
      (97 . "Эпоха Тёкан (1163–1165)") (96 . "Эпоха Охо (1161–1163)")
      (95 . "Эпоха Эйряку (1160–1161)") (94 . "Эпоха Хэйдзи (1159–1160)")
      (93 . "Эпоха Хогэн (1156–1159)") (92 . "Эпоха Кюдзю (1154–1156)")
      (91 . "Эпоха Нимпэй (1151–1154)") (90 . "Эпоха Кюан (1145–1151)")
      (89 . "Эпоха Тэнё (1144–1145)") (88 . "Эпоха Кодзи (1142–1144)")
      (87 . "Эпоха Эйдзи (1141–1142)") (86 . "Эпоха Хоэн (1135–1141)")
      (85 . "Эпоха Тёсё (1132–1135)") (84 . "Эпоха Тэнсё (1131–1132)")
      (83 . "Эпоха Дайдзи (1126–1131)") (82 . "Эпоха Тэндзи (1124–1126)")
      (81 . "Эпоха Хоан (1120–1124)") (80 . "Эпоха Гэнъэй (1118–1120)")
      (79 . "Эпоха Эйкю (1113–1118)") (78 . "Эпоха Тэнъэй (1110–1113)")
      (77 . "Эпоха Тэннин (1108–1110)") (76 . "Эпоха Касё (1106–1108)")
      (75 . "Эпоха Тёдзи (1104–1106)") (74 . "Эпоха Кова (1099–1104)")
      (73 . "Эпоха Сётоку (1097–1099)") (72 . "Эпоха Эйтё (1096–1097)")
      (71 . "Эпоха Кахо (1094–1096)") (70 . "Эпоха Кандзи (1087–1094)")
      (69 . "Эпоха Отоку (1084–1087)") (68 . "Эпоха Эйхо (1081–1084)")
      (67 . "Эпоха Сёряку (1077–1081)") (66 . "Эпоха Сёхо (1074–1077)")
      (65 . "Эпоха Энкю (1069–1074)") (64 . "Эпоха Дзиряку (1065–1069)")
      (63 . "Эпоха Кохэй (1058–1065)") (62 . "Эпоха Тэнги (1053–1058)")
      (61 . "Эпоха Эйсо (1046–1053)") (60 . "Эпоха Катоку (1044–1046)")
      (59 . "Эпоха Тёкю (1040–1044)") (58 . "Эпоха Тёряку (1037–1040)")
      (57 . "Эпоха Тёгэн (1028–1037)") (56 . "Эпоха Мандзю (1024–1028)")
      (55 . "Эпоха Дзиан (1021–1024)") (54 . "Эпоха Каннин (1017–1021)")
      (53 . "Эпоха Тёва (1012–1017)") (52 . "Эпоха Канко (1004–1012)")
      (51 . "Эпоха Тёхо (999–1004)") (50 . "Эпоха Тётоку (995–999)")
      (49 . "Эпоха Сёряку (990–995)") (48 . "Эпоха Ейсо (989–990)")
      (47 . "Эпоха Ейен (987–989)") (46 . "Эпоха Канна (985–987)")
      (45 . "Эпоха Ейкан (983–985)") (44 . "Эпоха Тенген (978–983)")
      (43 . "Эпоха Дзьоген (976–978)") (42 . "Эпоха Теньен (973–976)")
      (41 . "Эпоха Тенроку (970–973)") (40 . "Эпоха Анна (968–970)")
      (39 . "Эпоха Кохо (964–968)") (38 . "Эпоха Ова (961–964)")
      (37 . "Эпоха Тентоку (957–961)") (36 . "Эпоха Тенрияку (947–957)")
      (35 . "Эпоха Тенгьо (938–947)") (34 . "Эпоха Сьёхэй (931–938)")
      (33 . "Эпоха Ентьо (923–931)") (32 . "Эпоха Энги (901–923)")
      (31 . "Эпоха Сьотай (898–901)") (30 . "Эпоха Кампьё (889–898)")
      (29 . "Эпоха Нинна (885–889)") (28 . "Эпоха Генкей (877–885)")
      (27 . "Эпоха Йоган (859–877)") (26 . "Эпоха Теннан (857–859)")
      (25 . "Эпоха Сайко (854–857)") (24 . "Эпоха Ниндзю (851–854)")
      (23 . "Эпоха Кайо (848–851)") (22 . "Эпоха Шова (834–848)")
      (21 . "Эпоха Тентьо (824–834)") (20 . "Эпоха Конин (810–824)")
      (19 . "Эпоха Дайдо (806–810)") (18 . "Эпоха Енряку (782–806)")
      (17 . "Эпоха Теньё (781–782)") (16 . "Эпоха Хоки (770–780)")
      (15 . "Эпоха Джинго-Кёюн (767-770)")
      (14 . "Эпоха Темпьё-Ходзи (765-767)")
      (13 . "Эпоха Темпьё-Ходзи (757-765)")
      (12 . "Эпоха Темпьё-Сьохо (749-757)") (11 . "Эпоха Темпьё (749–749)")
      (10 . "Эпоха Темпьё (729–749)") (9 . "Эпоха Дзинки (724–729)")
      (8 . "Эпоха Ёро (717–724)") (7 . "Эпоха Рэйки (715–717)")
      (6 . "Эпоха Вадо (708–715)") (5 . "Эпоха Кёюн (704–708)")
      (4 . "Эпоха Тайхо (701–704)") (3 . "Эпоха Сючё (686–701)")
      (2 . "Эпоха Хакухо (672–686)") (1 . "Эпоха Хакути (650–671)")
      (0 . "Эпоха Тайка (645–650)")))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "зуль-хиджжа") (11 . "зуль-каада") (10 . "шавваль")
       (9 . "рамадан") (8 . "шаабан") (7 . "раджаб") (6 . "джумад-уль-ахир")
       (5 . "джумад-уль-авваль") (4 . "раби-уль-ахир") (3 . "раби-уль-авваль")
       (2 . "сафар") (1 . "мухаррам")))
     (ABBREVIATED
      (DEFAULT (12 . "зуль-х.") (11 . "зуль-к.") (10 . "шав.") (9 . "рам.")
       (8 . "шааб.") (7 . "радж.") (6 . "джум. II") (5 . "джум. I")
       (4 . "раб. II") (3 . "раб. I") (2 . "саф.") (1 . "мух.")))))
   (ERAS (WIDE (DEFAULT (0 . "после хиджры")))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "пхалгуна") (11 . "магха") (10 . "пауза")
       (9 . "аграхайана") (8 . "картика") (7 . "азвина") (6 . "бхадра")
       (5 . "сравана") (4 . "асадха") (3 . "джанштха") (2 . "ваисакха")
       (1 . "чайтра")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "Сака")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "элул") (12 . "ав") (11 . "таммуз") (10 . "сиван")
       (9 . "ияр") (8 . "нисан") (7 . "адар II") (7 . "адар") (6 . "адар I")
       (5 . "шеват") (4 . "тевет") (3 . "кислев") (2 . "хешван")
       (1 . "тишрей")))))
   (ERAS (WIDE (DEFAULT (0 . "от сотворения мира")))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "декабрь") (11 . "ноябрь") (10 . "октябрь")
       (9 . "сентябрь") (8 . "август") (7 . "июль") (6 . "июнь") (5 . "май")
       (4 . "апрель") (3 . "март") (2 . "февраль") (1 . "январь")))
     (NARROW
      (DEFAULT (12 . "Д") (11 . "Н") (10 . "О") (9 . "С") (8 . "А") (7 . "И")
       (6 . "И") (5 . "М") (4 . "А") (3 . "М") (2 . "Ф") (1 . "Я")))
     (ABBREVIATED
      (DEFAULT (12 . "дек.") (11 . "нояб.") (10 . "окт.") (9 . "сент.")
       (8 . "авг.") (7 . "июль") (6 . "июнь") (5 . "май") (4 . "апр.")
       (3 . "март") (2 . "февр.") (1 . "янв."))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "декабря") (11 . "ноября") (10 . "октября")
       (9 . "сентября") (8 . "августа") (7 . "июля") (6 . "июня") (5 . "мая")
       (4 . "апреля") (3 . "марта") (2 . "февраля") (1 . "января")))
     (ABBREVIATED
      (DEFAULT (12 . "дек.") (11 . "нояб.") (10 . "окт.") (9 . "сент.")
       (8 . "авг.") (7 . "июл.") (6 . "июн.") (5 . "мая") (4 . "апр.")
       (3 . "мар.") (2 . "февр.") (1 . "янв.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "С") (FRI . "П") (THU . "Ч") (WED . "С") (TUE . "В")
       (MON . "П") (SUN . "В"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "суббота") (FRI . "пятница") (THU . "четверг")
       (WED . "среда") (TUE . "вторник") (MON . "понедельник")
       (SUN . "воскресенье")))
     (ABBREVIATED
      (DEFAULT (SAT . "сб") (FRI . "пт") (THU . "чт") (WED . "ср") (TUE . "вт")
       (MON . "пн") (SUN . "вс")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "4-й квартал") (3 . "3-й квартал") (2 . "2-й квартал")
       (1 . "1-й квартал")))
     (ABBREVIATED
      (DEFAULT (4 . "4-й кв.") (3 . "3-й кв.") (2 . "2-й кв.")
       (1 . "1-й кв.")))))
   (DAY-PERIODS
    (STAND-ALONE
     (WIDE
      (DEFAULT (NIGHT1 . "ночь") (EVENING1 . "вечер") (AFTERNOON1 . "день")
       (MORNING1 . "утро") (NOON . "полдень") (MIDNIGHT . "полночь")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ночь") (EVENING1 . "веч.") (AFTERNOON1 . "день")
       (MORNING1 . "утро"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "ночи") (EVENING1 . "вечера") (AFTERNOON1 . "дня")
       (MORNING1 . "утра") (NOON . "полдень") (MIDNIGHT . "полночь")))
     (NARROW
      (DEFAULT (NIGHT1 . "ночи") (EVENING1 . "веч.") (AFTERNOON1 . "дня")
       (MORNING1 . "утра") (NOON . "полд.") (MIDNIGHT . "полн.")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ночи") (EVENING1 . "вечера") (AFTERNOON1 . "дня")
       (MORNING1 . "утра") (NOON . "полд.") (MIDNIGHT . "полн.")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "н. э."))
     (DEFAULT (1 . "н. э.") (0 . "до н. э.")))
    (NARROW (DEFAULT (1 . "н.э.") (0 . "до н.э.")))
    (WIDE (VARIANT (1 . "нашей эры") (0 . "до нашей эры"))
     (DEFAULT (1 . "от Рождества Христова") (0 . "до Рождества Христова"))))
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.y"))
    (MEDIUM (PATTERN . "d MMM y 'г'.")) (LONG (PATTERN . "d MMMM y 'г'."))
    (FULL (PATTERN . "EEEE, d MMMM y 'г'.")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "HH:mm:ss z")) (FULL (PATTERN . "HH:mm:ss zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.y G"))
    (MEDIUM (PATTERN . "d MMM y 'г'. G")) (LONG (PATTERN . "d MMMM y 'г'. G"))
    (FULL (PATTERN . "EEEE, d MMMM y 'г'. G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "эпагомен") (12 . "нахасэ") (11 . "хамлэ") (10 . "сэнэ")
       (9 . "генбот") (8 . "миазия") (7 . "магабит") (6 . "якатит") (5 . "тер")
       (4 . "тахсас") (3 . "хедар") (2 . "текемт") (1 . "мескерем")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "от Христа") (0 . "до Христа")))
    (WIDE
     (DEFAULT (1 . "от воплощения Христа") (0 . "до воплощения Христа")))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "наси") (12 . "мисра") (11 . "абиб") (10 . "бауна")
       (9 . "башнас") (8 . "бармуда") (7 . "барамхат") (6 . "амшир")
       (5 . "тубэ") (4 . "кихак") (3 . "хатур") (2 . "бабэ") (1 . "тот")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "от Диокл.") (0 . "до Диокл.")))
    (WIDE (DEFAULT (1 . "от Диоклетиана") (0 . "до Диоклетиана")))))
  (CHINESE
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "12") (11 . "11") (10 . "10") (9 . "9") (8 . "8")
       (7 . "7") (6 . "6") (5 . "5") (4 . "4") (3 . "3") (2 . "2") (1 . "1"))))
    (FORMAT
     (ABBREVIATED
      (DEFAULT (12 . "12") (11 . "11") (10 . "10") (9 . "9") (8 . "8")
       (7 . "7") (6 . "6") (5 . "5") (4 . "4") (3 . "3") (2 . "2")
       (1 . "1")))))
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.y")) (MEDIUM (PATTERN . "dd.MM U"))
    (LONG (PATTERN . "d MMMM U")) (FULL (PATTERN . "EEEE, d MMMM U"))))
  (BUDDHIST
   (ERAS (NARROW (DEFAULT (0 . "бэ")))
    (WIDE (DEFAULT (0 . "буддийская эра")))))))
