((LANGUAGE . "sr")
 (CALENDARS (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "РК") (0 . "Пре РК")))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Есфанд") (11 . "Бахман") (10 . "Деј") (9 . "Азар")
       (8 . "Абан") (7 . "Мехр") (6 . "Шахривар") (5 . "Мордад") (4 . "Тир")
       (3 . "Кордад") (2 . "Ордибехешт") (1 . "Фаравадин")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "АП")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "Реива") (235 . "Хаисеи") (234 . "Шова") (233 . "Таишо")
      (232 . "Меиђи") (231 . "Кеико (1865–1868)") (230 . "Генђи (1864–1865)")
      (229 . "Бункју (1861–1864)") (228 . "Ман-ен (1860-1861)")
      (227 . "Ансеи (1854–1860)") (226 . "Каеи (1848–1854)")
      (225 . "Кока (1844–1848)") (224 . "Тенпо (1830–1844)")
      (223 . "Бунсеи (1818–1830)") (222 . "Бунка (1804–1818)")
      (221 . "Кјова (1801–1804)") (220 . "Кансеи (1789–1801)")
      (219 . "Тенмеи (1781–1789)") (218 . "Ан-еи (1772-1781)")
      (217 . "Меива (1764–1772)") (216 . "Хорјаку (1751–1764)")
      (215 . "Кан-ен (1748-1751)") (214 . "Енкјо (1744–1748)")
      (213 . "Канпо (1741–1744)") (212 . "Генбун (1736–1741)")
      (211 . "Кјохо (1716–1736)") (210 . "Шотоку (1711–1716)")
      (209 . "Хоеи (1704–1711)") (208 . "Генроку (1688–1704)")
      (207 . "Јокјо (1684–1688)") (206 . "Тенва (1681–1684)")
      (205 . "Енпо (1673–1681)") (204 . "Канбун (1661–1673)")
      (203 . "Мањи (1658–1661)") (202 . "Меирјаку (1655–1658)")
      (201 . "Шу (1652–1655)") (200 . "Кеиан (1648–1652)")
      (199 . "Шохо (1644–1648)") (198 . "Кан-еи (1624-1644)")
      (197 . "Генва (1615–1624)") (196 . "Кеичо (1596–1615)")
      (195 . "Бунроку (1592–1596)") (194 . "Теншо (1573–1592)")
      (193 . "Генки (1570–1573)") (192 . "Еироку (1558–1570)")
      (191 . "Кођи (1555–1558)") (190 . "Тенмон (1532–1555)")
      (189 . "Кјороку (1528–1532)") (188 . "Таиеи (1521–1528)")
      (187 . "Еишо (1504–1521)") (186 . "Бунки (1501–1504)")
      (185 . "Меио (1492–1501)") (184 . "Ентоку (1489–1492)")
      (183 . "Чокјо (1487–1489)") (182 . "Бунмеи (1469–1487)")
      (181 . "Онин (1467–1469)") (180 . "Буншо (1466–1467)")
      (179 . "Каншо (1460–1466)") (178 . "Чороку (1457–1460)")
      (177 . "Кошо (1455–1457)") (176 . "Кјотоку (1452–1455)")
      (175 . "Хотоку (1449–1452)") (174 . "Бун-ан (1444-1449)")
      (173 . "Какитсу (1441–1444)") (172 . "Еикјо (1429–1441)")
      (171 . "Шочо (1428–1429)") (170 . "Оеи (1394–1428)")
      (169 . "Меитоку (1390–1394)") (168 . "Ку (1389–1390)")
      (167 . "Какеи (1387–1389)") (166 . "Меитоку (1384–1387)")
      (165 . "Генчу (1384–1392)") (164 . "Кова (1381–1384)")
      (163 . "Корјаку (1379–1381)") (162 . "Тењу (1375–1379)")
      (161 . "Бучу (1372–1375)") (160 . "Кентоку (1370–1372)")
      (159 . "Шохеи (1346–1370)") (158 . "Кококу (1340–1346)")
      (157 . "Енген (1336–1340)") (156 . "Кему (1334–1336)")
      (155 . "Генко (1331–1334)") (154 . "Гентоку (1329–1331)")
      (153 . "Кареки (1326–1329)") (152 . "Шочу (1324–1326)")
      (151 . "Ђенкјо (1321–1324)") (150 . "Ђено (1319–1321)")
      (149 . "Бунпо (1317–1319)") (148 . "Шова (1312–1317)")
      (147 . "Очо (1311–1312)") (146 . "Енкеи (1308–1311)")
      (145 . "Токуђи (1306–1308)") (144 . "Каген (1303–1306)")
      (143 . "Кенген (1302–1303)") (142 . "Шоан (1299–1302)")
      (141 . "Еинин (1293–1299)") (140 . "Шу (1288–1293)")
      (139 . "Коан (1278–1288)") (138 . "Кенђи (1275–1278)")
      (137 . "Бун-еи (1264-1275)") (136 . "Кочо (1261–1264)")
      (135 . "Бун-о (1260-1261)") (134 . "Шоген (1259–1260)")
      (133 . "Шока (1257–1259)") (132 . "Коген (1256–1257)")
      (131 . "Кенчо (1249–1256)") (130 . "Хођи (1247–1249)")
      (129 . "Канген (1243–1247)") (128 . "Нињи (1240–1243)")
      (127 . "Ен-о (1239-1240)") (126 . "Рјакунин (1238–1239)")
      (125 . "Катеи (1235–1238)") (124 . "Бунрјаку (1234–1235)")
      (123 . "Темпуку (1233–1234)") (122 . "Ђоеи (1232–1233)")
      (121 . "Канки (1229–1232)") (120 . "Антеи (1227–1229)")
      (119 . "Кароку (1225–1227)") (118 . "Ђенин (1224–1225)")
      (117 . "Ђу (1222–1224)") (116 . "Шокју (1219–1222)")
      (115 . "Кенпо (1213–1219)") (114 . "Кенрјаку (1211–1213)")
      (113 . "Шоген (1207–1211)") (112 . "Кен-еи (1206-1207)")
      (111 . "Генкју (1204–1206)") (110 . "Кенин (1201–1204)")
      (109 . "Шођи (1199–1201)") (108 . "Кенкју (1190–1199)")
      (107 . "Бунђи (1185–1190)") (106 . "Генрјуку (1184–1185)")
      (105 . "Ђуеи (1182–1184)") (104 . "Јова (1181–1182)")
      (103 . "Ђишо (1177–1181)") (102 . "Анген (1175–1177)")
      (101 . "Шоан (1171–1175)") (100 . "Као (1169–1171)")
      (99 . "Нин-ан (1166-1169)") (98 . "Еиман (1165–1166)")
      (97 . "Чокан (1163–1165)") (96 . "Охо (1161–1163)")
      (95 . "Еирјаку (1160–1161)") (94 . "Хеиђи (1159–1160)")
      (93 . "Хоген (1156–1159)") (92 . "Кјују (1154–1156)")
      (91 . "Нинпеи (1151–1154)") (90 . "Кјуан (1145–1151)")
      (89 . "Тењо (1144–1145)") (88 . "Кођи (1142–1144)")
      (87 . "Еиђи (1141–1142)") (86 . "Хоен (1135–1141)")
      (85 . "Чошао (1132–1135)") (84 . "Теншо (1131–1132)")
      (83 . "Даиђи (1126–1131)") (82 . "Тенђи (1124–1126)")
      (81 . "Хоан (1120–1124)") (80 . "Ђен-еи (1118-1120)")
      (79 . "Еикју (1113–1118)") (78 . "Тен-еи (1110-1113)")
      (77 . "Тенин (1108–1110)") (76 . "Кашо (1106–1108)")
      (75 . "Чођи (1104–1106)") (74 . "Кова (1099–1104)")
      (73 . "Шотоку (1097–1099)") (72 . "Еичо (1096–1097)")
      (71 . "Кахо (1094–1096)") (70 . "Канђи (1087–1094)")
      (69 . "Отоку (1084–1087)") (68 . "Еишо (1081–1084)")
      (67 . "Шорјаку (1077–1081)") (66 . "Шохо (1074–1077)")
      (65 . "Енкју (1069–1074)") (64 . "Ђирјаку (1065–1069)")
      (63 . "Кохеи (1058–1065)") (62 . "Тенђи (1053–1058)")
      (61 . "Еишо (1046–1053)") (60 . "Кантоку (1044–1046)")
      (59 . "Чокју (1040–1044)") (58 . "Чорјаку (1037–1040)")
      (57 . "Чоген (1028–1037)") (56 . "Мању (1024–1028)")
      (55 . "Ђиан (1021–1024)") (54 . "Канин (1017–1021)")
      (53 . "Чова (1012–1017)") (52 . "Канко (1004–1012)")
      (51 . "Чохо (999–1004)") (50 . "Чотоку (995–999)")
      (49 . "Шорјаку (990–995)") (48 . "Еисо (989–990)")
      (47 . "Еи-ен (987-989)") (46 . "Кана (985–987)") (45 . "Еикан (983–985)")
      (44 . "Тенген (978–983)") (43 . "Јоген (976–978)")
      (42 . "Тен-ен (973-976)") (41 . "Тенроку (970–973)")
      (40 . "Ана (968–970)") (39 . "Кохо (964–968)") (38 . "Ова (961–964)")
      (37 . "Тентоку (957–961)") (36 . "Тенриаку (947–957)")
      (35 . "Тенгјо (938–947)") (34 . "Шохеи (931–938)")
      (33 . "Енчо (923–931)") (32 . "Енђи (901–923)") (31 . "Шотаи (898–901)")
      (30 . "Кампјо (889–898)") (29 . "Ниња (885–889)")
      (28 . "Генкеи (877–885)") (27 . "Јоган (859–877)")
      (26 . "Тенан (857–859)") (25 . "Саико (854–857)") (24 . "Нињу (851–854)")
      (23 . "Кајо (848–851)") (22 . "Шова (834–848)") (21 . "Тенчо (824–834)")
      (20 . "Конин (810–824)") (19 . "Даидо (806–810)")
      (18 . "Енрјаку (782–806)") (17 . "Тен-о (781-782)")
      (16 . "Хоки (770–780)") (15 . "Ђинго-кеиун (767-770)")
      (14 . "Темпо-ђинго (765-767)") (13 . "Темпио-хођи (757-765)")
      (12 . "Темпио-шохо (749-757)") (11 . "Темпио-кампо (749-749)")
      (10 . "Темпио (729–749)") (9 . "Јинки (724–729)") (8 . "Јоро (717–724)")
      (7 . "Реики (715–717)") (6 . "Вадо (708–715)") (5 . "Кеиун (704–708)")
      (4 . "Таихо (701–704)") (3 . "Шучо (686–701)") (2 . "Хакухо (672–686)")
      (1 . "Хакучи (650–671)") (0 . "Таика (645–650)"))))
   (DATE-FORMATS (SHORT (PATTERN . "M/d/yy G"))
    (MEDIUM (PATTERN . "MMM d, y G")) (LONG (PATTERN . "MMMM d, y G"))
    (FULL (PATTERN . "EEEE, MMMM d, y G"))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "Зул-хиџе") (11 . "Зул-каде") (10 . "Шевал")
       (9 . "Рамазан") (8 . "Шаʻбан") (7 . "Реџеб") (6 . "Џумаде 2")
       (5 . "Џумаде 1") (4 . "Реби 2") (3 . "Реби 1") (2 . "Сафер")
       (1 . "Мухарем"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Дуʻл-хиђа") (11 . "Дуʻл-Киʻда") (10 . "Шавал")
       (9 . "Рамадан") (8 . "Шаʻбан") (7 . "Рађаб") (6 . "Јумада II")
       (5 . "Јумада I") (4 . "Рабиʻ II") (3 . "Рабиʻ I") (2 . "Сафар")
       (1 . "Мухарем")))
     (ABBREVIATED
      (DEFAULT (12 . "Зул-х.") (11 . "Зул-к.") (10 . "Ше.") (9 . "Рам.")
       (8 . "Ша.") (7 . "Реџ.") (6 . "Џум. 2") (5 . "Џум. 1") (4 . "Реб. 2")
       (3 . "Реб. 1") (2 . "Саф.") (1 . "Мух.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "АХ")))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "Фалгуна") (11 . "Мага") (10 . "Пауза") (9 . "Аргајана")
       (8 . "Картика") (7 . "Асвина") (6 . "Бадра") (5 . "Сравана")
       (4 . "Асада") (3 . "Јиаиста") (2 . "Ваисака") (1 . "Чаитра")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "САКА")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "Елул") (12 . "Ав") (11 . "Тамуз") (10 . "Сиван")
       (9 . "Ијар") (8 . "Нисан") (7 . "Адар II") (7 . "Адар") (6 . "Адар I")
       (5 . "Шеват") (4 . "Тевет") (3 . "Кислев") (2 . "Хешван")
       (1 . "Тишри"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "д") (11 . "н") (10 . "о") (9 . "с") (8 . "а") (7 . "ј")
       (6 . "ј") (5 . "м") (4 . "а") (3 . "м") (2 . "ф") (1 . "ј"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "децембар") (11 . "новембар") (10 . "октобар")
       (9 . "септембар") (8 . "август") (7 . "јул") (6 . "јун") (5 . "мај")
       (4 . "април") (3 . "март") (2 . "фебруар") (1 . "јануар")))
     (ABBREVIATED
      (DEFAULT (12 . "дец") (11 . "нов") (10 . "окт") (9 . "сеп") (8 . "авг")
       (7 . "јул") (6 . "јун") (5 . "мај") (4 . "апр") (3 . "мар") (2 . "феб")
       (1 . "јан")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "с") (FRI . "п") (THU . "ч") (WED . "с") (TUE . "у")
       (MON . "п") (SUN . "н"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "субота") (FRI . "петак") (THU . "четвртак")
       (WED . "среда") (TUE . "уторак") (MON . "понедељак") (SUN . "недеља")))
     (SHORT
      (DEFAULT (SAT . "су") (FRI . "пе") (THU . "че") (WED . "ср") (TUE . "ут")
       (MON . "по") (SUN . "не")))
     (ABBREVIATED
      (DEFAULT (SAT . "суб") (FRI . "пет") (THU . "чет") (WED . "сре")
       (TUE . "уто") (MON . "пон") (SUN . "нед")))))
   (QUARTERS
    (STAND-ALONE
     (NARROW (DEFAULT (4 . "4.") (3 . "3.") (2 . "2.") (1 . "1."))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "четврти квартал") (3 . "трећи квартал")
       (2 . "други квартал") (1 . "први квартал")))
     (ABBREVIATED
      (DEFAULT (4 . "4. кв.") (3 . "3. кв.") (2 . "2. кв.") (1 . "1. кв.")))))
   (DAY-PERIODS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ноћ") (EVENING1 . "вече") (AFTERNOON1 . "поподне")
       (MORNING1 . "јутро"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "ноћу") (EVENING1 . "увече") (AFTERNOON1 . "по подне")
       (MORNING1 . "ујутру") (NOON . "подне") (MIDNIGHT . "поноћ")))
     (NARROW
      (DEFAULT (NIGHT1 . "ноћу") (EVENING1 . "увече") (AFTERNOON1 . "по подне")
       (MORNING1 . "ујутру") (NOON . "подне") (MIDNIGHT . "поноћ")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ноћу") (EVENING1 . "увече") (AFTERNOON1 . "по подне")
       (MORNING1 . "ујутру") (NOON . "подне") (MIDNIGHT . "поноћ")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "н. е.") (0 . "п. н. е.")))
    (NARROW (DEFAULT (1 . "н.е.") (0 . "п.н.е.")))
    (WIDE (VARIANT (1 . "наше ере") (0 . "пре наше ере"))
     (DEFAULT (1 . "нове ере") (0 . "пре нове ере"))))
   (DATE-FORMATS (SHORT (PATTERN . "d. M. y.")) (MEDIUM (PATTERN . "d. M. y."))
    (LONG (PATTERN . "d. MMMM y.")) (FULL (PATTERN . "EEEE, d. MMMM y.")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "HH:mm:ss z")) (FULL (PATTERN . "HH:mm:ss zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d.M.y. GGGGG"))
    (MEDIUM (PATTERN . "d.MM.y. G")) (LONG (PATTERN . "d. MMMM y. G"))
    (FULL (PATTERN . "EEEE, d. MMMM y. G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "Пагумен") (12 . "Нехасе") (11 . "Хамле") (10 . "Сене")
       (9 . "Генбот") (8 . "Миазиа") (7 . "Мегабит") (6 . "Јекатит")
       (5 . "Тер") (4 . "Тахсас") (3 . "Хедар") (2 . "Текемт")
       (1 . "Мескерем"))))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "Наси") (12 . "Месра") (11 . "Епеп") (10 . "Паона")
       (9 . "Башанс") (8 . "Барамуда") (7 . "Барамхат") (6 . "Амшир")
       (5 . "Тоба") (4 . "Киахк") (3 . "Хатор") (2 . "Баба") (1 . "Таут"))))))
  (BUDDHIST (ERAS (ABBREVIATED (DEFAULT (0 . "БЕ")))))))
