((LANGUAGE . "ta")
 (CALENDARS
  (ROC
   (ERAS (ABBREVIATED (DEFAULT (0 . "ROCக்கு முன்")))
    (WIDE (DEFAULT (0 . "R.O.C. -க்கு முன்பு")))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "எஃபான்") (11 . "பஹ்மான்") (10 . "தே") (9 . "அசார்")
       (8 . "அபான்") (7 . "மெஹ்ர்") (6 . "ஷாரிவார்") (5 . "மொர்தாத்")
       (4 . "திர்") (3 . "கொர்தாத்") (2 . "ஆர்டிபெஹெஷ்த்") (1 . "ஃபர்வாதின்")))
     (ABBREVIATED
      (DEFAULT (12 . "எஃ.") (11 . "பஹ்.") (10 . "தே") (9 . "அசா.") (8 . "அபா.")
       (7 . "மெஹ்.") (6 . "ஷாரி.") (5 . "மொர்.") (4 . "திர்") (3 . "கொர்.")
       (2 . "ஆர்டி.") (1 . "ஃபர்."))))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "துல் ஹிஜ்ஜா") (11 . "துல் கஃதா") (10 . "ஷவ்வால்")
       (9 . "ரமலான்") (8 . "ஷஃபான்") (7 . "ரஜப்") (6 . "ஜுமதா 2")
       (5 . "ஜுமதா 1") (4 . "ரபி 2") (3 . "ரபி 1") (2 . "சஃபர்")
       (1 . "முஹர்ரம்")))
     (ABBREVIATED
      (DEFAULT (12 . "துல் ஹிஜ்.") (11 . "துல் கஃ.") (10 . "ஷவ்.") (9 . "ரம.")
       (8 . "ஷஃ.") (7 . "ரஜ.") (6 . "ஜும. 2") (5 . "ஜும. 1") (4 . "ரபி 2")
       (3 . "ரபி 1") (2 . "சஃப.") (1 . "முஹ."))))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "பங்குனி") (11 . "மாசி") (10 . "தை") (9 . "மார்கழி")
       (8 . "கார்த்திகை") (7 . "ஐப்பசி") (6 . "புரட்டாசி") (5 . "ஆவணி")
       (4 . "ஆடி") (3 . "ஆனி") (2 . "வைகாசி") (1 . "சித்திரை")))
     (ABBREVIATED
      (DEFAULT (12 . "பங்.") (11 . "மாசி") (10 . "தை") (9 . "மார்.")
       (8 . "கார்.") (7 . "ஐப்.") (6 . "புர.") (5 . "ஆவ.") (4 . "ஆடி")
       (3 . "ஆனி") (2 . "வைகா.") (1 . "சித்.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "சாகா")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "எலுல்") (12 . "அவ்") (11 . "தமுஸ்") (10 . "சிவான்")
       (9 . "ஐயார்") (8 . "நிசான்") (7 . "அடார் 2") (7 . "அடார்")
       (6 . "அடார் 1") (5 . "ஷெவாட்") (4 . "டெவெட்") (3 . "கிஸ்லெவ்")
       (2 . "ஹெஷ்வான்") (1 . "டிஷ்ரி")))
     (ABBREVIATED
      (DEFAULT (13 . "எலு.") (12 . "அவ்") (11 . "தமு.") (10 . "சிவா.")
       (9 . "ஐயா.") (8 . "நிசா.") (7 . "அடா. 2") (7 . "அடா.") (6 . "அடா. 1")
       (5 . "ஷெவா.") (4 . "டெவெ.") (3 . "கிஸ்.") (2 . "ஹெஷ்.")
       (1 . "டிஷ்."))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "டி") (11 . "ந") (10 . "அ") (9 . "செ") (8 . "ஆ")
       (7 . "ஜூ") (6 . "ஜூ") (5 . "மே") (4 . "ஏ") (3 . "மா") (2 . "பி")
       (1 . "ஜ"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "டிசம்பர்") (11 . "நவம்பர்") (10 . "அக்டோபர்")
       (9 . "செப்டம்பர்") (8 . "ஆகஸ்ட்") (7 . "ஜூலை") (6 . "ஜூன்") (5 . "மே")
       (4 . "ஏப்ரல்") (3 . "மார்ச்") (2 . "பிப்ரவரி") (1 . "ஜனவரி")))
     (ABBREVIATED
      (DEFAULT (12 . "டிச.") (11 . "நவ.") (10 . "அக்.") (9 . "செப்.")
       (8 . "ஆக.") (7 . "ஜூலை") (6 . "ஜூன்") (5 . "மே") (4 . "ஏப்.")
       (3 . "மார்.") (2 . "பிப்.") (1 . "ஜன.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "ச") (FRI . "வெ") (THU . "வி") (WED . "பு") (TUE . "செ")
       (MON . "தி") (SUN . "ஞா"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "சனி") (FRI . "வெள்ளி") (THU . "வியாழன்") (WED . "புதன்")
       (TUE . "செவ்வாய்") (MON . "திங்கள்") (SUN . "ஞாயிறு")))
     (SHORT
      (DEFAULT (SAT . "ச") (FRI . "வெ") (THU . "வி") (WED . "பு") (TUE . "செ")
       (MON . "தி") (SUN . "ஞா")))
     (ABBREVIATED
      (DEFAULT (SAT . "சனி") (FRI . "வெள்.") (THU . "வியா.") (WED . "புத.")
       (TUE . "செவ்.") (MON . "திங்.") (SUN . "ஞாயி.")))))
   (QUARTERS
    (STAND-ALONE
     (WIDE
      (DEFAULT (4 . "நான்காம் காலாண்டு") (3 . "மூன்றாம் காலாண்டு")
       (2 . "இரண்டாம் காலாண்டு") (1 . "முதல் காலாண்டு")))
     (ABBREVIATED
      (DEFAULT (4 . "கா.4") (3 . "கா.3") (2 . "கா.2") (1 . "கா.1"))))
    (FORMAT
     (WIDE
      (DEFAULT (4 . "நான்காம் காலாண்டு") (3 . "மூன்றாம் காலாண்டு")
       (2 . "இரண்டாம் காலாண்டு") (1 . "முதல் காலாண்டு")))
     (ABBREVIATED
      (DEFAULT (4 . "கா.4") (3 . "கா.3") (2 . "கா.2") (1 . "கா.1")))))
   (DAY-PERIODS
    (STAND-ALONE
     (NARROW
      (DEFAULT (NIGHT1 . "இ.") (EVENING2 . "அந்தி மா.") (EVENING1 . "மா.")
       (AFTERNOON2 . "பிற்.") (AFTERNOON1 . "மதி.") (MORNING2 . "கா.")
       (MORNING1 . "அதி.") (NOON . "நண்.") (MIDNIGHT . "நள்."))))
    (FORMAT
     (NARROW
      (DEFAULT (NIGHT1 . "இர.") (EVENING2 . "அந்தி மா.") (EVENING1 . "மா.")
       (AFTERNOON2 . "பிற்.") (AFTERNOON1 . "மதி.") (MORNING2 . "கா.")
       (MORNING1 . "அதி.") (NOON . "நண்.") (MIDNIGHT . "நள்.")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "இரவு") (EVENING2 . "அந்தி மாலை") (EVENING1 . "மாலை")
       (AFTERNOON2 . "பிற்பகல்") (AFTERNOON1 . "மதியம்") (MORNING2 . "காலை")
       (MORNING1 . "அதிகாலை") (NOON . "நண்பகல்") (MIDNIGHT . "நள்ளிரவு")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "பொ.ச") (0 . "பொ.ச.மு"))
     (DEFAULT (1 . "கி.பி.") (0 . "கி.மு.")))
    (WIDE (DEFAULT (1 . "அன்னோ டோமினி") (0 . "கிறிஸ்துவுக்கு முன்"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "d MMM, y"))
    (LONG (PATTERN . "d MMMM, y")) (FULL (PATTERN . "EEEE, d MMMM, y")))
   (TIME-FORMATS (SHORT (PATTERN . "h:mm a")) (MEDIUM (PATTERN . "h:mm:ss a"))
    (LONG (PATTERN . "h:mm:ss a z")) (FULL (PATTERN . "h:mm:ss a zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y GGGGG"))
    (MEDIUM (PATTERN . "d MMM, y G")) (LONG (PATTERN . "d MMMM, y G"))
    (FULL (PATTERN . "EEEE, d MMMM, y G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "பாகுமே") (12 . "நஹாசே") (11 . "ஹமேல்") (10 . "சனே")
       (9 . "கென்போ") (8 . "மியாஸ்யா") (7 . "மகாபிட்") (6 . "யாகாடிட்")
       (5 . "தெர்") (4 . "தஹ்சாஸ்") (3 . "ஹெதர்") (2 . "தெகெம்ப்த்")
       (1 . "மஸ்கரம்")))
     (ABBREVIATED
      (DEFAULT (13 . "பாகு.") (12 . "நஹா.") (11 . "ஹமே.") (10 . "சனே")
       (9 . "கென்.") (8 . "மியா.") (7 . "மகா.") (6 . "யாகா.") (5 . "தெர்")
       (4 . "தஹ்.") (3 . "ஹெத.") (2 . "தெகெ.") (1 . "மஸ்."))))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (13 . "நசி") (12 . "மஸ்ரா") (11 . "அபீ.") (10 . "பவு.")
       (9 . "பாஷ.") (8 . "பரமு.") (7 . "பரம்.") (6 . "அம்.") (5 . "டுபா")
       (4 . "கியா.") (3 . "ஹடு.") (2 . "பாபா") (1 . "டட்"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "நசி") (12 . "மஸ்ரா") (11 . "அபீப்") (10 . "பவுனா")
       (9 . "பாஷன்ஸ்") (8 . "பரமுதா") (7 . "பரம்ஹாட்") (6 . "அம்ஷீர்")
       (5 . "டுபா") (4 . "கியாக்") (3 . "ஹடுர்") (2 . "பாபா") (1 . "டட்")))
     (ABBREVIATED
      (DEFAULT (13 . "நசி") (12 . "மஸ்.") (11 . "அபீ.") (10 . "பவு.")
       (9 . "பாஷ.") (8 . "பரமு.") (7 . "பரம்.") (6 . "அம்.") (5 . "டுபா")
       (4 . "கியா.") (3 . "ஹடு.") (2 . "பாபா") (1 . "டட்"))))))
  (CHINESE
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "மாதம்12") (11 . "மாதம்11") (10 . "மாதம்10")
       (9 . "மாதம்9") (8 . "மாதம்8") (7 . "மாதம்7") (6 . "மாதம்6")
       (5 . "மாதம்5") (4 . "மாதம்4") (3 . "மாதம்3") (2 . "மாதம்2")
       (1 . "மாதம்1")))
     (ABBREVIATED
      (DEFAULT (12 . "மா12") (11 . "மா11") (10 . "மா10") (9 . "மா9")
       (8 . "மா8") (7 . "மா7") (6 . "மா6") (5 . "மா5") (4 . "மா4") (3 . "மா3")
       (2 . "மா2") (1 . "மா1")))))
   (DATE-FORMATS (SHORT (PATTERN . "dd-MM-y")) (MEDIUM (PATTERN . "U, d MMM"))
    (LONG (PATTERN . "U, d MMMM")) (FULL (PATTERN . "U MMMM d, EEEE"))))))
