((LANGUAGE . "th")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "ไต้หวัน") (0 . "ปีก่อนไต้หวัน"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y G")) (MEDIUM (PATTERN . "d MMM G y"))
    (LONG (PATTERN . "d MMMM ปีG y"))
    (FULL (PATTERN . "EEEEที่ d MMMM ปีGที่ y"))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "เอสฟานด์") (11 . "บาฮ์มาน") (10 . "เดย์") (9 . "อะซาร์")
       (8 . "อะบาน") (7 . "เมฮร์") (6 . "ชาหริวาร์") (5 . "มอร์แดด")
       (4 . "เตอร์") (3 . "คอร์แดด") (2 . "ออร์ดิเบเฮชต์")
       (1 . "ฟาร์วาร์ดิน")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ปีเปอร์เซีย")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "เรวะ") (235 . "เฮเซ") (234 . "โชวะ") (233 . "ทะอิโช")
      (232 . "เมจิ") (231 . "เคโอ (1865–1868)") (230 . "เก็นจิ (1864–1865)")
      (229 . "บุงกีว (1861–1864)") (228 . "มันเอ็ง (1860–1861)")
      (227 . "อันเซ (1854–1860)") (226 . "คะเอ (1848–1854)")
      (225 . "โคกะ (1844–1848)") (224 . "เท็มโป (1830–1844)")
      (223 . "บุนเซ (1818–1830)") (222 . "บุงกะ (1804–1818)")
      (221 . "เคียววะ (1801–1804)") (220 . "คันเซ (1789–1801)")
      (219 . "เท็มเม (1781–1789)") (218 . "อันเอ (1772–1781)")
      (217 . "เมวะ (1764–1772)") (216 . "โฮเรียะกุ (1751–1764)")
      (215 . "คันเอ็ง (1748–1751)") (214 . "เอ็งเกียว (1744–1748)")
      (213 . "คัมโป (1741–1744)") (212 . "เก็มบุง (1736–1741)")
      (211 . "เคียวโฮ (1716–1736)") (210 . "โชโตะกุ (1711–1716)")
      (209 . "โฮเอ (1704–1711)") (208 . "เก็นโระกุ (1688–1704)")
      (207 . "โจเกียว (1684–1688)") (206 . "เท็นวะ (1681–1684)")
      (205 . "เอ็มโป (1673–1681)") (204 . "คัมบุง (1661–1673)")
      (203 . "มันจิ (1658–1661)") (202 . "เมเรียะกุ (1655–1658)")
      (201 . "โชโอ (1652–1655)") (200 . "เคอัง (1648–1652)")
      (199 . "โชโฮ (1644–1648)") (198 . "คันเอ (1624–1644)")
      (197 . "เก็งวะ (1615–1624)") (196 . "เคโช (1596–1615)")
      (195 . "บุนโระกุ (1592–1596)") (194 . "เท็นโช (1573–1592)")
      (193 . "เก็งกิ (1570–1573)") (192 . "เอโระกุ (1558–1570)")
      (191 . "โคจิ (1555–1558)") (190 . "เท็มมน (1532–1555)")
      (189 . "เคียวโระกุ (1528–1532)") (188 . "ทะอิเอ (1521–1528)")
      (187 . "เอโช (1504–1521)") (186 . "บุงกิ (1501–1504)")
      (185 . "เมโอ (1492–1501)") (184 . "เอ็นโตะกุ (1489–1492)")
      (183 . "โชเกียว (1487–1489)") (182 . "บุมเม (1469–1487)")
      (181 . "โอนิง (1467–1469)") (180 . "บุนโช (1466–1467)")
      (179 . "คันโช (1460–1466)") (178 . "โชโระกุ (1457–1460)")
      (177 . "โคโช (1455–1457)") (176 . "เคียวโตะกุ (1452–1455)")
      (175 . "โฮโตะกุ (1449–1452)") (174 . "บุนอัง (1444–1449)")
      (173 . "คะกิสึ (1441–1444)") (172 . "เอเกียว (1429–1441)")
      (171 . "โชโช (1428–1429)") (170 . "โอเอ (1394–1428)")
      (169 . "เมโตะกุ (1390–1394)") (168 . "โคโอ (1389–1390)")
      (167 . "คะเค (1387–1389)") (166 . "เมโตะกุ (1384–1387)")
      (165 . "เก็นชู (1384–1392)") (164 . "โควะ (1381–1384)")
      (163 . "โคเรียะกุ (1379–1381)") (162 . "เท็นจุ (1375–1379)")
      (161 . "บุนชู (1372–1375)") (160 . "เค็นโตะกุ (1370–1372)")
      (159 . "โชเฮ (1346–1370)") (158 . "โคโกะกุ (1340–1346)")
      (157 . "เอ็งเง็ง (1336–1340)") (156 . "เค็มมุ (1334–1336)")
      (155 . "เก็งโก (1331–1334)") (154 . "เก็นโตะกุ (1329–1331)")
      (153 . "คะเระกิ (1326–1329)") (152 . "โชชู (1324–1326)")
      (151 . "เก็งเกียว (1321–1324)") (150 . "เก็นโอ (1319–1321)")
      (149 . "บุมโป (1317–1319)") (148 . "โชวะ (1312–1317)")
      (147 . "โอโช (1311–1312)") (146 . "เอ็งเก (1308–1311)")
      (145 . "โทะกุจิ (1306–1308)") (144 . "คะเง็ง (1303–1306)")
      (143 . "เค็งเง็ง (1302–1303)") (142 . "โชอัง (1299–1302)")
      (141 . "เอนิง (1293–1299)") (140 . "โชโอ (1288–1293)")
      (139 . "โคอัง (1278–1288)") (138 . "เค็นจิ (1275–1278)")
      (137 . "บุนเอ (1264–1275)") (136 . "โคโช (1261–1264)")
      (135 . "บุนโอ (1260–1261)") (134 . "โชเง็ง (1259–1260)")
      (133 . "โชกะ (1257–1259)") (132 . "โคเง็ง (1256–1257)")
      (131 . "เค็นโช (1249–1256)") (130 . "โฮจิ (1247–1249)")
      (129 . "คังเง็ง (1243–1247)") (128 . "นินจิ (1240–1243)")
      (127 . "เอ็นโอ (1239–1240)") (126 . "เรียะกุนิง (1238–1239)")
      (125 . "คะเต (1235–1238)") (124 . "บุนเรียะกุ (1234–1235)")
      (123 . "เท็มปุกุ (1233–1234)") (122 . "โจเอ (1232–1233)")
      (121 . "คังกิ (1229–1232)") (120 . "อันเต (1227–1229)")
      (119 . "คะโระกุ (1225–1227)") (118 . "เก็นนิง (1224–1225)")
      (117 . "โจโอ (1222–1224)") (116 . "โชกีว (1219–1222)")
      (115 . "เค็มโป (1213–1219)") (114 . "เค็นเรียะกุ (1211–1213)")
      (113 . "โชเก็ง (1207–1211)") (112 . "เค็นเอ (1206–1207)")
      (111 . "เก็งกีว (1204–1206)") (110 . "เค็นนิง (1201–1204)")
      (109 . "โชจิ (1199–1201)") (108 . "เค็งกีว (1190–1199)")
      (107 . "บุนจิ (1185–1190)") (106 . "เก็นเรียะกุ (1184–1185)")
      (105 . "จุเอ (1182–1184)") (104 . "โยวะ (1181–1182)")
      (103 . "จิโช (1177–1181)") (102 . "อังเง็ง (1175–1177)")
      (101 . "โชอัง (1171–1175)") (100 . "คะโอ (1169–1171)")
      (99 . "นินอัง (1166–1169)") (98 . "เอมัง (1165–1166)")
      (97 . "โชกัง (1163–1165)") (96 . "โอโฮ (1161–1163)")
      (95 . "เอเรียะกุ (1160–1161)") (94 . "เฮจิ (1159–1160)")
      (93 . "โฮะเง็ง (1156–1159)") (92 . "คีวจุ (1154–1156)")
      (91 . "นิมเป (1151–1154)") (90 . "คีวอัง (1145–1151)")
      (89 . "เท็นโย (1144–1145)") (88 . "โคจิ (1142–1144)")
      (87 . "เอจิ (1141–1142)") (86 . "โฮะเอ็ง (1135–1141)")
      (85 . "โชโช (1132–1135)") (84 . "เท็นโช (1131–1132)")
      (83 . "ดะอิจิ (1126–1131)") (82 . "เท็นจิ (1124–1126)")
      (81 . "โฮะอัง (1120–1124)") (80 . "เก็นเอ (1118–1120)")
      (79 . "เอกีว (1113–1118)") (78 . "เท็นเอ (1110–1113)")
      (77 . "เท็นนิง (1108–1110)") (76 . "คะโช (1106–1108)")
      (75 . "โชจิ (1104–1106)") (74 . "โควะ (1099–1104)")
      (73 . "โชโตะกุ (1097–1099)") (72 . "เอโช (1096–1097)")
      (71 . "คะโฮะ (1094–1096)") (70 . "คันจิ (1087–1094)")
      (69 . "โอโตะกุ (1084–1087)") (68 . "เอโฮะ (1081–1084)")
      (67 . "โชเรียะกุ (1077–1081)") (66 . "โชโฮ (1074–1077)")
      (65 . "เอ็งคีว (1069–1074)") (64 . "จิเรียะกุ (1065–1069)")
      (63 . "โคเฮ (1058–1065)") (62 . "เท็งงิ (1053–1058)")
      (61 . "เอโช (1046–1053)") (60 . "คันโตะกุ (1044–1046)")
      (59 . "โชคีว (1040–1044)") (58 . "โชเรียะกุ (1037–1040)")
      (57 . "โชเง็ง (1028–1037)") (56 . "มันจุ (1024–1028)")
      (55 . "จิอัง (1021–1024)") (54 . "คันนิง (1017–1021)")
      (53 . "โชวะ (1012–1017)") (52 . "คันโก (1004–1012)")
      (51 . "โชโฮ (999–1004)") (50 . "โชโตะกุ (995–999)")
      (49 . "โชเรียะกุ (990–995)") (48 . "เอโซ (989–990)")
      (47 . "เอเอ็ง (987–989)") (46 . "คันนะ (985–987)")
      (45 . "เอกัง (983–985)") (44 . "เท็งเง็ง (978–983)")
      (43 . "โจเง็ง (976–978)") (42 . "เท็นเอ็ง (973–976)")
      (41 . "เท็นโระกุ (970–973)") (40 . "อันนะ (968–970)")
      (39 . "โคโฮ (964–968)") (38 . "โอวะ (961–964)")
      (37 . "เท็นโตะกุ (957–961)") (36 . "เท็นเรียะกุ (947–957)")
      (35 . "เท็งเงียว (938–947)") (34 . "โชเฮ (931–938)")
      (33 . "เอ็นโช (923–931)") (32 . "เอ็งงิ (901–923)")
      (31 . "โชตะอิ (898–901)") (30 . "คัมเพียว (889–898)")
      (29 . "นินนะ (885–889)") (28 . "เก็งเก (877–885)")
      (27 . "โจงัง (859–877)") (26 . "เท็นนัง (857–859)")
      (25 . "ซะอิโกะ (854–857)") (24 . "นินจุ (851–854)")
      (23 . "คะโจ (848–851)") (22 . "โชวะ (834–848)") (21 . "เท็นโช (824–834)")
      (20 . "โคนิง (810–824)") (19 . "ดะอิโด (806–810)")
      (18 . "เอ็นเรียะกุ (782–806)") (17 . "เท็นโอ (781–782)")
      (16 . "โฮกิ (770–780)") (15 . "จิงโงะ-เคอุง (767-770)")
      (14 . "เท็มเพียว-จิงโงะ (765-767)") (13 . "เท็มเพียว-โฮจิ (757-765)")
      (12 . "เท็มเพียว-โชโฮ (749-757)") (11 . "เท็มเพียว-คัมโป (749-749)")
      (10 . "เท็มเพียว (729–749)") (9 . "จิงกิ (724–729)")
      (8 . "โยโร (717–724)") (7 . "เรกิ (715–717)") (6 . "วะโด (708–715)")
      (5 . "เคอุง (704–708)") (4 . "ทะอิโฮ (701–704)") (3 . "ชุโช (686–701)")
      (2 . "ฮากุโฮ (672–686)") (1 . "ฮะกุชิ (650–671)")
      (0 . "ทะอิกะ (645–650)"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy G"))
    (MEDIUM (PATTERN . "d MMM G y")) (LONG (PATTERN . "d MMMM ปีG y"))
    (FULL (PATTERN . "EEEEที่ d MMMM ปีGที่ y")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ซุลหิจญะฮฺ") (11 . "ซุลกิอฺดะฮฺ") (10 . "เชาวัล")
       (9 . "รอมะดอน") (8 . "ชะอะบาน") (7 . "รอจับ") (6 . "จุมาดา II")
       (5 . "จุมาดา I") (4 . "รอบี II") (3 . "รอบี I") (2 . "ซอฟาร์")
       (1 . "มุฮะร์รอม")))
     (ABBREVIATED
      (DEFAULT (12 . "ซุลหิจ.") (11 . "ซุลกิอฺ.") (10 . "เชาว.")
       (9 . "เราะมะ.") (8 . "ชะอ์.") (7 . "เราะ.") (6 . "จุมาดา II")
       (5 . "จุมาดา I") (4 . "รอบี II") (3 . "รอบี I") (2 . "เศาะ.")
       (1 . "มุฮัร.")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ฮ.ศ.")))
    (WIDE (DEFAULT (0 . "ฮิจเราะห์ศักราช")))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ผลคุณี") (11 . "มาฆะ") (10 . "ปุษยา") (9 . "มฤคศิรา")
       (8 . "การติกา") (7 . "อัศวิชา") (6 . "พัตรา") (5 . "ศรวณา")
       (4 . "อัษฎา") (3 . "เชษฐา") (2 . "วิสาขา") (1 . "จิตรา")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ม.ศ.")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "เอลอุล") (12 . "อัฟ") (11 . "ตามูซ") (10 . "สีวัน")
       (9 . "อิยาร์") (8 . "นิสซาน") (7 . "อาดาร์ II") (7 . "อาดาร์")
       (6 . "อาดาร์ I") (5 . "เชวัต") (4 . "เตเวต") (3 . "กีสเลฟ")
       (2 . "เฮวาน") (1 . "ทิชรี")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "ย.ศ.")))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "ธ.ค.") (11 . "พ.ย.") (10 . "ต.ค.") (9 . "ก.ย.")
       (8 . "ส.ค.") (7 . "ก.ค.") (6 . "มิ.ย.") (5 . "พ.ค.") (4 . "เม.ย.")
       (3 . "มี.ค.") (2 . "ก.พ.") (1 . "ม.ค."))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "ธันวาคม") (11 . "พฤศจิกายน") (10 . "ตุลาคม")
       (9 . "กันยายน") (8 . "สิงหาคม") (7 . "กรกฎาคม") (6 . "มิถุนายน")
       (5 . "พฤษภาคม") (4 . "เมษายน") (3 . "มีนาคม") (2 . "กุมภาพันธ์")
       (1 . "มกราคม")))
     (ABBREVIATED
      (DEFAULT (12 . "ธ.ค.") (11 . "พ.ย.") (10 . "ต.ค.") (9 . "ก.ย.")
       (8 . "ส.ค.") (7 . "ก.ค.") (6 . "มิ.ย.") (5 . "พ.ค.") (4 . "เม.ย.")
       (3 . "มี.ค.") (2 . "ก.พ.") (1 . "ม.ค.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "ส") (FRI . "ศ") (THU . "พฤ") (WED . "พ") (TUE . "อ")
       (MON . "จ") (SUN . "อา"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "วันเสาร์") (FRI . "วันศุกร์") (THU . "วันพฤหัสบดี")
       (WED . "วันพุธ") (TUE . "วันอังคาร") (MON . "วันจันทร์")
       (SUN . "วันอาทิตย์")))
     (ABBREVIATED
      (DEFAULT (SAT . "ส.") (FRI . "ศ.") (THU . "พฤ.") (WED . "พ.")
       (TUE . "อ.") (MON . "จ.") (SUN . "อา.")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "ไตรมาส 4") (3 . "ไตรมาส 3") (2 . "ไตรมาส 2")
       (1 . "ไตรมาส 1")))))
   (DAY-PERIODS
    (STAND-ALONE
     (WIDE
      (DEFAULT (NIGHT1 . "กลางคืน") (EVENING2 . "ค่ำ") (EVENING1 . "ในตอนเย็น")
       (AFTERNOON2 . "บ่าย") (AFTERNOON1 . "ในตอนบ่าย")
       (MORNING1 . "ในตอนเช้า")))
     (NARROW
      (DEFAULT (NIGHT1 . "กลางคืน") (EVENING2 . "ค่ำ") (EVENING1 . "เย็น")
       (AFTERNOON2 . "บ่าย") (AFTERNOON1 . "ช่วงเที่ยง") (MORNING1 . "เช้า")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "กลางคืน") (EVENING2 . "ค่ำ") (EVENING1 . "ตอนเย็น")
       (AFTERNOON2 . "บ่าย") (AFTERNOON1 . "ตอนบ่าย") (MORNING1 . "ตอนเช้า")
       (PM . "หลังเที่ยง") (AM . "ก่อนเที่ยง"))))
    (FORMAT (WIDE (DEFAULT (PM . "หลังเที่ยง") (AM . "ก่อนเที่ยง")))
            (NARROW
             (DEFAULT (NIGHT1 . "กลางคืน") (EVENING2 . "ค่ำ")
              (EVENING1 . "เย็น") (AFTERNOON2 . "บ่าย") (AFTERNOON1 . "เที่ยง")
              (MORNING1 . "เช้า") (PM . "p") (NOON . "เที่ยง") (AM . "a")
              (MIDNIGHT . "เที่ยงคืน")))
            (ABBREVIATED
             (DEFAULT (NIGHT1 . "กลางคืน") (EVENING2 . "ค่ำ")
              (EVENING1 . "ในตอนเย็น") (AFTERNOON2 . "บ่าย")
              (AFTERNOON1 . "ในตอนบ่าย") (MORNING1 . "ในตอนเช้า")
              (NOON . "เที่ยง") (MIDNIGHT . "เที่ยงคืน")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "ส.ศ.") (0 . "ก่อน ส.ศ."))
     (DEFAULT (1 . "ค.ศ.") (0 . "ก่อน ค.ศ.")))
    (NARROW (VARIANT (0 . "ก.ส.ศ.")))
    (WIDE (VARIANT (1 . "สามัญศักราช") (0 . "ก่อนสามัญศักราช"))
     (DEFAULT (1 . "คริสต์ศักราช") (0 . "ปีก่อนคริสตกาล"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "d MMM y"))
    (LONG (PATTERN . "d MMMM G y")) (FULL (PATTERN . "EEEEที่ d MMMM G y")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "H นาฬิกา mm นาที ss วินาที z"))
    (FULL (PATTERN . "H นาฬิกา mm นาที ss วินาที zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "d/M/y G")) (MEDIUM (PATTERN . "d MMM G y"))
    (LONG (PATTERN . "d MMMM G y")) (FULL (PATTERN . "EEEEที่ d MMMM G y")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "พากูเมน") (12 . "เนแฮซ") (11 . "ฮัมเล") (10 . "เซเน")
       (9 . "เจนบอต") (8 . "เมียเซีย") (7 . "เมกาบิต") (6 . "เยคาทิท")
       (5 . "เทอร์") (4 . "ทาฮ์ซัส") (3 . "เฮดาร์") (2 . "เตเกมท")
       (1 . "เมสเคอเรม"))))))
  (DANGI)
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "นาซี") (12 . "เมสรา") (11 . "อีเปป") (10 . "พาโอนา")
       (9 . "บาชันส์") (8 . "บาราเมาดา") (7 . "บารัมฮัท") (6 . "อัมเชอร์")
       (5 . "โทบา") (4 . "เคียฟ") (3 . "ฮาเทอร์") (2 . "บาบา")
       (1 . "เทาท์"))))))
  (CHINESE
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12") (11 . "11") (10 . "10") (9 . "9") (8 . "8")
       (7 . "7") (6 . "6") (5 . "5") (4 . "4") (3 . "3") (2 . "2")
       (1 . "1")))))
   (DATE-FORMATS (SHORT (PATTERN . "y-M-d")) (MEDIUM (PATTERN . "U MMM d"))
    (LONG (PATTERN . "U MMMM d")) (FULL (PATTERN . "EEEE, U MMMM d"))))
  (BUDDHIST
   (ERAS (ABBREVIATED (DEFAULT (0 . "พ.ศ.")))
    (WIDE (DEFAULT (0 . "พุทธศักราช"))))
   (DATE-FORMATS (SHORT (PATTERN . "d/M/yy")) (MEDIUM (PATTERN . "d MMM y"))
    (LONG (PATTERN . "d MMMM y")) (FULL (PATTERN . "EEEEที่ d MMMM G y"))))))
