((LANGUAGE . "uk")
 (CALENDARS
  (PERSIAN
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "есф") (11 . "бах") (10 . "дей") (9 . "азер") (8 . "абан")
       (7 . "мех") (6 . "шах") (5 . "мор") (4 . "тір") (3 . "хор") (2 . "орд")
       (1 . "фар"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "есфанд") (11 . "бахман") (10 . "дей") (9 . "азер")
       (8 . "абан") (7 . "мехр") (6 . "шахрівер") (5 . "мордад") (4 . "тір")
       (3 . "хордад") (2 . "ордібехешт") (1 . "фарвардін")))
     (ABBREVIATED
      (DEFAULT (12 . "есф.") (11 . "бах.") (10 . "дей") (9 . "азер")
       (8 . "абан") (7 . "мех.") (6 . "шах.") (5 . "мор.") (4 . "тір")
       (3 . "хор.") (2 . "орд.") (1 . "фар."))))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "Рейва") (235 . "Хейсей") (234 . "Сьова") (233 . "Тайсьо")
      (232 . "Мейдзі") (231 . "Кейо (1865–1868)") (230 . "Гендзі (1864–1865)")
      (229 . "Бункю (1861–1864)") (228 . "Ман’ен (1860–1861)")
      (227 . "Ансей (1854–1860)") (226 . "Каей (1848–1854)")
      (225 . "Кока (1844–1848)") (224 . "Тенпо (1830–1844)")
      (223 . "Бунсей (1818–1830)") (222 . "Бунка (1804–1818)")
      (221 . "Кьова (1801–1804)") (220 . "Кансей (1789–1801)")
      (219 . "Теммей (1781–1789)") (218 . "Ан’ей (1772–1781)")
      (217 . "Мейва (1764–1772)") (216 . "Хоряку (1751–1764)")
      (215 . "Кан’ен (1748–1751)") (214 . "Енкьо (1744–1748)")
      (213 . "Канпо (1741–1744)") (212 . "Гембун (1736–1741)")
      (211 . "Кьохо (1716–1736)") (210 . "Сьотоку (1711–1716)")
      (209 . "Хоей (1704–1711)") (208 . "Генроку (1688–1704)")
      (207 . "Дзьокьо (1684–1688)") (206 . "Тенва (1681–1684)")
      (205 . "Емпо (1673–1681)") (204 . "Камбун (1661–1673)")
      (203 . "Мандзі (1658–1661)") (202 . "Мейряку (1655–1658)")
      (201 . "Сьоо (1652–1655)") (200 . "Кейан (1648–1652)")
      (199 . "Сьохо (1644–1648)") (198 . "Кан’ей (1624–1644)")
      (197 . "Генна (1615–1624)") (196 . "Кейтьо (1596–1615)")
      (195 . "Бунроку (1592–1596)") (194 . "Тенсьо (1573–1592)")
      (193 . "Генкі (1570–1573)") (192 . "Ейроку (1558–1570)")
      (191 . "Кодзі (1555–1558)") (190 . "Теммон (1532–1555)")
      (189 . "Кьороку (1528–1532)") (188 . "Тайей (1521–1528)")
      (187 . "Ейсьо (1504–1521)") (186 . "Бункі (1501–1504)")
      (185 . "Мейо (1492–1501)") (184 . "Ентоку (1489–1492)")
      (183 . "Тьокьо (1487–1489)") (182 . "Буммей (1469–1487)")
      (181 . "Онін (1467–1469)") (180 . "Бунсьо (1466–1467)")
      (179 . "Кансьо (1460–1466)") (178 . "Тьороку (1457–1460)")
      (177 . "Косьо (1455–1457)") (176 . "Кьотоку (1452–1455)")
      (175 . "Хотоку (1449–1452)") (174 . "Буннан (1444–1449)")
      (173 . "Какіцу (1441–1444)") (172 . "Ейкьо (1429–1441)")
      (171 . "Сьотьо (1428–1429)") (170 . "Оей (1394–1428)")
      (169 . "Мейтоку (1390–1394)") (168 . "Коо (1389–1390)")
      (167 . "Какей (1387–1389)") (166 . "Мейтоку (1384–1387)")
      (165 . "Гентю (1384–1392)") (164 . "Кова (1381–1384)")
      (163 . "Коряку (1379–1381)") (162 . "Тендзю (1375–1379)")
      (161 . "Бунтю (1372–1375)") (160 . "Кентоку (1370–1372)")
      (159 . "Сьохей (1346–1370)") (158 . "Кококу (1340–1346)")
      (157 . "Ейген (1336–1340)") (156 . "Кемму (1334–1336)")
      (155 . "Генко (1331–1334)") (154 . "Гентоку (1329–1331)")
      (153 . "Карекі (1326–1329)") (152 . "Сьотю (1324–1326)")
      (151 . "Генкьо (1321–1324)") (150 . "Ген’о (1319–1321)")
      (149 . "Бумпо (1317–1319)") (148 . "Сьова (1312–1317)")
      (147 . "Отьо (1311–1312)") (146 . "Енкей (1308–1311)")
      (145 . "Токудзі (1306–1308)") (144 . "Каген (1303–1306)")
      (143 . "Кенген (1302–1303)") (142 . "Сьоан (1299–1302)")
      (141 . "Ейнін (1293–1299)") (140 . "Сьоо (1288–1293)")
      (139 . "Коан (1278–1288)") (138 . "Кендзі (1275–1278)")
      (137 . "Бун’ей (1264–1275)") (136 . "Котьо (1261–1264)")
      (135 . "Бун’о (1260–1261)") (134 . "Сьоген (1259–1260)")
      (133 . "Сьока (1257–1259)") (132 . "Коген (1256–1257)")
      (131 . "Кентьо (1249–1256)") (130 . "Хейдзі (1247–1249)")
      (129 . "Канген (1243–1247)") (128 . "Ніндзі (1240–1243)")
      (127 . "Ен’о (1239–1240)") (126 . "Рякунін (1238–1239)")
      (125 . "Катей (1235–1238)") (124 . "Бунряку (1234–1235)")
      (123 . "Темпуку (1233–1234)") (122 . "Дзюей (1232–1233)")
      (121 . "Канкі (1229–1232)") (120 . "Антей (1227–1229)")
      (119 . "Кароку (1225–1227)") (118 . "Геннін (1224–1225)")
      (117 . "Дзьоо (1222–1224)") (116 . "Дзьокю (1219–1222)")
      (115 . "Кенпо (1213–1219)") (114 . "Кенряку (1211–1213)")
      (113 . "Сьоген (1207–1211)") (112 . "Кен’ей (1206–1207)")
      (111 . "Генкю (1204–1206)") (110 . "Кеннін (1201–1204)")
      (109 . "Сьодзі (1199–1201)") (108 . "Кенкю (1190–1199)")
      (107 . "Бундзі (1185–1190)") (106 . "Генряку (1184–1185)")
      (105 . "Дзюей (1182–1184)") (104 . "Йова (1181–1182)")
      (103 . "Дзісьо (1177–1181)") (102 . "Анген (1175–1177)")
      (101 . "Сьоан (1171–1175)") (100 . "Као (1169–1171)")
      (99 . "Нін’ан (1166–1169)") (98 . "Ейман (1165–1166)")
      (97 . "Тьокан (1163–1165)") (96 . "Охо (1161–1163)")
      (95 . "Ейряку (1160–1161)") (94 . "Хейдзі (1159–1160)")
      (93 . "Хоген (1156–1159)") (92 . "Кюдзю (1154–1156)")
      (91 . "Німпей (1151–1154)") (90 . "Кюан (1145–1151)")
      (89 . "Теньо (1144–1145)") (88 . "Кодзі (1142–1144)")
      (87 . "Ейдзі (1141–1142)") (86 . "Хоен (1135–1141)")
      (85 . "Тьосьо (1132–1135)") (84 . "Тенсьо (1131–1132)")
      (83 . "Дайдзі (1126–1131)") (82 . "Тендзі (1124–1126)")
      (81 . "Хоан (1120–1124)") (80 . "Ген’ей (1118–1120)")
      (79 . "Ейкю (1113–1118)") (78 . "Тен’ей (1110–1113)")
      (77 . "Теннін (1108–1110)") (76 . "Кадзьо (1106–1108)")
      (75 . "Тьодзі (1104–1106)") (74 . "Кова (1099–1104)")
      (73 . "Сьотоку (1097–1099)") (72 . "Ейсьо (1096–1097)")
      (71 . "Кахо (1094–1096)") (70 . "Кандзі (1087–1094)")
      (69 . "Отоку (1084–1087)") (68 . "Ейхо (1081–1084)")
      (67 . "Сьоряку (1077–1081)") (66 . "Сьохо (1074–1077)")
      (65 . "Енкю (1069–1074)") (64 . "Дзіряку (1065–1069)")
      (63 . "Кохей (1058–1065)") (62 . "Тенгі (1053–1058)")
      (61 . "Ейсьо (1046–1053)") (60 . "Кантоку (1044–1046)")
      (59 . "Тьокю (1040–1044)") (58 . "Тьоряку (1037–1040)")
      (57 . "Тьоген (1028–1037)") (56 . "Мандзю (1024–1028)")
      (55 . "Дзіан (1021–1024)") (54 . "Каннін (1017–1021)")
      (53 . "Тьова (1012–1017)") (52 . "Канко (1004–1012)")
      (51 . "Тьохо (999–1004)") (50 . "Тьотоку (995–999)")
      (49 . "Сьоряку (990–995)") (48 . "Ейсо (989–990)")
      (47 . "Ейен (987–989)") (46 . "Канна (985–987)") (45 . "Ейкан (983–985)")
      (44 . "Тенген (978–983)") (43 . "Дзьоген (976–978)")
      (42 . "Тен’ен (973–976)") (41 . "Тенроку (970–973)")
      (40 . "Анна (968–970)") (39 . "Кохо (964–968)") (38 . "Ова (961–964)")
      (37 . "Тентоку (957–961)") (36 . "Тенряку (947–957)")
      (35 . "Тенгьо (938–947)") (34 . "Сьохей (931–938)")
      (33 . "Ентьо (923–931)") (32 . "Енгі (901–923)")
      (31 . "Сьотай (898–901)") (30 . "Кампьо (889–898)")
      (29 . "Нінна (885–889)") (28 . "Генкей (877–885)")
      (27 . "Дзьоган (859–877)") (26 . "Теннан (857–859)")
      (25 . "Сайко (854–857)") (24 . "Ніндзю (851–854)")
      (23 . "Кадзьо (848–851)") (22 . "Сьова (834–848)")
      (21 . "Тентьо (824–834)") (20 . "Конін (810–824)")
      (19 . "Дайдо (806–810)") (18 . "Енряку (782–806)")
      (17 . "Тен’о (781–782)") (16 . "Хокі (770–780)")
      (15 . "Дзінго кейун (767–770)") (14 . "Темпьо-дзінго (765–767)")
      (13 . "Темпьо-ходзі (757–765)") (12 . "Темпьо-сьохо (749–757)")
      (11 . "Темпьо-кампо (749–749)") (10 . "Темпьо (729–749)")
      (9 . "Дзінгі (724–729)") (8 . "Йоро (717–724)") (7 . "Рейкі (715–717)")
      (6 . "Вадо (708–715)") (5 . "Кейун (704–708)") (4 . "Тайхо (701–704)")
      (3 . "Сютьо (686–701)") (2 . "Хакухо (672–686)") (1 . "Хакуті (650–671)")
      (0 . "Тайка (645–650)")))))
  (ISLAMIC
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (12 . "зу-ль-х") (11 . "зу-ль-к") (10 . "дав") (9 . "рам")
       (8 . "шааб") (7 . "радж") (6 . "джум II") (5 . "джум I") (4 . "рабі II")
       (3 . "рабі I") (2 . "саф") (1 . "мух"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "зу-ль-хіджа") (11 . "зу-ль-каада") (10 . "даввал")
       (9 . "рамадан") (8 . "шаабан") (7 . "раджаб") (6 . "джумада II")
       (5 . "джумада I") (4 . "рабі II") (3 . "рабі I") (2 . "сафар")
       (1 . "мухаррам")))
     (ABBREVIATED
      (DEFAULT (12 . "зу-ль-х.") (11 . "зу-ль-к.") (10 . "дав.") (9 . "рам.")
       (8 . "шааб.") (7 . "радж.") (6 . "джум. II") (5 . "джум. I")
       (4 . "рабі II") (3 . "рабі I") (2 . "саф.") (1 . "мух."))))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "фальгуна") (11 . "магха") (10 . "пауса")
       (9 . "аграхаяна") (8 . "картіка") (7 . "асвіна") (6 . "бхадра")
       (5 . "шравана") (4 . "асадха") (3 . "джайстха") (2 . "вайсакха")
       (1 . "чайтра")))
     (ABBREVIATED
      (DEFAULT (12 . "фаль.") (11 . "маг.") (10 . "паус.") (9 . "агр.")
       (8 . "кар.") (7 . "асв.") (6 . "бхад.") (5 . "шрав.") (4 . "асад.")
       (3 . "джай.") (2 . "вайс.") (1 . "чайт."))))))
  (HEBREW
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (13 . "елул") (12 . "ав") (11 . "таммуз") (10 . "сиван")
       (9 . "іяр") (8 . "нісан") (7 . "адар II") (7 . "адар") (6 . "адар I")
       (5 . "шват") (4 . "тевет") (3 . "кіслев") (2 . "хешван")
       (1 . "тішри"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "елул") (12 . "аб") (11 . "таммуз") (10 . "сиван")
       (9 . "іар") (8 . "нісан") (7 . "адар II") (7 . "адар") (6 . "адар I")
       (5 . "шеват") (4 . "тебет") (3 . "числьов") (2 . "марчешван")
       (1 . "тішри"))))))
  (GREGORIAN
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "грудень") (11 . "листопад") (10 . "жовтень")
       (9 . "вересень") (8 . "серпень") (7 . "липень") (6 . "червень")
       (5 . "травень") (4 . "квітень") (3 . "березень") (2 . "лютий")
       (1 . "січень")))
     (NARROW
      (DEFAULT (12 . "Г") (11 . "Л") (10 . "Ж") (9 . "В") (8 . "С") (7 . "Л")
       (6 . "Ч") (5 . "Т") (4 . "К") (3 . "Б") (2 . "Л") (1 . "С"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "грудня") (11 . "листопада") (10 . "жовтня")
       (9 . "вересня") (8 . "серпня") (7 . "липня") (6 . "червня")
       (5 . "травня") (4 . "квітня") (3 . "березня") (2 . "лютого")
       (1 . "січня")))
     (NARROW
      (DEFAULT (12 . "г") (11 . "л") (10 . "ж") (9 . "в") (8 . "с") (7 . "л")
       (6 . "ч") (5 . "т") (4 . "к") (3 . "б") (2 . "л") (1 . "с")))
     (ABBREVIATED
      (DEFAULT (12 . "груд.") (11 . "лист.") (10 . "жовт.") (9 . "вер.")
       (8 . "серп.") (7 . "лип.") (6 . "черв.") (5 . "трав.") (4 . "квіт.")
       (3 . "бер.") (2 . "лют.") (1 . "січ.")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "С") (FRI . "П") (THU . "Ч") (WED . "С") (TUE . "В")
       (MON . "П") (SUN . "Н"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "субота") (FRI . "пʼятниця") (THU . "четвер")
       (WED . "середа") (TUE . "вівторок") (MON . "понеділок")
       (SUN . "неділя")))
     (ABBREVIATED
      (DEFAULT (SAT . "сб") (FRI . "пт") (THU . "чт") (WED . "ср") (TUE . "вт")
       (MON . "пн") (SUN . "нд")))))
   (QUARTERS
    (FORMAT
     (WIDE
      (DEFAULT (4 . "4-й квартал") (3 . "3-й квартал") (2 . "2-й квартал")
       (1 . "1-й квартал")))
     (ABBREVIATED
      (DEFAULT (4 . "4-й кв.") (3 . "3-й кв.") (2 . "2-й кв.")
       (1 . "1-й кв.")))))
   (DAY-PERIODS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ніч") (EVENING1 . "вечір") (AFTERNOON1 . "день")
       (MORNING1 . "ранок") (NOON . "полудень") (MIDNIGHT . "північ"))))
    (FORMAT
     (WIDE
      (DEFAULT (NIGHT1 . "ночі") (EVENING1 . "вечора") (AFTERNOON1 . "дня")
       (MORNING1 . "ранку") (NOON . "дня") (MIDNIGHT . "ночі")))
     (NARROW
      (DEFAULT (NIGHT1 . "ночі") (EVENING1 . "вечора") (AFTERNOON1 . "дня")
       (MORNING1 . "ранку") (NOON . "дня") (MIDNIGHT . "ночі")))
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "ночі") (EVENING1 . "вечора") (AFTERNOON1 . "дня")
       (MORNING1 . "ранку") (PM . "пп") (NOON . "дня") (AM . "дп")
       (MIDNIGHT . "ночі")))))
   (ERAS (ABBREVIATED (DEFAULT (1 . "н. е.") (0 . "до н. е.")))
    (NARROW (DEFAULT (1 . "н.е.") (0 . "до н.е.")))
    (WIDE (VARIANT (1 . "нової ери") (0 . "до нової ери"))
     (DEFAULT (1 . "нашої ери") (0 . "до нашої ери"))))
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.yy"))
    (MEDIUM (PATTERN . "d MMM y 'р'.")) (LONG (PATTERN . "d MMMM y 'р'."))
    (FULL (PATTERN . "EEEE, d MMMM y 'р'.")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "HH:mm:ss z")) (FULL (PATTERN . "HH:mm:ss zzzz")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "dd.MM.yy GGGGG"))
    (MEDIUM (PATTERN . "d MMM y 'р'. G")) (LONG (PATTERN . "d MMMM y 'р'. G"))
    (FULL (PATTERN . "EEEE, d MMMM y 'р'. G")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1}, {0}"))
    (MEDIUM (PATTERN . "{1}, {0}")) (LONG (PATTERN . "{1}, {0}"))
    (FULL (PATTERN . "{1}, {0}"))))
  (ETHIOPIC
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (13 . "пагумена") (12 . "нехасе") (11 . "хамле") (10 . "сене")
       (9 . "генбота") (8 . "міязія") (7 . "мегабіта") (6 . "єкатіта")
       (5 . "тера") (4 . "тахсаса") (3 . "хедара") (2 . "текемт")
       (1 . "мескерема")))
     (NARROW
      (DEFAULT (13 . "13") (12 . "12") (11 . "11") (10 . "10") (9 . "09")
       (8 . "08") (7 . "07") (6 . "06") (5 . "05") (4 . "04") (3 . "03")
       (2 . "02") (1 . "01"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "пагумена") (12 . "нехасе") (11 . "хамле") (10 . "сене")
       (9 . "генбота") (8 . "міязія") (7 . "мегабіта") (6 . "єкатіта")
       (5 . "тера") (4 . "тахсаса") (3 . "хедара") (2 . "текемта")
       (1 . "мескерема")))
     (ABBREVIATED
      (DEFAULT (13 . "паг.") (12 . "нех.") (11 . "хам.") (10 . "сен.")
       (9 . "ген.") (8 . "міяз.") (7 . "мег.") (6 . "єкат.") (5 . "тер.")
       (4 . "тах.") (3 . "хед.") (2 . "тек.") (1 . "мес."))))))
  (COPTIC
   (MONTHS
    (STAND-ALONE
     (ABBREVIATED
      (DEFAULT (13 . "нас") (12 . "мис") (11 . "аб") (10 . "баун") (9 . "баш")
       (8 . "барм") (7 . "барам") (6 . "амш") (5 . "тоб") (4 . "кіх")
       (3 . "хат") (2 . "баб") (1 . "тот"))))
    (FORMAT
     (WIDE
      (DEFAULT (13 . "насі") (12 . "мисра") (11 . "абіб") (10 . "бауна")
       (9 . "башнас") (8 . "бармуда") (7 . "барамхат") (6 . "амшир")
       (5 . "тобе") (4 . "кіхак") (3 . "хатур") (2 . "бабе") (1 . "тот")))
     (ABBREVIATED
      (DEFAULT (13 . "нас.") (12 . "мис.") (11 . "аб.") (10 . "баун.")
       (9 . "баш.") (8 . "барм.") (7 . "барам.") (6 . "амш.") (5 . "тоб.")
       (4 . "кіх.") (3 . "хат.") (2 . "баб.") (1 . "тот"))))))
  (BUDDHIST
   (ERAS (ABBREVIATED (DEFAULT (0 . "б. е.")))
    (NARROW (DEFAULT (0 . "б.е.")))))))
