((LANGUAGE . "yue") (SCRIPT . "Hans")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "民国") (0 . "民国前"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gyy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月") (8 . "8月")
       (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月") (2 . "2月")
       (1 . "1月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "波斯历")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "令和") (235 . "平成") (234 . "昭和") (233 . "大正") (232 . "明治")
      (231 . "庆应") (230 . "元治") (229 . "文久") (228 . "万延") (227 . "安政")
      (226 . "嘉永") (225 . "弘化") (224 . "天保") (223 . "文政") (222 . "文化")
      (221 . "享和") (220 . "宽政") (219 . "天明") (218 . "安永") (217 . "明和")
      (216 . "宝历") (215 . "宽延") (214 . "延享") (213 . "宽保") (212 . "元文")
      (211 . "享保") (210 . "正德") (209 . "宝永") (208 . "元禄") (207 . "贞享")
      (206 . "天和") (205 . "延宝") (204 . "宽文") (203 . "万治") (202 . "明历")
      (201 . "承应") (200 . "庆安") (199 . "正保") (198 . "宽永") (197 . "元和")
      (196 . "庆长") (195 . "文禄") (194 . "天正") (193 . "元龟") (192 . "永禄")
      (191 . "弘治") (190 . "天文") (189 . "享禄") (188 . "大永") (187 . "永正")
      (186 . "文龟") (185 . "明应") (184 . "延德") (183 . "长享") (182 . "文明")
      (181 . "应仁") (180 . "文正") (179 . "宽正") (178 . "长禄") (177 . "康正")
      (176 . "享德") (175 . "宝德") (174 . "文安") (173 . "嘉吉") (172 . "永享")
      (171 . "正长") (170 . "应永") (169 . "明德") (168 . "康应") (167 . "嘉庆")
      (166 . "至德") (165 . "元中") (164 . "弘和") (163 . "康历") (162 . "天授")
      (161 . "文中") (160 . "建德") (159 . "正平") (158 . "兴国") (157 . "延元")
      (156 . "建武") (155 . "元弘") (154 . "元德") (153 . "嘉历") (152 . "正中")
      (151 . "元亨") (150 . "元应") (149 . "文保") (148 . "正和") (147 . "应长")
      (146 . "延庆") (145 . "德治") (144 . "嘉元") (143 . "干元") (142 . "正安")
      (141 . "永仁") (140 . "正应") (139 . "弘安") (138 . "建治") (137 . "文永")
      (136 . "弘长") (135 . "文应") (134 . "正元") (133 . "正嘉") (132 . "康元")
      (131 . "建长") (130 . "宝治") (129 . "宽元") (128 . "仁治") (127 . "延应")
      (126 . "历仁") (125 . "嘉祯") (124 . "文历") (123 . "天福") (122 . "贞永")
      (121 . "宽喜") (120 . "安贞") (119 . "嘉禄") (118 . "元仁") (117 . "贞应")
      (116 . "承久") (115 . "建保") (114 . "建历") (113 . "承元") (112 . "建永")
      (111 . "元久") (110 . "建仁") (109 . "正治") (108 . "建久") (107 . "文治")
      (106 . "元历") (105 . "寿永") (104 . "养和") (103 . "治承") (102 . "安元")
      (101 . "承安") (100 . "嘉应") (99 . "仁安") (98 . "永万") (97 . "长宽") (96 . "应保")
      (95 . "永历") (94 . "平治") (93 . "保元") (92 . "久寿") (91 . "仁平") (90 . "久安")
      (89 . "天养") (88 . "康治") (87 . "永治") (86 . "保延") (85 . "长承") (84 . "天承")
      (83 . "大治") (82 . "天治") (81 . "保安") (80 . "元永") (79 . "永久") (78 . "天永")
      (77 . "天仁") (76 . "嘉承") (75 . "长治") (74 . "康和") (73 . "承德") (72 . "永长")
      (71 . "嘉保") (70 . "宽治") (69 . "应德") (68 . "永保") (67 . "承历") (66 . "承保")
      (65 . "延久") (64 . "治历") (63 . "康平") (62 . "天喜") (61 . "永承") (60 . "宽德")
      (59 . "长久") (58 . "长历") (57 . "长元") (56 . "万寿") (55 . "治安") (54 . "宽仁")
      (53 . "长和") (52 . "宽弘") (51 . "长保") (50 . "长德") (49 . "正历") (48 . "永祚")
      (47 . "永延") (46 . "宽和") (45 . "永观") (44 . "天元") (43 . "贞元") (42 . "天延")
      (41 . "天禄") (40 . "安和") (39 . "康保") (38 . "应和") (37 . "天德") (36 . "天历")
      (35 . "天庆") (34 . "承平") (33 . "延长") (32 . "延喜") (31 . "昌泰") (30 . "宽平")
      (29 . "仁和") (28 . "元庆") (27 . "贞观") (26 . "天安") (25 . "齐衡") (24 . "仁寿")
      (23 . "嘉祥") (22 . "承和") (21 . "天长") (20 . "弘仁") (19 . "大同") (18 . "延历")
      (17 . "天应") (16 . "宝龟") (15 . "神护景云") (14 . "天平神护") (13 . "天平宝字")
      (12 . "天平胜宝") (11 . "天平感宝") (10 . "天平") (9 . "神龟") (8 . "养老") (7 . "灵龟")
      (6 . "和铜") (5 . "庆云") (4 . "大宝") (3 . "朱鸟") (2 . "白凤") (1 . "白雉")
      (0 . "大化"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gyy-MM-dd")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "都尔黑哲月") (11 . "都尔喀尔德月") (10 . "闪瓦鲁月") (9 . "赖买丹月")
       (8 . "舍尔邦月") (7 . "赖哲卜月") (6 . "主马达月 II") (5 . "主马达月 I") (4 . "赖比月 II")
       (3 . "赖比月 I") (2 . "色法尔月") (1 . "穆哈兰姆月")))
     (ABBREVIATED
      (DEFAULT (12 . "都尔黑哲月") (11 . "都尔喀尔德月") (10 . "闪瓦鲁月") (9 . "赖买丹月")
       (8 . "舍尔邦月") (7 . "赖哲卜月") (6 . "主马达月 II") (5 . "主马达月 I") (4 . "赖比月 II")
       (3 . "赖比月 I") (2 . "色法尔月") (1 . "穆哈兰姆月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "伊斯兰历"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "颇勒窭拏月") (11 . "磨祛月") (10 . "报沙月") (9 . "末伽始罗月")
       (8 . "迦剌底迦月") (7 . "頞泾缚庚阇月") (6 . "婆罗钵陀月") (5 . "室罗伐拏月") (4 . "頞沙荼月")
       (3 . "逝瑟咤月") (2 . "吠舍佉月") (1 . "制檀逻月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "印度历")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "以禄月") (12 . "埃波月") (11 . "搭模斯月") (10 . "西弯月") (9 . "以珥月")
       (8 . "尼散月") (7 . "亚达月 II") (7 . "亚达月") (6 . "亚达月 I") (5 . "细罢特月")
       (4 . "提别月") (3 . "基斯流月") (2 . "玛西班月") (1 . "提斯利月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "创世纪元"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy-M-d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "一月")))
     (ABBREVIATED
      (DEFAULT (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月") (8 . "8月")
       (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月") (2 . "2月")
       (1 . "1月")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "六") (FRI . "五") (THU . "四") (WED . "三") (TUE . "二")
       (MON . "一") (SUN . "日"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "星期六") (FRI . "星期五") (THU . "星期四") (WED . "星期三")
       (TUE . "星期二") (MON . "星期一") (SUN . "星期日")))
     (ABBREVIATED
      (DEFAULT (SAT . "周六") (FRI . "周五") (THU . "周四") (WED . "周三") (TUE . "周二")
       (MON . "周一") (SUN . "周日")))))
   (QUARTERS
    (FORMAT (WIDE (DEFAULT (4 . "第4季") (3 . "第3季") (2 . "第2季") (1 . "第1季")))))
   (DAY-PERIODS
    (FORMAT
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "凌晨") (EVENING1 . "夜晚") (AFTERNOON2 . "下昼")
       (AFTERNOON1 . "中午") (MORNING2 . "朝早") (MORNING1 . "清晨") (PM . "下午")
       (AM . "上午") (MIDNIGHT . "午夜")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "公元") (0 . "公元前"))
     (DEFAULT (1 . "西元") (0 . "西元前"))))
   (DATE-FORMATS (SHORT (PATTERN . "y/M/d")) (MEDIUM (PATTERN . "y年M月d日"))
    (LONG (PATTERN . "y年M月d日")) (FULL (PATTERN . "y年M月d日EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "HH:mm")) (MEDIUM (PATTERN . "HH:mm:ss"))
    (LONG (PATTERN . "z HH:mm:ss")) (FULL (PATTERN . "zzzz HH:mm:ss")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年MM月d日"))
    (LONG (PATTERN . "Gy年MM月d日")) (FULL (PATTERN . "Gy年MM月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "13月") (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月")
       (8 . "8月") (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月")
       (2 . "2月") (1 . "1月"))))))
  (DANGI
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))
     (NARROW
      (DEFAULT (12 . "十二") (11 . "十一") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正")))
     (ABBREVIATED
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))
     (NARROW
      (DEFAULT (12 . "十二") (11 . "十一") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正")))
     (ABBREVIATED
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))))
   (DATE-FORMATS (SHORT (PATTERN . "U/M/d")) (MEDIUM (PATTERN . "U年MMMd日"))
    (LONG (PATTERN . "U年MMMd日")) (FULL (PATTERN . "U年MMMd日EEEE"))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "13月") (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月")
       (8 . "8月") (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月")
       (2 . "2月") (1 . "1月"))))))
  (CHINESE
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "腊") (11 . "冬") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "腊月") (11 . "冬月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))))
   (DATE-FORMATS (SHORT (PATTERN . "r/M/d")) (MEDIUM (PATTERN . "r年MMMd"))
    (LONG (PATTERN . "rU年MMMd")) (FULL (PATTERN . "rU年MMMdEEEE"))))
  (BUDDHIST (ERAS (ABBREVIATED (DEFAULT (0 . "佛历"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy-M-d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE"))))))
