((LANGUAGE . "zh") (SCRIPT . "Hant")
 (CALENDARS
  (ROC (ERAS (ABBREVIATED (DEFAULT (1 . "民國") (0 . "民國前"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日 EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1}{0}"))))
  (PERSIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月") (8 . "8月")
       (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月") (2 . "2月")
       (1 . "1月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "波斯曆")))))
  (JAPANESE
   (ERAS
    (ABBREVIATED
     (DEFAULT (236 . "令和") (235 . "平成") (234 . "昭和") (233 . "大正") (232 . "明治")
      (231 . "慶應") (230 . "元治") (229 . "文久") (228 . "萬延") (227 . "安政")
      (226 . "嘉永") (225 . "弘化") (224 . "天保") (223 . "文政") (222 . "文化")
      (221 . "享和") (220 . "寬政") (219 . "天明") (218 . "安永") (217 . "明和")
      (216 . "寶曆") (215 . "寬延") (214 . "延享") (213 . "寬保") (212 . "元文")
      (211 . "享保") (210 . "正德") (209 . "寶永") (208 . "元祿") (207 . "貞享")
      (206 . "天和") (205 . "延寶") (204 . "寬文") (203 . "萬治") (202 . "明曆")
      (201 . "承應") (200 . "慶安") (199 . "正保") (198 . "寬永") (197 . "元和")
      (196 . "慶長") (195 . "文祿") (194 . "天正") (193 . "元龜") (192 . "永祿")
      (191 . "弘治") (190 . "天文") (189 . "享祿") (188 . "大永") (187 . "永正")
      (186 . "文龜") (185 . "明應") (184 . "延德") (183 . "長享") (182 . "文明")
      (181 . "應仁") (180 . "文正") (179 . "寬正") (178 . "長祿") (177 . "康正")
      (176 . "享德") (175 . "寶德") (174 . "文安") (173 . "嘉吉") (172 . "永享")
      (171 . "正長") (170 . "應永") (169 . "明德") (168 . "康應") (167 . "嘉慶")
      (166 . "至德") (165 . "元中") (164 . "弘和") (163 . "康曆") (162 . "天授")
      (161 . "文中") (160 . "建德") (159 . "正平") (158 . "興國") (157 . "延元")
      (156 . "建武") (155 . "元弘") (154 . "元德") (153 . "嘉曆") (152 . "正中")
      (151 . "元亨") (150 . "元應") (149 . "文保") (148 . "正和") (147 . "應長")
      (146 . "延慶") (145 . "德治") (144 . "嘉元") (143 . "乾元") (142 . "正安")
      (141 . "永仁") (140 . "正應") (139 . "弘安") (138 . "建治") (137 . "文永")
      (136 . "弘長") (135 . "文應") (134 . "正元") (133 . "正嘉") (132 . "康元")
      (131 . "建長") (130 . "寶治") (129 . "寬元") (128 . "仁治") (127 . "延應")
      (126 . "曆仁") (125 . "嘉禎") (124 . "文曆") (123 . "天福") (122 . "貞永")
      (121 . "寬喜") (120 . "安貞") (119 . "嘉祿") (118 . "元仁") (117 . "貞應")
      (116 . "承久") (115 . "建保") (114 . "建曆") (113 . "承元") (112 . "建永")
      (111 . "元久") (110 . "建仁") (109 . "正治") (108 . "建久") (107 . "文治")
      (106 . "元曆") (105 . "壽永") (104 . "養和") (103 . "治承") (102 . "安元")
      (101 . "承安") (100 . "嘉應") (99 . "仁安") (98 . "永萬") (97 . "長寬") (96 . "應保")
      (95 . "永曆") (94 . "平治") (93 . "保元") (92 . "久壽") (91 . "仁平") (90 . "久安")
      (89 . "天養") (88 . "康治") (87 . "永治") (86 . "保延") (85 . "長承") (84 . "天承")
      (83 . "大治") (82 . "天治") (81 . "保安") (80 . "元永") (79 . "永久") (78 . "天永")
      (77 . "天仁") (76 . "嘉承") (75 . "長治") (74 . "康和") (73 . "承德") (72 . "永長")
      (71 . "嘉保") (70 . "寬治") (69 . "應德") (68 . "永保") (67 . "承曆") (66 . "承保")
      (65 . "延久") (64 . "治曆") (63 . "康平") (62 . "天喜") (61 . "永承") (60 . "寬德")
      (59 . "長久") (58 . "長曆") (57 . "長元") (56 . "萬壽") (55 . "治安") (54 . "寬仁")
      (53 . "長和") (52 . "寬弘") (51 . "長保") (50 . "長德") (49 . "正曆") (48 . "永祚")
      (47 . "永延") (46 . "寬和") (45 . "永觀") (44 . "天元") (43 . "貞元") (42 . "天延")
      (41 . "天祿") (40 . "安和") (39 . "康保") (38 . "應和") (37 . "天德") (36 . "天曆")
      (35 . "天慶") (34 . "承平") (33 . "延長") (32 . "延喜") (31 . "昌泰") (30 . "寬平")
      (29 . "仁和") (28 . "元慶") (27 . "貞觀") (26 . "天安") (25 . "齊衡") (24 . "仁壽")
      (23 . "嘉祥") (22 . "承和") (21 . "天長") (20 . "弘仁") (19 . "大同") (18 . "延曆")
      (17 . "天應") (16 . "寶龜") (15 . "神護景雲") (14 . "天平神護") (13 . "天平寶字")
      (12 . "天平勝寶") (11 . "天平感寶") (10 . "天平") (9 . "神龜") (8 . "養老") (7 . "靈龜")
      (6 . "和銅") (5 . "慶雲") (4 . "大寶") (3 . "朱鳥") (2 . "白鳳") (1 . "白雉")
      (0 . "大化")))
    (NARROW
     (DEFAULT (236 . "令和") (235 . "平成") (234 . "昭和") (233 . "大正") (232 . "明治")
      (231 . "慶應") (230 . "元治") (229 . "文久") (228 . "萬延") (227 . "安政")
      (226 . "嘉永") (225 . "弘化") (224 . "天保") (223 . "文政") (222 . "文化")
      (221 . "享和") (220 . "寬政") (219 . "天明") (218 . "安永") (217 . "明和")
      (216 . "寶曆") (215 . "寬延") (214 . "延享") (213 . "寬保") (212 . "元文")
      (211 . "享保") (210 . "正德") (209 . "寶永") (208 . "元祿") (207 . "貞享")
      (206 . "天和") (205 . "延寶") (204 . "寬文") (203 . "萬治") (202 . "明曆")
      (201 . "承應") (200 . "慶安") (199 . "正保") (198 . "寬永") (197 . "元和")
      (196 . "慶長") (195 . "文祿") (194 . "天正") (193 . "元龜") (192 . "永祿")
      (191 . "弘治") (190 . "天文") (189 . "享祿") (188 . "大永") (187 . "永正")
      (186 . "文龜") (185 . "明應") (184 . "延德") (183 . "長享") (182 . "文明")
      (181 . "應仁") (180 . "文正") (179 . "寬正") (178 . "長祿") (177 . "康正")
      (176 . "享德") (175 . "寶德") (174 . "文安") (173 . "嘉吉") (172 . "永享")
      (171 . "正長") (170 . "應永") (169 . "明德") (168 . "康應") (167 . "嘉慶")
      (166 . "至德") (165 . "元中") (164 . "弘和") (163 . "康曆") (162 . "天授")
      (161 . "文中") (160 . "建德") (159 . "正平") (158 . "興國") (157 . "延元")
      (156 . "建武") (155 . "元弘") (154 . "元德") (153 . "嘉曆") (152 . "正中")
      (151 . "元亨") (150 . "元應") (149 . "文保") (148 . "正和") (147 . "應長")
      (146 . "延慶") (145 . "德治") (144 . "嘉元") (143 . "乾元") (142 . "正安")
      (141 . "永仁") (140 . "正應") (139 . "弘安") (138 . "建治") (137 . "文永")
      (136 . "弘長") (135 . "文應") (134 . "正元") (133 . "正嘉") (132 . "康元")
      (131 . "建長") (130 . "寶治") (129 . "寬元") (128 . "仁治") (127 . "延應")
      (126 . "曆仁") (125 . "嘉禎") (124 . "文曆") (123 . "天福") (122 . "貞永")
      (121 . "寬喜") (120 . "安貞") (119 . "嘉祿") (118 . "元仁") (117 . "貞應")
      (116 . "承久") (115 . "建保") (114 . "建曆") (113 . "承元") (112 . "建永")
      (111 . "元久") (110 . "建仁") (109 . "正治") (108 . "建久") (107 . "文治")
      (106 . "元曆") (105 . "壽永") (104 . "養和") (103 . "治承") (102 . "安元")
      (101 . "承安") (100 . "嘉應") (99 . "仁安") (98 . "永萬") (97 . "長寬") (96 . "應保")
      (95 . "永曆") (94 . "平治") (93 . "保元") (92 . "久壽") (91 . "仁平") (90 . "久安")
      (89 . "天養") (88 . "康治") (87 . "永治") (86 . "保延") (85 . "長承") (84 . "天承")
      (83 . "大治") (82 . "天治") (81 . "保安") (80 . "元永") (79 . "永久") (78 . "天永")
      (77 . "天仁") (76 . "嘉承") (75 . "長治") (74 . "康和") (73 . "承德") (72 . "永長")
      (71 . "嘉保") (70 . "寬治") (69 . "應德") (68 . "永保") (67 . "承曆") (66 . "承保")
      (65 . "延久") (64 . "治曆") (63 . "康平") (62 . "天喜") (61 . "永承") (60 . "寬德")
      (59 . "長久") (58 . "長曆") (57 . "長元") (56 . "萬壽") (55 . "治安") (54 . "寬仁")
      (53 . "長和") (52 . "寬弘") (51 . "長保") (50 . "長德") (49 . "正曆") (48 . "永祚")
      (47 . "永延") (46 . "寬和") (45 . "永觀") (44 . "天元") (43 . "貞元") (42 . "天延")
      (41 . "天祿") (40 . "安和") (39 . "康保") (38 . "應和") (37 . "天德") (36 . "天曆")
      (35 . "天慶") (34 . "承平") (33 . "延長") (32 . "延喜") (31 . "昌泰") (30 . "寬平")
      (29 . "仁和") (28 . "元慶") (27 . "貞觀") (26 . "天安") (25 . "齊衡") (24 . "仁壽")
      (23 . "嘉祥") (22 . "承和") (21 . "天長") (20 . "弘仁") (19 . "大同") (18 . "延曆")
      (17 . "天應") (16 . "寶龜") (15 . "神護景雲") (14 . "天平神護") (13 . "天平寶字")
      (12 . "天平勝寶") (11 . "天平感寶") (10 . "天平") (9 . "神龜") (8 . "養老") (7 . "靈龜")
      (6 . "和銅") (5 . "慶雲") (4 . "大寶") (3 . "朱鳥") (2 . "白鳳") (1 . "白雉")
      (0 . "大化"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))))
  (ISLAMIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "都爾黑哲月") (11 . "都爾喀爾德月") (10 . "閃瓦魯月") (9 . "賴買丹月")
       (8 . "舍爾邦月") (7 . "賴哲卜月") (6 . "主馬達月 II") (5 . "主馬達月 I") (4 . "賴比月 II")
       (3 . "賴比月 I") (2 . "色法爾月") (1 . "穆哈蘭姆月")))
     (ABBREVIATED
      (DEFAULT (12 . "都爾黑哲月") (11 . "都爾喀爾德月") (10 . "閃瓦魯月") (9 . "賴買丹月")
       (8 . "舍爾邦月") (7 . "賴哲卜月") (6 . "主馬達月 II") (5 . "主馬達月 I") (4 . "賴比月 II")
       (3 . "賴比月 I") (2 . "色法爾月") (1 . "穆哈蘭姆月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "伊斯蘭曆"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1}{0}"))))
  (INDIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "頗勒窶拏月") (11 . "磨祛月") (10 . "報沙月") (9 . "末伽始羅月")
       (8 . "迦剌底迦月") (7 . "頞涇縛庚闍月") (6 . "婆羅鉢陀月") (5 . "室羅伐拏月") (4 . "頞沙荼月")
       (3 . "逝瑟吒月") (2 . "吠舍佉月") (1 . "制檀邏月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "印度曆")))))
  (HEBREW
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "以祿月") (12 . "埃波月") (11 . "搭模斯月") (10 . "西彎月") (9 . "以珥月")
       (8 . "尼散月") (7 . "亞達月 II") (7 . "亞達月") (6 . "亞達月 I") (5 . "細罷特月")
       (4 . "提別月") (3 . "基斯流月") (2 . "瑪西班月") (1 . "提斯利月")))))
   (ERAS (ABBREVIATED (DEFAULT (0 . "創世紀元"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1}{0}"))))
  (GREGORIAN
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月") (8 . "8月")
       (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月") (2 . "2月")
       (1 . "1月")))))
   (DAYS
    (STAND-ALONE
     (NARROW
      (DEFAULT (SAT . "六") (FRI . "五") (THU . "四") (WED . "三") (TUE . "二")
       (MON . "一") (SUN . "日"))))
    (FORMAT
     (WIDE
      (DEFAULT (SAT . "星期六") (FRI . "星期五") (THU . "星期四") (WED . "星期三")
       (TUE . "星期二") (MON . "星期一") (SUN . "星期日")))
     (SHORT
      (DEFAULT (SAT . "六") (FRI . "五") (THU . "四") (WED . "三") (TUE . "二")
       (MON . "一") (SUN . "日")))
     (ABBREVIATED
      (DEFAULT (SAT . "週六") (FRI . "週五") (THU . "週四") (WED . "週三") (TUE . "週二")
       (MON . "週一") (SUN . "週日")))))
   (QUARTERS
    (FORMAT (WIDE (DEFAULT (4 . "第4季") (3 . "第3季") (2 . "第2季") (1 . "第1季")))))
   (DAY-PERIODS
    (FORMAT
     (ABBREVIATED
      (DEFAULT (NIGHT1 . "凌晨") (EVENING1 . "晚上") (AFTERNOON2 . "下午")
       (AFTERNOON1 . "中午") (MORNING2 . "上午") (MORNING1 . "清晨") (PM . "下午")
       (AM . "上午") (MIDNIGHT . "午夜")))))
   (ERAS
    (ABBREVIATED (VARIANT (1 . "公元") (0 . "公元前"))
     (DEFAULT (1 . "西元") (0 . "西元前"))))
   (DATE-FORMATS (SHORT (PATTERN . "y/M/d")) (MEDIUM (PATTERN . "y年M月d日"))
    (LONG (PATTERN . "y年M月d日")) (FULL (PATTERN . "y年M月d日 EEEE")))
   (TIME-FORMATS (SHORT (PATTERN . "Bh:mm")) (MEDIUM (PATTERN . "Bh:mm:ss"))
    (LONG (PATTERN . "Bh:mm:ss [z]")) (FULL (PATTERN . "Bh:mm:ss [zzzz]")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (GENERIC
   (DATE-FORMATS (SHORT (PATTERN . "G y/M/d")) (MEDIUM (PATTERN . "G y年M月d日"))
    (LONG (PATTERN . "G y年M月d日")) (FULL (PATTERN . "G y年M月d日 EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1}{0}"))))
  (ETHIOPIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "13月") (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月")
       (8 . "8月") (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月")
       (2 . "2月") (1 . "1月"))))))
  (DANGI
   (MONTHS
    (STAND-ALONE
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))
     (NARROW
      (DEFAULT (12 . "十二") (11 . "十一") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正")))
     (ABBREVIATED
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))
     (NARROW
      (DEFAULT (12 . "十二") (11 . "十一") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正")))
     (ABBREVIATED
      (DEFAULT (12 . "十二月") (11 . "十一月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))))
   (DATE-FORMATS (SHORT (PATTERN . "U/M/d")) (MEDIUM (PATTERN . "U年MMMd日"))
    (LONG (PATTERN . "U年MMMd日")) (FULL (PATTERN . "U年MMMd日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (COPTIC
   (MONTHS
    (FORMAT
     (WIDE
      (DEFAULT (13 . "13月") (12 . "12月") (11 . "11月") (10 . "10月") (9 . "9月")
       (8 . "8月") (7 . "7月") (6 . "6月") (5 . "5月") (4 . "4月") (3 . "3月")
       (2 . "2月") (1 . "1月"))))))
  (CHINESE
   (MONTHS
    (STAND-ALONE
     (NARROW
      (DEFAULT (12 . "臘") (11 . "冬") (10 . "十") (9 . "九") (8 . "八") (7 . "七")
       (6 . "六") (5 . "五") (4 . "四") (3 . "三") (2 . "二") (1 . "正"))))
    (FORMAT
     (WIDE
      (DEFAULT (12 . "臘月") (11 . "冬月") (10 . "十月") (9 . "九月") (8 . "八月")
       (7 . "七月") (6 . "六月") (5 . "五月") (4 . "四月") (3 . "三月") (2 . "二月")
       (1 . "正月")))))
   (DATE-FORMATS (SHORT (PATTERN . "r/M/d")) (MEDIUM (PATTERN . "r年MMMd"))
    (LONG (PATTERN . "rU年MMMd")) (FULL (PATTERN . "rU年MMMd EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1} {0}"))))
  (BUDDHIST (ERAS (ABBREVIATED (DEFAULT (0 . "佛曆"))))
   (DATE-FORMATS (SHORT (PATTERN . "Gy/M/d")) (MEDIUM (PATTERN . "Gy年M月d日"))
    (LONG (PATTERN . "Gy年M月d日")) (FULL (PATTERN . "Gy年M月d日EEEE")))
   (DATETIME-FORMATS (SHORT (PATTERN . "{1} {0}"))
    (MEDIUM (PATTERN . "{1} {0}")) (LONG (PATTERN . "{1} {0}"))
    (FULL (PATTERN . "{1}{0}"))))))
